{"id":10571,"date":"2021-08-21T20:58:03","date_gmt":"2021-08-22T03:58:03","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=10571"},"modified":"2023-10-14T09:49:54","modified_gmt":"2023-10-14T16:49:54","slug":"10-stocks-etfs-for-the-long-run-investment-longboats","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2021\/08\/10-stocks-etfs-for-the-long-run-investment-longboats\/","title":{"rendered":"7 Stocks &#038; ETFs For The Long Run &#8211; Investment &#8220;Longboats&#8221;"},"content":{"rendered":"<p style=\"text-align: left;\"><em>This post is now updated to reflect more emphasis on Exchange Traded Funds vs. individual equities. Although there are still a few buy and hold equities for the long run, but I have realized there is a great benefit to holding a basket of stocks with a particular mix in order to balance the risk that comes from individual securities. Some even say we should very rarely hold individual stock and opt for broad based ETF&#8217;s and funds.<\/em><\/p>\n<h2 style=\"text-align: left;\"><strong>Investment &#8220;Long Boats&#8221; or &#8220;RELAX AND DO SOME MEDITATION INVESTMENTS&#8221;<\/strong><\/h2>\n<p style=\"text-align: left;\"><span class=\"s2\">On the journey to FI (Financial Independence), one of <\/span><span class=\"s2\">the biggest questions is to identify investment vehicles or what we call investment &#8220;longboats&#8221;. There are obviously many options available that run the gambit from S&amp;P500 Index funds, Bond funds, REITS, Stocks, etc. In many ways there are too many options. One must determine how comfortable they are with risk and their projected time frame prior to jumping into any investment. I am re framing these as investments that I really do not worry about. I can add positions, sit back and enjoy the ride. Is there risk, yes, but I believe these are investments that will allow a person to do some meditation and yoga and not track too closely.<\/span><\/p>\n<h3 style=\"text-align: left;\"><em><span class=\"s2\">For most folks the best way to invest is in broad based exchange traded funds or index funds that are balanced to match individual risk tolerance. Things like the Vanguard Dividend Appreciation Fund VDADX, Vanguard U.S. Growth or Vanguard Wellington Fund, etc. There are many highly rated and diversified mutual funds and exchange traded funds that give an investor exposure to the broader market and the opportunity for compound growth.<\/span><\/em><\/h3>\n<h3 style=\"text-align: left;\"><em><span class=\"s2\">But after these types of accounts have been funded, some of us also like to identify long term companies and funds to hold and profit from. The individual stock approach takes more research and involves more risk and should be balanced with various funds.<\/span><\/em><\/h3>\n<h2><\/h2>\n<h2><strong>VIKING LONGBOATS<\/strong><\/h2>\n<p style=\"text-align: left;\"><span class=\"s2\">Investment &#8220;longboats&#8221; are what carry a person and provide the leverage to build wealth over time and sustain their cost of living. in other words, without investment vehicles money would simply sit in a savings account. This is a good start, but the problem is with inflation. Inflation simply erodes the purchasing power of each dollar in a savings account. Over the course of a 20, 30, 40 or <\/span><span class=\"s2\">50 year<\/span><span class=\"s2\"> retirement period, that money will lose buying power every year. $300,000 sitting in a savings account will only have the buying power of $100,000 or lower over time and so on. This means that our money needs to make money in order to grow wealth and beat inflation.<\/span><\/p>\n<p style=\"text-align: left;\">Therefore, our money must earn money. We need to invest to earn some kind of healthy interest rate. This is how we tripled net worth in 8 years using the <a href=\"https:\/\/themoneyvikings.net\/2018\/12\/21\/the-investing-trifecta-how-i-tripled-net-worth-in-10-years\/\" target=\"_blank\" rel=\"noopener\">Investing Trifecta.<\/a><\/p>\n<h2 style=\"text-align: left;\"><strong>A simple approach<\/strong><\/h2>\n<p style=\"text-align: left;\"><span class=\"s2\">I do not enjoy managing complicated portfolios. <\/span><span class=\"s2\">Therefore<\/span><span class=\"s2\"> it can be a great strategy to find long term investments that can be acquired, added too and left alone to compound for many years to come.<\/span><span class=\"s2\"> Warren Buffett famously has a stock holding period of ideally “forever”.<\/span><span class=\"s2\"> In other words, find well managed companies, with a straightforward product, high moats and barriers to entry for competition, etc.<\/span><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\">Forever is not realistic for most us, but a very long time is probably the best strategy. We want to ignore day to day gyrations in the stock market if we are long term investors.<\/span><\/p>\n<h2 style=\"text-align: left;\"><strong>The basics: own the market through index funds<\/strong><\/h2>\n<p style=\"text-align: left;\"><span class=\"s2\">Vanguard founder Jack Bogle famously popularized the concept owning a slice of the entire market through index funds. This is the strategy for millions, including myself, for the majority of the portfolio. The key here is to dollar cost average and keep expenses low as you <\/span><span class=\"s2\">buys<\/span><span class=\"s2\"> index shares every couple of weeks.See our related strategy, THE INVEStING TRIFECTA. <\/span><span class=\"s2\">But if you have this strategy down, it might be time to diversify into some high quality individual stocks.<\/span><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\">See<\/span><span class=\"s2\">, the entire market <\/span><span class=\"s2\">(i.e. S&amp; P 500) <\/span><span class=\"s2\">is actually estimated to return a bummer decade, with experts saying perhaps a 2% return. <\/span><span class=\"s2\">This may not keep up with inflation and is not much better than a high yield savings account. <\/span><span class=\"s2\">I am still going to acquire shares of index funds over this time, but I am also diversifying into some individual stocks that pay dividends and REITS. But what stocks should be considered?<\/span><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\">Investing in individual stocks is by nature difficult and risky. Even the pros like Warren B<\/span><span class=\"s2\">uffett makes mistakes at times, think Kraft-Heinz!<\/span><span class=\"s2\"> In this article we present stocks from companies that appears to have a bright future. I am also partial to income, therefore have tried to focus on stocks that pay a dividend.<\/span><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\">Over the long haul a person may want a couple things from their investments. Firstly<\/span><span class=\"s2\">,<\/span><span class=\"s2\"> to allow that investment to go up in value to outpace inflation. This way your money is able to keep its buying power over time. Secondly<\/span><span class=\"s2\">,<\/span><span class=\"s2\"> perhaps to earn some income along the way in a somewhat safe dividend. <\/span><span class=\"s2\">This can help sustain a person’s lifestyle. <\/span><span class=\"s2\">And thirdly, to take advantage of compound interest to allow the investment to feed on itself and grow on itself over time. This is a kind of leverage that makes your wealth building e<\/span><span class=\"s2\">fforts easier on you over time.<\/span><\/p>\n<h2 style=\"text-align: left;\"><strong>Quality stocks<\/strong><\/h2>\n<p style=\"text-align: left;\"><span class=\"s3\">Although we mainly invest in ETF&#8217;s and index funds, we also like to take a small percentage of our portfolios and acquire high quality stocks. We look at<\/span><span class=\"s3\"> several factors to compile a<\/span><span class=\"s3\"> list<\/span><span class=\"s3\"> of quality stocks<\/span><span class=\"s3\">. <\/span><span class=\"s3\">For example, is the stock a dividend aristocrat or king? This means that the stock persistently paid dividends over 25 or 50 plus year periods. Companies that have done this have proven that they can weather various economic environments and have a product that people need and adds value. This illustrates<\/span><span class=\"s3\"> longevity and reliability<\/span><span class=\"s3\">.<\/span><\/p>\n<p style=\"text-align: left;\"><span class=\"s3\">I also like to check if some of the great stock pickers like Buffett believe in the company. Does the company sell a product that people appear to need well into the future? <\/span><span class=\"s3\">Is the company large and well diversified yet at the same time have focus on core values? Does the company have a sound management team? How is revenue growing? Is debt under control and acquired for investing in innovation with a potential <\/span><span class=\"s3\">return on investment? What do analysts say? Will I want to buy more shares even if the share price dips at times? Are demographic trends behind some of the growth?<\/span><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\">I am not an expert with all the answers to all these questions, but it gives an idea and a framework for analyzing an investment from your own perspective. Investments and the economy tend to go up and down in cycles. We seem to get 7-10 growth years followed by a few down years.<\/span><\/p>\n<h2 style=\"text-align: left;\"><strong><span class=\"s2\">All this said, here are what many say are high quality stocks\/FUNDS for the long run:<\/span><\/strong><\/h2>\n<h2 style=\"text-align: left;\"><strong><span class=\"s2\">1. Berkshire Hathaway (<\/span><span class=\"s2\">BRK-B<\/span><span class=\"s2\">)<\/span><\/strong><\/h2>\n<p style=\"text-align: left;\"><strong>PERFORMANCE: 5 year : 71%<\/strong><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">The iconic Warren Buffett holding company: Berkshire Hathaway. Own a share of BRK-B is like owning a high powered slice of great American businesses hand selected by the greatest investor of all time. Berkshire the company is an amazing collection of over 60 awesome American companies. <\/span><span class=\"bumpedFont15\">I admire the man himself for his morals, intellect and values. <\/span><span class=\"bumpedFont15\">I find him to be a role model in terms of living a good <\/span><span class=\"bumpedFont15\">and fulfilling <\/span><span class=\"bumpedFont15\">life. Mr. Buffett<\/span><span class=\"bumpedFont15\"> values integrity, family, moral <\/span><span class=\"bumpedFont15\">judgment<\/span><span class=\"bumpedFont15\"> and strategic business investments. Be like Warren and love numbers and math. He also <\/span><span class=\"bumpedFont15\">loves<\/span><span class=\"bumpedFont15\"> a Dairy Queen Blizzard and burger!<img loading=\"lazy\" decoding=\"async\" class=\"wp-image-5518 aligncenter\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2018\/12\/Berkshire-Hathaway-Buffett-Stocks-Companies--300x239.jpeg\" alt=\"\" width=\"562\" height=\"448\"><\/span><\/span><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Mr. Buffett <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">has built Berkshire Hathaway into a very powerful giant in ter<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">ms of investment value. There are class B shares, <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">class B are the <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">“<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">middle class<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">”<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> accessible shares, the class A shares sell for about $318,000\/share, as oppose<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">d to class B that sell for about $212\/share.<\/span><\/span> <span class=\"s2\"><span class=\"bumpedFont15\">Owning class B shares <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">is like owning a small slice of some of the most powerful American companies<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> and the strong American economy<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">,<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> adding value and selling products around the world. The company is comprised of a diversified portfolio of over 60 subsidiaries. It includes insurance operations, furniture, energy, BNSF railroad, GEICO (Government Executive Insurance Company), Fruit of the Loom, Dairy Queen, etc. etc. The company holds massive stakes in Coca-Cola, Wells Fargo and Apple just to name a few.<\/span><\/span><\/p>\n<h2 style=\"text-align: left;\"><strong><span class=\"s2\">2. <\/span><span class=\"s2\">Ap<\/span><span class=\"s2\">ple (AAPL)<\/span><\/strong><\/h2>\n<p style=\"text-align: left;\"><strong>PERFORMANCE: 5 year : 398%<\/strong><\/p>\n<p style=\"text-align: left;\"><strong>DIVIDEND YIELD: 1.59%<\/strong><\/p>\n<p style=\"text-align: left;\"><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-6621 aligncenter\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2019\/03\/F90EFA5E-FE17-40EB-AA19-0F48A56556DA-300x258.jpeg\" alt=\"\" width=\"300\" height=\"258\"><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Can Apple sustain its phenomenal growth? Will they stay competitive as I Phone sales slow? Many believe so. At the end of the day they produce superior products that everyone wants. In addition, once you have one it’s hard to go back to another brand. The devices and platforms become ingrained in ones life, most likely by design! In other words, the product is sticky and hard to change. I must admit, I highly enjoy Apple products and use them every day.<\/span><\/span><\/p>\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Apple is America’s first company to reach a <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">TRILLION dollar<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> market cap! Their products have and continue to fundamentally change the way we interact with the world, create, e<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">n<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">gage, communicate and on and on. The company services business just hit its first $10 billion quarter.<\/span><\/span><\/p>\n<p class=\"s4\" style=\"text-align: left;\"><span class=\"s3\"><span class=\"bumpedFont15\">The<\/span><\/span> <span class=\"s3\"><span class=\"bumpedFont15\">introduction of 5G technology will again make these amazing machines we hold in our hands that much faster and responsive, which is hard to imagine. What’s next? They read our minds? Probably! Billions of potential customers from around the world would love to have one.<\/span><\/span><\/p>\n<h2 class=\"s6\" style=\"text-align: left;\"><span class=\"s5\"><span class=\"bumpedFont15\">5G and The Internet of Things (<\/span><\/span><span class=\"s5\"><span class=\"bumpedFont15\">IoT<\/span><\/span><span class=\"s5\"><span class=\"bumpedFont15\">)<\/span><\/span><\/h2>\n<p class=\"s6\" style=\"text-align: left;\"><span class=\"s7\"><span class=\"bumpedFont15\">IoT<\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\"> refers to the now and future concept that all things will be connected via the <\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\">interent<\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\"> and smart technologies. Everything from toasters to cars will be connected and constantly communicating and upgrading via improved software for improved performance and sensing. We now have the <\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\">introduction of motion sensors, smart speakers and electronic weigh scales, thermostats and <\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\">thermometers. In the next 10 years, we will see<\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\"> the numb<\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\">er of <\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\">IoT<\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\"> devices grow, which theoretically will result in <\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\">greater safety, security<\/span><\/span><span class=\"s7\"><span class=\"bumpedFont15\"> and health. The I Phone and other Apple products intend to play a key role in this future.<\/span><\/span><\/p>\n<p class=\"s4\" style=\"text-align: left;\"><span class=\"s3\"><span class=\"bumpedFont15\">T<\/span><\/span><span class=\"s3\"><span class=\"bumpedFont15\">he larger screen siz<\/span><\/span><span class=\"s3\"><span class=\"bumpedFont15\">es should support future growth and multiple services Apple can deliver via these powerful communications tools.<\/span><\/span><\/p>\n<h2 style=\"text-align: left;\"><strong><span class=\"s2\">3. <\/span><span class=\"s2\">Microsoft (MSFT)<\/span><\/strong><\/h2>\n<p style=\"text-align: left;\"><strong>PERFORMANCE: 5 year : 301%<\/strong><\/p>\n<p style=\"text-align: left;\"><strong>DIVIDEND YIELD: 1.74%<\/strong><\/p>\n<p style=\"text-align: left;\"><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-6622 aligncenter\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2019\/03\/1F0435F7-57AA-44CD-ABAE-7B18C6C72C57-300x159.jpeg\" alt=\"\" width=\"300\" height=\"159\"><\/p>\n<p class=\"s10\" style=\"text-align: left;\"><span class=\"s9\"><span class=\"bumpedFont20\">A deep dive into the tools Microsoft Azure provide and the benefits for developers seems to be a glimpse into Microsofts future. Azure is Microsoft&#8217;s <\/span><\/span><span class=\"s9\"><span class=\"bumpedFont20\">flagship Machine Learning studio. Microsoft recently acquired GitHub, a web based software development platform. Most recently Microsoft<\/span><\/span><span class=\"s9\"><span class=\"bumpedFont20\"> achieved a major acceleration in growth in its commercial business &#8211; with bookings rising by 22%. Commercial is now close to 70% of revenues.<\/span><\/span><\/p>\n<p>The well respected dividend expert Ken Faulkenberry gives the MSFT the following grades:<\/p>\n<h3>Risk \/ Stability Grade: A<strong><br \/>\n<\/strong><\/h3>\n<p><strong>A grade indicates a quality company with a strong balance sheet, high earnings quality, and a positive business environment. These stocks require the slimmest margin of safety within the stock universe.<\/strong><\/p>\n<h3>Financial Risk Grade: A<\/h3>\n<p><strong>A grade indicates an extremely low probability of a dividend cut. This rating is reserved for companies with strong balance sheets and\/or excellent dividend histories.<\/strong><\/p>\n<h3>Earnings Quality Grade: A<\/h3>\n<p><strong>A grade indicates earnings quality is high or far above average.<\/strong><\/p>\n<p class=\"s10\" style=\"text-align: left;\"><span class=\"s9\"><span class=\"bumpedFont20\">Microsoft’s success is well known. It can be difficult to evolve a venerable and iconic institution such as Microsoft. The company appears to be pulling off a strategic pivot not yet captured in its valuation. One area of interest is the Azure machine learning software and tools which displays some exciting future capabilities. Most software companies talk about their transformation and their ability to survive in the new cloud based\/subscription-based word. Microsoft is actually executing the pivot. The company is growing and generating cash!<\/span><\/span><\/p>\n<h2 style=\"text-align: left;\"><strong><span class=\"s2\">4. P&amp;G <\/span><span class=\"s4\"><span class=\"bumpedFont15\">Procter &amp; Gamble (PG)<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\"> (Dividend King)<\/span><\/span><\/strong><\/h2>\n<p style=\"text-align: left;\"><strong><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-8446 aligncenter\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2019\/03\/PG-innovative-strategy-300x203.jpg\" alt=\"\" width=\"300\" height=\"203\">PERFORMANCE: 5 year : 72%<\/strong><\/p>\n<p style=\"text-align: left;\"><strong>DIVIDEND YIELD: 2.8%<\/strong><\/p>\n<p class=\"s6\" style=\"text-align: left;\"><span class=\"s5\"><span class=\"bumpedFont15\">Procter &amp; Gamble has increased its dividend for 62 years in a row making it a stellar dividend king. This is a period of transition and evolution for P&amp;G, as most companies must conduct from time to time. Old brands can get stale or out of fashion in the modern world. Big smart and well managed companies must be ahead of this curve. The company has sold away dozens of under-performing brands that had exhibited slowing growth, including the sale of battery brand Duracell to Berkshire Hathaway (BRK.A) for $4.7 billion, and a collection of 43 beauty brands to Coty (COTY) for $12.5 billion.<\/span><\/span><\/p>\n<h3 style=\"text-align: left;\">Ken Faulkenberry analysis, PG still going strong!<\/h3>\n<h3 style=\"text-align: left;\"><strong>&#8220;Risk \/ Stability Grade: A<br \/>\n<\/strong><\/h3>\n<p style=\"text-align: left;\"><strong>A grade indicates a quality company with a strong balance sheet, high earnings quality, and a positive business environment. These stocks require the slimmest margin of safety within the stock universe.<\/strong><\/p>\n<h3 style=\"text-align: left;\"><strong>Dividend Safety Grade: A <\/strong><\/h3>\n<p style=\"text-align: left;\"><strong>A grade indicates an extremely low probability of a dividend cut. This rating is reserved for companies with strong balance sheets and\/or excellent dividend histories.<\/strong><\/p>\n<h3 style=\"text-align: left;\"><strong>Earnings Quality Grade: A<\/strong><\/h3>\n<p style=\"text-align: left;\"><strong>A grade indicates earnings quality is high or far above average&#8221;<\/strong><\/p>\n<p class=\"s6\" style=\"text-align: left;\"><span class=\"s5\"><span class=\"bumpedFont15\">P&amp;G has slimmed down to just 65 brands, down from 170 previously. Will the renewed focus pay off in the long run?<\/span><\/span><\/p>\n<h2 class=\"s8\" style=\"text-align: left;\"><strong><span class=\"s2\">5. Realty Income (O)<\/span><\/strong><\/h2>\n<p style=\"text-align: left;\"><strong>PERFORMANCE: 5 year : 16.8% compound annual return since 1994<\/strong><\/p>\n<p style=\"text-align: left;\"><strong>DIVIDEND YIELD: 4.7% with 93 <\/strong><b>consecutive months of increases.<\/b><\/p>\n<ul style=\"text-align: left;\">\n<li>16.8% compound average annual return since 1994<\/li>\n<li>.23 cent dividend per share per month! Approx $2.79\/year dividend per share.<\/li>\n<\/ul>\n<h2 style=\"text-align: left;\">Who owns all these buildings?<\/h2>\n<p style=\"text-align: left;\">Realty Income is a solid and strong equity real estate investment trust. It is famous for its strength of performance, strong portfolio and for the monthly dividend they pay per share. As an equity REIT, this means that they own, operate and lease the commercial real estate they own. And as a REIT, they return 90% of the profits and dividends back to shareholders each and every month.<\/p>\n<p style=\"text-align: left;\">Do you ever wonder who owns the actual building you are walking in when you patronize a Walmart, Walgreens, Taco Bell, AMC movie theater, Home Depot, gas station, etc. Did you play Monopoly as a kid and want to own as many luxury properties as possible? Guess what, as an adult we can now own a small slice of many great properties via Real Estate Investment Trusts such as Realty Income (Ticker: O).<\/p>\n<p style=\"text-align: left;\">A small fraction of your purchase at many stores goes to paying rent on that property. Many times it is not the company you are patronizing that owns the property. In many cases it could be Realty Income based in San Diego, California, who own over 5,100 properties with 249 commercial tenants operating in 47 industries. Talk about diversified. And one thing people always seem to need: real estate in some shape or form.<\/p>\n<h2 style=\"text-align: left;\">.23 a share each and every month spins off to shareholders. The shares trade at about $79\/share.<\/h2>\n<p style=\"text-align: left;\">Realty Income, stock symbol &#8220;O&#8221;, is a way to gain investment exposure to the real estate sector without the headache and hassle of becoming a landlord. Realty Income is known as &#8220;The Monthly Dividend Company&#8221; because they pride themselves on their monthly dividend since 1969 that has increased over time. To me, it kind of has that feeling of collecting rent each month off your property. But again, the great thing about this kind of investment is that there is zero hassle in terms of managing properties and tenants. It is a stock that is purchased and then one can either collect the dividends each month as income or have them reinvested.<\/p>\n<h2 style=\"text-align: left;\">A &#8220;Dividend Machine&#8221;<\/h2>\n<p style=\"text-align: left;\">Realty Income is a great example of a dividend machine that just keeps on spinning off income to investors. O generates stable and predictable income. I think of O as a sleep well at night investment vehicle. Sure, it will have its ups and downs like all stocks and companies, but many analysts see this as a great long term dividend stock to own.<\/p>\n<p style=\"text-align: left;\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-4160 aligncenter\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2018\/03\/saupload_MZX4ZjRW4ym1ILUe7Xv3VMF9-f3vmGo1yveT4QfFwEiSOZXP-OP_wHAklO97dduPaazPmvy8SkvulINDDh20Px_Dm1Xt7j7lVQd8z-noEVHm6Gm_8C_rjP-Z55lpfxlJHayT3F63-1024x651.png\" alt=\"\" width=\"640\" height=\"407\"><\/p>\n<h2 class=\"s8\" style=\"text-align: left;\"><strong><span class=\"s7\"><span class=\"bumpedFont20\">6. <\/span><\/span><span class=\"s7\"><span class=\"bumpedFont20\">Johnson &amp; Johnson<\/span><\/span><span class=\"s7\"><span class=\"bumpedFont20\"> (JNJ)<\/span><\/span><\/strong><\/h2>\n<p style=\"text-align: left;\"><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-4044 aligncenter\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2018\/10\/00ACE973-04B0-4DEA-8F10-B62B7E4BFD68-300x217.jpeg\" alt=\"\" width=\"300\" height=\"217\"><\/p>\n<p style=\"text-align: left;\"><strong>PERFORMANCE: 5 year : 51%<\/strong><\/p>\n<p style=\"text-align: left;\"><strong>DIVIDEND YIELD: 2.65%<\/strong><\/p>\n<p class=\"s6\" style=\"text-align: left;\"><span class=\"s5\"><span class=\"bumpedFont15\">Johnson &amp; Johnson is a legendary dividend growth stock, with 56 consecutive years of dividend increases. J&amp;J is a diversified healthcare company, with a pharmaceutical, consumer, and medical devices franchise.<\/span><\/span><\/p>\n<ul style=\"text-align: left;\">\n<li>JNJ seems like one of those buy and hold for the long term stocks that has paid an increased dividend for decades.<\/li>\n<li>JNJ invests billions each year in R&amp;D to continue to deliver new and better health products.<\/li>\n<li>No matter the economic cycle, people will get older and require health related products and support.<\/li>\n<\/ul>\n<h2 style=\"text-align: left;\">Everyone uses their products<\/h2>\n<p style=\"text-align: left;\">Most of us have used Johnson &amp; Johnson products: Tylenol, Band Aids, Listerine, Aveeno, Neutrogena, Neosporin, Lubriderm…and on and on and on. Or we have taken the medicines or used the medical devices manufactured by Johnson &amp; Johnson. In other words, if you have a human body, at some point you will need something from JNJ. We all have physical bodies that require all kinds of care and attention from cradle to grave. Therefore all along the way Johnson &amp; Johnson (JNJ) is providing the moisturizers, lotions, wipes, machines, medicines, etc. that are needed to be clean, pain free, cure and become healthier.<\/p>\n<h2 style=\"text-align: left;\">Diverse revenue streams<\/h2>\n<p style=\"text-align: left;\">JNJ sells products well beyond band aids and the like which only account for 18% of their business. The medical devise division accounts for 35% and pharmaceuticals account for the bulk of sales at 47%! Having various revenue streams protects the business from competition and each one has what Warren Buffett calls a &#8220;wide moat&#8221;. <span class=\"s5\"><span class=\"bumpedFont15\">On a year-over-year basis, total revenue increased 12.6% (core organic revenue up 4.3%), while adjusted earnings-per-share <\/span><\/span><\/p>\n<h2 class=\"s17\" style=\"text-align: left;\"><strong><span class=\"s16\"><span class=\"bumpedFont15\">7. Vanguard Dividend Appreciation Index Fund (VDADX)<\/span><\/span><\/strong><\/h2>\n<p style=\"text-align: left;\"><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-4990 aligncenter\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2018\/11\/iu-300x200.jpeg\" alt=\"\" width=\"300\" height=\"200\"><\/p>\n<p style=\"text-align: left;\"><strong>PERFORMANCE: 5 year : 14%<\/strong><\/p>\n<p style=\"text-align: left;\">This is a classic tried and true workhorse of an investment that just keeps on chugging up the hill. This is a highly rated basket of quality stocks that pay a dividend. The fund has low expenses at .08%. This gives an investor exposure to some of the greatest and strongest US companies: MSFT, JNJ, PG, HD, ABBT, DIS, WLMT, etc. Therefore, it is one of my largest held assets because it provides a very foundation of growth and exposure to great companies. meanwhile, it pays a constant 1.7% dividend yeild each quarter.<\/p>\n<h2 style=\"text-align: left;\"><\/h2>\n<h2 style=\"text-align: left;\"><strong>CONCLUSION<\/strong><\/h2>\n<p style=\"text-align: left;\">Investing by nature carries risk. Individual stock picking carries risk. Therefore if a person has all the basics down through low cost indexing funds, then perhaps it is nice to develop a dividend focused portfolio of awesome companies.<\/p>\n<p style=\"text-align: left;\">*This is not investment advice to anyone.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This post is now updated to reflect more emphasis on Exchange Traded Funds vs. individual equities. Although there are still a few buy and hold equities for the long run, but I have realized there is a great benefit to holding a basket of stocks with a particular mix in order to balance the risk &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2021\/08\/10-stocks-etfs-for-the-long-run-investment-longboats\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;7 Stocks &#038; ETFs For The Long Run &#8211; Investment &#8220;Longboats&#8221;&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":2,"featured_media":10572,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[5,9,12,16,20],"tags":[30,31,32,39,124,132,136,154],"class_list":["post-10571","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-best-of-mv-classics","category-dividends-2","category-free","category-investing","category-premium","tag-apple-stock","tag-ark-etfs","tag-ark-investing","tag-berkshire-hathaway-stocks","tag-johnson-johnson","tag-long-term-buy-and-hold-stocks","tag-microsoft","tag-proctor-and-gamble"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/yoga-exercise-fitness-3053488-1.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/10571","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=10571"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/10571\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/10572"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=10571"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=10571"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=10571"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}