{"id":10665,"date":"2023-03-17T15:00:07","date_gmt":"2023-03-17T22:00:07","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=10665"},"modified":"2023-03-17T15:11:56","modified_gmt":"2023-03-17T22:11:56","slug":"applying-the-marie-kondo","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/03\/applying-the-marie-kondo\/","title":{"rendered":"Applying The 8 Marie Kondo Methods to Finances"},"content":{"rendered":"\n<div class=\"wp-block-rank-math-toc-block\" id=\"rank-math-toc\"><h2>Table of Contents<\/h2><nav><ul><li><a href=\"#financial-decluttering\">Financial Decluttering<\/a><\/li><li><a href=\"#the-advantages-of-organization-and-good-stuff-management\">The advantages of organization and good &#8220;stuff&#8221; management<\/a><ul><li><a href=\"#a-less-wasted-money\">a. Less wasted money<\/a><\/li><li><a href=\"#b-increased-flow-efficiency\">b. Increased flow &amp; efficiency<\/a><\/li><li><a href=\"#c-more-relaxation\">c. More relaxation<\/a><\/li><li><a href=\"#d-better-for-the-world\">d. Better for the world<\/a><\/li><li><a href=\"#marie-kondo\">Marie Kondo<\/a><\/li><li><a href=\"#is-it-only-stuff\">Is it only stuff?<\/a><\/li><li><a href=\"#the-marie-kondo-categories-personal-finance\">The Marie Kondo Categories &amp; Personal Finance<\/a><\/li><li><a href=\"#using-the-konmari-method-puts-things-in-5-categories\">Using the Konmari method puts things in 5 categories:<\/a><\/li><li><a href=\"#1-clothes\">1. Clothes<\/a><\/li><li><a href=\"#2-books\">2. Books<\/a><\/li><li><a href=\"#see-related-how-to-clean-comic-collectibles\">See related, how to clean comic collectibles:<\/a><\/li><li><a href=\"#3-papers\">3. Papers<\/a><\/li><li><a href=\"#4-misc-items\">4. Misc Items<\/a><\/li><li><a href=\"#5-sentimental-items\">5. Sentimental Items<\/a><\/li><li><a href=\"#more-personal-finance-konmari\">More Personal Finance &amp; Konmari<\/a><\/li><li><a href=\"#6-discarding-the-past\">6. Discarding the past<\/a><\/li><li><a href=\"#7-spiritual-aspect\">7. Spiritual aspect<\/a><\/li><li><a href=\"#8-simplicity\">8. Simplicity<\/a><\/li><li><a href=\"#where-do-you-want-to-be-in-the-future\">Where do you want to be in the future<\/a><\/li><\/ul><\/li><\/ul><\/nav><\/div>\n\n\n\n<ul class=\"wp-block-list\">\n<li>&#8220;Konmari&#8221; is a Japanese art of decluttering and organizing, invented and popularized by Marie Kondo.<\/li>\n\n\n\n<li>Effective decluttering and organizing improves mood, energy, efficiency and perhaps our health.<\/li>\n\n\n\n<li>Here we apply some of the main principles to our finances, with a focus on saving money and growing our wealth.<\/li>\n<\/ul>\n\n\n\n<p>I admit that I enjoy the process of organizing stuff, so when I started watching Marine Kondo and her Konmari method, I was intrigued. For example, even as a kid I enjoyed organizing collectible cards, comics, etc. I actually enjoy it today! But, I laugh at myself and understand why I am this way.<\/p>\n\n\n\n<p>Come to find out decluttering and organizing is good for us! Certainly it makes me feel more energized, positive and effective in my daily work. In one way, my OCD organizational ways go back to my struggle with Dyslexia as a kid. Having my toys and comics neatly organized was something I could manage in a world that often seemed unmanageable and stressful. In addition, over the years I have found my creative energy improves if I create an organized and managaeble home and office.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>As an adult that has traveled the world to many countries, I’m amazed by how much stuff and clutter Americans tend to have. I remember visiting my friend a few years ago. He is married to a Japanese woman and lives overseas. They lived in a small apartment, with no garage, and a minimal amount of stuff. I asked him kind of dumbly “Do you have a storage unit somewhere with the rest of your stuff?” He basically said of course NOT, this is all we need and want. They even had a child! And at least in America, we tend to buy lots of extra stuff when they arrive.<\/em><\/p>\n<\/blockquote>\n\n\n\n<p>I’m not perfect, just trying to manage stuff and resources wisely. So don’t get me wrong, things get messy. And it is not healthy in my opinion to be the other extreme and never tolerate a mess. Certainly there is something beautiful about the times your kids make a mess or the house is a little out of sorts because life is hectic. It’s a yin\/yang balance thing, a kind of evolution in space.&nbsp;Plus, we are humans.<\/p>\n\n\n\n<p>All said, we all know that organization to some degree is important. We did not evolve out of the muck by staying a mess. We organized and thrived as a species! Monkeys do not have sock drawers or a wall with their tools neatly arranged!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"financial-decluttering\"><strong>Financial Decluttering<\/strong><\/h2>\n\n\n\n<p><strong>I came to realize not only the awesome power of decluttering and organizing our stuff, but also applying these principals to our financial affairs.<\/strong> Which can also become cluttered and stuck!<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>Why does organizing matter to building wealth?<\/p>\n\n\n\n<p>And how can it help a person become more productive and creative, which are wealth building practices?<\/p>\n\n\n\n<p>How can we apply the Japanese Marie Kondo&#8217;s method of organizing for greater energy, happiness, connectedness and success?<\/p>\n<\/blockquote>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"the-advantages-of-organization-and-good-stuff-management\"><strong>The advantages of organization and good &#8220;stuff&#8221; management<\/strong><\/h2>\n\n\n\n<p>First let us point out some of the clear advantages to having an organized house, office and ultimately mind:<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"a-less-wasted-money\"><strong>a. Less wasted money<\/strong><\/h3>\n\n\n\n<p>People with too much unorganized stuff typically waste money re-purchasing things. For example, lost gift cards, do not lose them, Raise them! There were probably many times when you could not find something and instead went out and repurchased it. Therefore, If things are organized and you have a good sense of what you own, you could save hundreds a year.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"b-increased-flow-efficiency\"><strong>b. Increased flow &amp; efficiency<\/strong><\/h3>\n\n\n\n<p>Not only will you not waste time trying to find something, the flow of your work and actions will be more efficient. How much time may be wasted trying to hunt something down. And we all can feel that in the modern world, quality time is a measure of &#8220;True Wealth&#8221;.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"c-more-relaxation\"><strong>c. More relaxation<\/strong><\/h3>\n\n\n\n<p>We are absolutely effected by our environments. Therefore, if there is disorganization and toxicity, we tend to feel that inside and it manifests itself in our emotional or health status. On the other hand, people that organize and manage their things report less feelings of anxiety and depression.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"d-better-for-the-world\"><strong>d. Better for the world<\/strong><\/h3>\n\n\n\n<p>If we send old stuff we no longer want out into the world, then someone was able to use something at a discount and be less wasteful. Consequently, if you donate gently used quality items, others may treasure them as new and we keep them out of a landfill.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"marie-kondo\"><strong>Marie Kondo<\/strong><\/h3>\n\n\n\n<p>I hope you know Marie Kondo. She has a new show on Netflix (<em>Tidying Up With Marie Kondo<\/em>), but has been known for years for helping people organize using her unique Marie Kondo Method. This is basically the Japanese Art of Decluttering &amp; Organizing. But what she facilitates is not simply a physical act of putting all your rubber bands in a little tin and hanging your clothes the right way. What she does touches people in a spiritual and emotional way.<\/p>\n\n\n\n<p>Her show is amazing. People form stronger bonds between their family, find new energy and passions. They do all this by organizing their stuff in a way that improves efficiency and creates a more calm and energizing environment.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"is-it-only-stuff\"><strong>Is it only stuff?<\/strong><\/h3>\n\n\n\n<p>Yes, you might think the stuff around us is only stuff. But things have an energy to them, they have a purpose and they may have an emotional power over us.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"the-marie-kondo-categories-personal-finance\"><strong>The Marie Kondo Categories &amp; Personal Finance<\/strong><\/h3>\n\n\n\n<p>Here are some of the main elements of the Konmari method and how I believe we can all apply them to our personal finances and wealth building capabilities:<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"using-the-konmari-method-puts-things-in-5-categories\"><strong>Using the Konmari method puts things in 5 categories:<\/strong><\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"300\" height=\"222\" src=\"http:\/\/198.199.80.40\/wp-content\/uploads\/2021\/08\/KonMari-05_Sho01-141-e1596037820876-300x222.jpg\" alt=\"Marie Kondo\" class=\"wp-image-15528\" srcset=\"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/KonMari-05_Sho01-141-e1596037820876-300x222.jpg 300w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/KonMari-05_Sho01-141-e1596037820876-1024x756.jpg 1024w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/KonMari-05_Sho01-141-e1596037820876-768x567.jpg 768w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/KonMari-05_Sho01-141-e1596037820876-1536x1134.jpg 1536w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/KonMari-05_Sho01-141-e1596037820876-2048x1512.jpg 2048w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" \/><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"1-clothes\"><strong>1. Clothes<\/strong><\/h3>\n\n\n\n<p>First a person organizes their clothes. In fact the method requires a person to pile all their clothes in a huge pile and go one by one. You are supposed to hold each item and ask if it &#8220;sparks joy&#8221;. If it does not, then you are to thank the item and let it go either through sale or donation.<\/p>\n\n\n\n<p><strong>Financial application:<\/strong> First of all I noticed that the people with all the clothes are doing a lot of retail therapy. I understand sometimes a little retail therapy is needed, but make sure it is not destroying your financial position. Are you a victim of&nbsp;<a href=\"https:\/\/themoneyvikings.net\/2018\/09\/01\/embrace-frugality-the-illusion-of-wealth\/\" target=\"_blank\" rel=\"noopener\">zombie consumerism and not seeing through the illusion of wealth?<\/a><\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"2-books\"><strong>2. Books<\/strong><\/h3>\n\n\n\n<p>Konmari actually emphasizes having few books. As a lover of books this is at first hard to understand. But the more I think about it from a financial perspective, we should be utilizing the <a href=\"https:\/\/themoneyvikings.net\/2018\/07\/25\/idea-12-a-free-treasure-trove-right-in-front-of-you-the-library\/\" target=\"_blank\" rel=\"noopener\">free public library for wealth building information<\/a>&nbsp;and free entertainment purposes.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"see-related-how-to-clean-comic-collectibles\"><strong>See related, how to clean comic collectibles:<\/strong><\/h3>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_16245\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/4sJ5-a-PXFQ?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"3-papers\"><strong>3. Papers<\/strong><\/h3>\n\n\n\n<p>The Konmari also shuns lots of papers everywhere and advocates for discarding as many as possible. This is another hard one for me being a &#8220;man of letters&#8221; and I use that term loosely 🙂 I also tend to really think old ephemera type materials are neat to visit and &#8220;spark joy.&#8221; So in my case, Mrs. Kondo might allow me my papers, if I have them well organized.<\/p>\n\n\n\n<p><strong>Financial application:<\/strong> We all know that personal finance management can involve a lot of paper. In the modern world we should be trying to reduce this paperwork as much as possible. There are so many great options to track financial transactions and investments online, so turn off those paper copies already! Some important papers from a financial perspective include the following:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Tax folder: One should keep all tax receipts, notes and records in a special folder throughout the year. It is too chaotic to try and find all that stuff in April!<\/li>\n\n\n\n<li>Home and property folders: I keep folders on my properties. I keep insurance records, home maintenance projects and warranties, mortgage docs, deeds, etc.<\/li>\n\n\n\n<li>Mail system: One needs a good mail system. I have a 3 pronged approach. First, discard junk mail immediately! Then hand my wife her stack. Then I open and organize my mail immediately.<\/li>\n\n\n\n<li>Lists: I am a big list guy! Add it to my many nerd traits. I use lists all the time. In fact, I would love to make a book of pictures of lists! Lists are what makes the world progress and turn. Oh, my love affair with lists.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"4-misc-items\"><strong>4. Misc Items<\/strong><\/h3>\n\n\n\n<p>The Konmari has another category of stuff called miscellaneous. It is really everything else, the kitchen tools, work tools, sport equipment, office supplies, etc. The main concept here is that this stuff should again &#8220;spark joy&#8221;, we should use it in some way and it should be organized and clean.<\/p>\n\n\n\n<p>In this category I include collectibles like toys, cards and comics. See our many articles about <a href=\"http:\/\/198.199.80.40\/2023\/02\/star-wars-collectibles\/\" data-type=\"post\" data-id=\"12910\" target=\"_blank\">collectible toys such as Star Wars!<\/a><\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-wp-embed is-provider-money-vikings wp-block-embed-money-vikings\"><div class=\"wp-block-embed__wrapper\">\nhttp:\/\/198.199.80.40\/2023\/02\/star-wars-collectibles\/\n<\/div><\/figure>\n\n\n\n<p><strong>Financial application<\/strong>: For me, we like to have a garage sale every year in order to sell stuff like this we either do not use any more or does not spark happiness.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"5-sentimental-items\"><strong>5. Sentimental Items<\/strong><\/h3>\n\n\n\n<p>I am actually quite sentimental in many ways. I keep things from my younger years that remind me of a more innocent time. The world was probably not as great, but it was my childhood, we lived in a nice middle class neighborhood and worked hard at school. Konmari has you hold sentimental items and again connect with them. If there is still a connection, then keep the item and keep it safe and organized and enjoyable.<\/p>\n\n\n\n<p>Mrs. Kondo does emphasize getting rid of stuff. She even makes little comments about how huge American houses are compared to Japanese. Which we know leads to the accumulation of too much in a&nbsp;<a href=\"https:\/\/themoneyvikings.net\/2018\/07\/12\/mdn-idea-6-real-estate-your-home\/\" target=\"_blank\" rel=\"noopener\">home that is not a museum!<\/a><\/p>\n\n\n\n<p><strong>Financial application:<\/strong> This is a big reasons we advocate for folks buying just enough house to fit their needs and lifestyle. Consequently, too much home always seems to result in filling it with too much stuff!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"more-personal-finance-konmari\"><strong>More Personal Finance &amp; Konmari<\/strong><\/h3>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_38400\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/TXzcmr2WcDA?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"6-discarding-the-past\"><strong>6. Discarding the past<\/strong><\/h3>\n\n\n\n<p>The first part of Konmari is discarding. Therefore, this seems to open our energy, focus and effectiveness. It has a cleansing feeling, like we are freed from the past.<\/p>\n\n\n\n<p><strong>Financial application:<\/strong> This is important in building wealth because we have to move on from the mistakes of the past. Everyone makes &#8220;mistakes&#8221; with money, but we need to learn from them and take action now.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"7-spiritual-aspect\"><strong>7. Spiritual aspect<\/strong><\/h3>\n\n\n\n<p>Marie Kondo sees the spiritual side of tidying up. I believe in the spiritual side of money management. This is because just as your physical space has a kind of flow and energy, so does your relationship with money. Think about it, if you were taught that money is &#8220;evil&#8221; and only scoundrels get rich, you might have an underlying aversion to accumulating and managing money. Money is a neutral source of energy and intention, which can be used for good and bad.<\/p>\n\n\n\n<p><strong>Financial application:<\/strong> You can choose to use money for good. But always keep in mind the spiritual aspect of respecting resources. It does seem like the more we respect resources the more they respect us back.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"8-simplicity\"><strong>8. Simplicity<\/strong><\/h3>\n\n\n\n<p>The Marie Kondo&#8217;s Konmari method emphasizes simplicity and a kind of back to fundamentals approach. I believe this approach is also important when it comes to investing and financial management. We tend to overcomplicate things or believe those that overcomplicate them for ourselves. For investing use a straightforward balanced portfolio through a company like&nbsp;<a href=\"https:\/\/themoneyvikings.net\/2018\/11\/20\/bogleheads-vanguard-investing-101\/\" target=\"_blank\" rel=\"noopener\">Vanguard investing.<\/a><\/p>\n\n\n\n<p><strong>Financial application:<\/strong> Beyond the investing part, live within your means and save at least 15%. The rest pretty much falls into place from there.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"where-do-you-want-to-be-in-the-future\"><strong>Where do you want to be in the future<\/strong><\/h3>\n\n\n\n<p>Mrs. Kondo asks her clients to think about what they want to take into their future. That is where this ship is headed. The same goes for your finances. Where do you want them to be in the future? Do you want to be deep in debt, stressed and unhealthy? No, we want to have strong net worths, low debt, health, and the habits to live within our means. Organizing and decluttering may be the first step towards that future!<\/p>\n\n\n\n<p>*As always, these are personal opinions expressed by the authors and not intended to be advice to anyone.<\/p>\n\n\n\n<p><iframe style=\"width: 120px; height: 240px;\" src=\"\/\/ws-na.amazon-adsystem.com\/widgets\/q?ServiceVersion=20070822&amp;OneJS=1&amp;Operation=GetAdHtml&amp;MarketPlace=US&amp;source=ss&amp;ref=as_ss_li_til&amp;ad_type=product_link&amp;tracking_id=themoneyvikin-20&amp;language=en_US&amp;marketplace=amazon&amp;region=US&amp;placement=1607749726&amp;asins=1607749726&amp;linkId=168ee363771d25371247c325a6723c08&amp;show_border=true&amp;link_opens_in_new_window=true\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Using the Marie Kondo Konmari Method for Decluttering Your Finances.<\/p>\n","protected":false},"author":2,"featured_media":15542,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[12,4,5,11,14,21,22],"tags":[128,129,134,149],"class_list":["post-10665","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-free","category-art","category-best-of-mv-classics","category-family","category-home","category-psychology","category-real-estate","tag-konmari-finances","tag-konmari-method","tag-marie-kondo","tag-organizing"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/03\/pexels-photo-1232594.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/10665","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=10665"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/10665\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/15542"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=10665"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=10665"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=10665"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}