{"id":11140,"date":"2023-12-02T21:22:06","date_gmt":"2023-12-03T05:22:06","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=11140"},"modified":"2023-12-03T10:46:41","modified_gmt":"2023-12-03T18:46:41","slug":"robinhood-cashapp-cash-back","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/12\/robinhood-cashapp-cash-back\/","title":{"rendered":"2 Cash Back Options &#8211;  Investing Apps Robinhood &#038; CashApp"},"content":{"rendered":"\n<div class=\"wp-block-rank-math-toc-block\" id=\"rank-math-toc\"><h2>Table of Contents<\/h2><nav><ul><li><a href=\"#which-one-to-use-robinhood-or-cash-app-for-cash-back\">Which One To Use (Robinhood or CashApp for Cash Back)?<\/a><\/li><li><a href=\"#robinhood-glitch-game-stop-no-cash-back-here\">Robinhood Glitch &amp; GameStop, no Cash Back Here<\/a><\/li><li><a href=\"#micro-investing\">Micro Investing<\/a><\/li><li><a href=\"#two-great-platforms-to-build-wealth\">Two Great Platforms to Build Wealth<\/a><\/li><li><a href=\"#investing-for-the-long-run-or-day-trading\">Investing For The Long Run or Day Trading!<\/a><\/li><li><a href=\"#discounts-and-money-exchange\">Discounts and Money Exchange<\/a><\/li><li><a href=\"#cash-app-fractional-shares-and-cash-back\">Cash App, Fractional Shares, and Cash Back?<\/a><\/li><li><a href=\"#robinhood\">Robinhood<\/a><\/li><li><a href=\"#other-robinhood-features\">Other Robinhood features:<\/a><\/li><li><a href=\"#cash-app-boosts\">CashApp Boosts<\/a><\/li><li><a href=\"#bitcoin-in-both\">Bitcoin in Both:<\/a><\/li><li><a href=\"#dabbling-but-not-going-crazy\">Dabbling but not going crazy<\/a><\/li><li><a href=\"#free-lunch\">Free Lunch?<\/a><\/li><li><a href=\"#conclusion\">Conclusion<\/a><\/li><\/ul><\/nav><\/div>\n\n\n\n<p><a href=\"https:\/\/cash.app\/app\/PPLLFLG\" target=\"_blank\" rel=\"noopener\">Cashapp<\/a> and <a href=\"https:\/\/join.robinhood.com\/davidk2060\" target=\"_blank\" rel=\"noopener\">Robinhood<\/a> are both game changers in their own ways. They both give Cash back. But which one is better and when can they be of most value to you? They may be awesome platforms to build wealth. Given the sad state of most people&#8217;s finances, our country truly needs free and easy platforms to build wealth. But these platforms come with their share of challenges and do they truly set up the consumer for success? Over 100 million Americans have almost no investments. This is scary and sad for our collective future! Can these platforms help?<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>How can Robinhood or CashApp help build wealth?<\/li>\n\n\n\n<li>Which is more useful?<\/li>\n\n\n\n<li>What are some of the dangers and drawbacks?<\/li>\n\n\n\n<li>Robinhood is more of an investing platform, whereas CashApp is what we call a &#8220;Swiss army knife&#8221; of moving and managing money that comes with some clever perks.<\/li>\n<\/ul>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><i>In early 2021, Robinhood was notably in the news when a bunch of retail traders on Reddit (Wall Street Bets) stuck it to a large hedge fund over shorting GameStop stock. The irony is that Robinhood was forced to police the situation and became the &#8220;Sherriff of Nottingham&#8221;.<\/i><\/p>\n<\/blockquote>\n\n\n\n<p>Did you know that someone starting in their 20&#8217;s, 30&#8217;s or 40&#8217;s who could invest just $100\/week with one of these platforms, could quite possibly retire a millionaire? And not only can a person do traditional wealth building in these two platforms, one can also buy Bitcoin and other cryptocurrencies. So let&#8217;s take a look at each.<\/p>\n\n\n\n<p><iframe loading=\"lazy\" src=\"https:\/\/anchor.fm\/moneyvikings\/embed\/episodes\/The-Money-Vikings-Podcast-5---Does-Robinhood-Lead-to-Investing-Addiction-ei8bh9\" width=\"400px\" height=\"102px\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"which-one-to-use-robinhood-or-cash-app-for-cash-back\"><strong>Which One To Use (Robinhood or CashApp for Cash Back)?<\/strong><\/h2>\n\n\n\n<p>Which one is better? Well, it depends on what you are looking for. The bottom line is they are both different tools that put you more in control of your money and investing. Whether that is a good thing for an individual depends on that person&#8217;s investing temperament.<\/p>\n\n\n\n<p>Both will inevitably improve over time and can serve you in many ways. At the current moment I am utilizing Robinhood to acquire shares of companies and ETF&#8217;s that I believe will add value now and and in the future. This becomes a combination of day trading and investing, two very different approaches. Some stocks and Bitcoin can be purchased through CashApp, but it does not entirely focus on investing and I find the options limiting. CashApp is more of a peer to peer payment system, vehicle for finding discounts and has a nifty debit card function. In short, it is more of a &#8220;swiss army knife&#8221; of moving money and capital around with some investing capabilities.<\/p>\n\n\n\n<p>I am quite happy with Robinhood as an investing and trading platform. We have been able to build positions one brick at a time in quality companies and make some speculative bets. But, we also enjoy using CashApp and it serves a different function, but is growing ways to invest as the platform evolves. CashApp feels more like a banking and money management tool to move money around, make purchases, investments, etc.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"robinhood-glitch-game-stop-no-cash-back-here\"><strong>Robinhood Glitch &amp; GameStop<\/strong>, no Cash Back Here<\/h2>\n\n\n\n<p>Although we really like Robinhood, it does have its occasional issues. On April 2nd, 2020 Robinhood suffered a massive outage as markets rebounded in heavy volume on that Monday.<\/p>\n\n\n\n<p>More recently, Robinhood is dealing with the turmoil and fallout of the Gamestop short squeeze orchestrated by a group of activist Redditor investors. This is an evolving story and has garnered all kinds of public scrutiny and Congressional inquiry. At one point Robinhood halted trading with GameStop.<\/p>\n\n\n\n<p>These situations momentarily cause The Money Vikings to rethink usage of the platform. In the April 2nd situation, If I had bought a call option in Robinhood for 300$ in SPY today, I would not have been able to sell it for a profit. What&#8217;s worse, many investors may have been stuck in money losing trades. Be careful putting large amounts of money into this new player until glitches like this are ironed out.<\/p>\n\n\n\n<p>In general, we really enjoy using Robinhood to pick up a few shares at a time of our <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/02\/my-wow-stocks-for-2023\/\" data-type=\"post\" data-id=\"12810\">favorite companies<\/a>, 12 Stocks For the Long Run. Some of these high quality stocks are rather expensive per share, but using Robinhodd every couple of weeks on payday allows him to build solid positions. Lately many of these shares have gone on sale, therefore Greg can pick up a few more shares than usual and harness the power of <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/04\/investing-trifecta-to-create\/\" data-type=\"post\" data-id=\"12602\">The Investing Trifecta<\/a>!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"micro-investing\"><strong>Micro Investing<\/strong><\/h2>\n\n\n\n<p>I have used Robinhood to do what I call &#8220;micro investing&#8221;.  Unfortunately Fractional Shares is what caught on, darn. This is finding companies that I am interested in and believe have a strong business model or disruptive technology. Through Robinhood I can quickly invest a few hundred or a few thousand dollars instantly. In other words, I can test the waters on a particular hot stock without getting burned by moving substantial amounts. If I end up seeing a strong long term case for the company I can invest more in increments over time, effortlessly!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"two-great-platforms-to-build-wealth\"><strong>Two Great Platforms to Build Wealth<\/strong><\/h2>\n\n\n\n<p>We compare two awesome platforms for investing and moving money around fluidly. That is perhaps the key ingredient to their success, the movement of capital and money fluidly and quickly with a few clicks on your smart phone. Both platforms are game changers and feel futuristic and efficient. Where Robinhood is amazing for investing, the CashApp has some appealing features and can act as a kind of money swiss army knife.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"investing-for-the-long-run-or-day-trading\"><strong>Investing For The Long Run or Day Trading!<\/strong><\/h2>\n\n\n\n<p>As you may know, The Money Vikings are big Robinhood platform investing fans, as we outlined in a full review in our <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/02\/robinhood-investing-addiction\/\" data-type=\"post\" data-id=\"6072\">Robinhood-Investing Game Changer article<\/a>. Before all these other brokerages recently announced free trades, Robinhood beat them to the punch! Greg has been using it to build positions in strong dividend stocks for the long run.<\/p>\n\n\n\n<p>He can use the platform to buy a few shares at a time for free and build positions in his&nbsp;15 stocks for the long run.<\/p>\n\n\n\n<p>Building wealth is about putting together one brick at a time, that builds on itself over time. Both platforms have the potential to help a person reach their goals.<\/p>\n\n\n\n<p>In an exciting November 2019 announcement, Block (the makers of CashApp) said that they would provide stock purchases in their app. As long time CashApp users, we were excited to try and compare the platforms. We had mainly been using Cash App to obtain small discounts at various stores we would frequent anyway.<\/p>\n\n\n\n<p>We at <a href=\"https:\/\/truewealth.moneyvikings.com\" data-type=\"link\" data-id=\"truewealth.moneyvikings.com\">moneyvikings.com<\/a> took both of them for a test drive to see which was best. The bottom-line up front is that while Robinhood has a more sophisticated user experience, CashApp also has some pretty neat features. For the investor looking for the capability to buy and sell stocks for free, both are awesome!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"discounts-and-money-exchange\"><strong>Discounts and Money Exchange<\/strong><\/h2>\n\n\n\n<p>Up until now, we have mainly been using CashApp to obtain on 5-10% on places like Trader Joe&#8217;s, Chick-fil-A, In-N-Out and dozens of other places. The app also allowed us to gain $1 off coffee at any coffee shop! Next came some opportunities to buy Bitcoin for free through the CashApp, and now full on investing!<\/p>\n\n\n\n<p>CashApp also clearly has an edge when it comes to exchanging money among friends or others. This can come in handy.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"cash-app-fractional-shares-and-cash-back\"><strong>Cash App, Fractional Shares, and Cash Back?<\/strong><\/h2>\n\n\n\n<p>Cash App allows the purchase of fractional shares, which is a really cool way for people to get started in investing for as little as one dollar,  like Stash has done for a bit. (Update 3\/2\/20: Robinhood rolled out fractional shares as well). It allows people to  participate in higher priced stocks they might otherwise never be able to purchase such as Amazon or Google. Berkshire class A is  $150,000\/share! 😉 Both offer zero commission trades. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"robinhood\"><strong>Robinhood<\/strong><\/h2>\n\n\n\n<p>Robinhood has an amazingly fresh and user friendly platform. The design is absolutely brilliant and there are even little snowflakes on Christmas Day. In my opinion Robinhood still dominates on pure looks and UX (user experience). UX is important to me as an artistic design guy. Good design to me is crucial to the success of the customer and the company alike. Just look at Apple, it’s about design!<\/p>\n\n\n\n<p>I think CashApp has some catching up to do in the design department. But hopefully with time they will develop a design that is not only user friendly but also inspirational.<\/p>\n\n\n\n<p>Design is not just about good looks, it is also about saving time, money and efficiency. In fact, I find Robinhood&#8217;s design so great that I think it can lead to&nbsp;<a href=\"http:\/\/198.199.80.40\/2022\/03\/does-robinhood-lead-to-investing-addiction\/\" target=\"_blank\">investing addiction<\/a>.&nbsp; Probably not the worst addiction to have, but it could be detrimental to long term returns if we are not careful.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"other-robinhood-features\"><strong>Other Robinhood features:<\/strong><\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Zero costs\/fees to trade stocks, ETF’s, options etc.<\/li>\n\n\n\n<li>Easy to use and fun online platform, perfect for mobile<\/li>\n\n\n\n<li>Options Trading<\/li>\n\n\n\n<li>Great way to slowly build positions in desired companies, saving hundreds in fees<\/li>\n\n\n\n<li>Again, the service is truly free, no hidden fees, but they do offer a premium plan for savings<\/li>\n\n\n\n<li>Fractional Shares<\/li>\n\n\n\n<li>High Yield Savings accounts (premium)<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"different-tools\"><strong>Different Tools<\/strong><\/h2>\n\n\n\n<p>At the end of the day these two platforms are shaping up to be different things, although both are competing for your extra money. And I believe both can help people save, invest and find discounts.<\/p>\n\n\n\n<p>Robinhood is a pure play into fast convenient and free stock trading and acquisitions. I like it because it provides instant gratification. I can buy a few shares at a time and build positions over time. But there are some dark sides&#8230;<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-wp-embed is-provider-the-money-vikings-truewealth wp-block-embed-the-money-vikings-truewealth\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"wp-embedded-content\" data-secret=\"trMasSabdu\"><a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/02\/robinhood-investing-addiction\/\">Does Robinhood Lead To Investing Addiction? 1 Tip<\/a><\/blockquote><iframe loading=\"lazy\" class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" style=\"position: absolute; clip: rect(1px, 1px, 1px, 1px);\" title=\"&#8220;Does Robinhood Lead To Investing Addiction? 1 Tip&#8221; &#8212; The Money Vikings - Truewealth\" src=\"https:\/\/truewealth.moneyvikings.com\/2023\/02\/robinhood-investing-addiction\/embed\/#?secret=JfQv15t45K#?secret=trMasSabdu\" data-secret=\"trMasSabdu\" width=\"600\" height=\"338\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"><\/iframe>\n<\/div><\/figure>\n\n\n\n<p>CashApp has been very helpful with sending my friends money and for obtaining small savings on stuff I would have bought anyway. For example, I went to the grocery store the other day to pick a few items up and instantly saved $5 just by utilizing the CashApp debit card.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"cash-app-boosts\"><strong>CashApp Boosts<\/strong><\/h2>\n\n\n\n<p>I also consistently utilize the CashApp Boosts to obtain discounts on at all kinds of places. If you have the CashApp debit card, then you can use it to obtain discounts at all kinds places. Check out a list, although keep in mind they rotate and change regularly: CashApp Boosts One of the newer boosts is getting cash-back in bitcoin.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"bitcoin-in-both\"><strong>Bitcoin in Both:<\/strong><\/h2>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;We find the global acceptance, brand recognition, ecosystem vitality, network dominance, architectural resilience, technical utility, and community ethos of bitcoin to be persuasive evidence of its superiority as an asset class for those seeking a long-term store of value,&#8221; Saylor said. &#8220;Bitcoin is digital gold &#8212; harder, stronger, faster, and smarter than any money that has preceded it.&#8221;<\/p>\n<\/blockquote>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"dabbling-but-not-going-crazy\"><strong>Dabbling but not going crazy<\/strong><\/h2>\n\n\n\n<p>Our personal approach to crypto is to dabble but not lose our minds. Yes, this means holding some Bitcoin and alt coins as speculation. There is really no other use for them at the moment. With the exception of the CashApp, which to me has made Bitcoin a bit more useable. My personal rule of thumb is to hold some Bitcoin, but limit to 1-2% of total assets.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"free-lunch\"><strong>Free Lunch?<\/strong><\/h2>\n\n\n\n<p>I have been playing a little game to get free meals using <a href=\"https:\/\/truewealth.moneyvikings.com\/tag\/bitcoin\/\">Bitcoin<\/a> and CashApp. So I buy some Bitcoin on CashApp. Watch it go up and take the profits. It makes me like $30 so I can go buy my family lunch or dinner. Then I use a CashApp boost as well for a little extra savings. Those dinners and lunches taste so much better knowing that they came from Bitcoin profits, Buon appetite!<\/p>\n\n\n\n<p>Ok, I know that is silly, but just trying to give a sense of how I am using crypto at this point. In other words, yes, we are using and investing in it. But we are not going to dump hundreds of thousands in.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"conclusion\"><strong>Conclusion<\/strong><\/h2>\n\n\n\n<p>In our opinion they are both awesome game changers, but I personally use Robinhood more often. Robinhood has a beautiful interface that makes it easy to get a stock&#8217;s history and relevant news items. &nbsp;Robinhood makes investing easy and fun. It allows trading of options and iron condors. I think both have advantages and disadvantages, however I think Robinhood has a slight edge for investors that want to try more advanced stock and options trading features.<\/p>\n\n\n\n<p>This article has referral links in it. Should you decide to sign up for either <a href=\"https:\/\/cash.app\/app\/PPLLFLG\" target=\"_blank\" rel=\"noopener\">CashApp<\/a> or <a href=\"https:\/\/join.robinhood.com\/davidk2060\" target=\"_blank\" rel=\"noopener\">Robinhood<\/a>, the creators of this site would love it if you used their links to start the signup process.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>CashApp allows stock trading on their platform. We wanted to take both of them for a test drive to see which is better.<\/p>\n","protected":false},"author":2,"featured_media":17401,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"CashApp vs Robinhood which one is better?","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[3,5,7,12,16,23],"tags":[45,649,63,115,165,168,169,170,171,172,188],"class_list":["post-11140","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-apps","category-best-of-mv-classics","category-credit-cards","category-free","category-investing","category-technology","tag-boosts","tag-cash-back","tag-cashapp","tag-investing","tag-retail-investor","tag-robinhood-cashapp","tag-robinhood-free-investing","tag-robinhood-investing","tag-robinhood-stocks","tag-robinhood-vs-cashapp","tag-stock-trading"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/05\/IMG_9615.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11140","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=11140"}],"version-history":[{"count":3,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11140\/revisions"}],"predecessor-version":[{"id":17416,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11140\/revisions\/17416"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/17401"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=11140"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=11140"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=11140"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}