{"id":11959,"date":"2023-01-11T14:09:14","date_gmt":"2023-01-11T22:09:14","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=11874"},"modified":"2023-01-18T19:24:47","modified_gmt":"2023-01-19T03:24:47","slug":"overcoming-unfairness","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/01\/overcoming-unfairness\/","title":{"rendered":"5 Strategies for Overcoming Unfairness"},"content":{"rendered":"<h1>5 Strategies to Overcoming Unfairness<\/h1>\n<p>Lets talk about overcoming unfairness, going back to one of my favorite movies of all time: “<a href=\"https:\/\/www.imdb.com\/title\/tt0093779\/\" target=\"_blank\" rel=\"noopener\">The Princess Bride<\/a>”. Do yourself a favor and watch it, it is one of my all time favorites. It was a book first, but I was introduced to the movie when I was about 12.<\/p>\n<p>So my mom wanted to rent “The Princess Bride” for family movie night. My brother and I could not get past the fact that the word “Princess” was in the name. We said, no way, don’t rent that, no “princess” stuff for us. We were into dragons, knights, swords, etc. Anything but princesses. Little did we know there was a lot to this amazing story. She rented it without us knowing and told us it was a &#8220;pirate movie&#8221; and popped it into the VHS player. Without knowing the title, we ended up loving this “princess” movie and it became one of my favorite movies of all time. After the movie was over our mom told us that it was “The Princess Bride.”<\/p>\n<p>This movie is just great and full of meaning, fantasy, love and the struggle between good and evil. Another big theme of that movie is that LIFE IS NOT FAIR! But, through perseverance and determination things can work out just fine. At one point the little boy in the story turns to his grandfather and says he doesn’t like the book because the story isn’t fair.<\/p>\n<p>The movie provides even more comfort and wisdom in today&#8217;s world of pandemic uncertainty and exhaustion.<\/p>\n<p>The grandfather says:<\/p>\n<blockquote><p>Who says life is fair? Where is that written?<\/p><\/blockquote>\n<p>I just love this part. One more good quote from the story and life:<\/p>\n<blockquote><p>Life is pain your highness, anyone who tells you differently is selling something<\/p><\/blockquote>\n<p>Not trying to be bleak, but to build wealth and live with a sense of “True Wealth” we must accept the facts of life and move forward with our work to build a better, perhaps more fair, future. Building wealth is an exercise in managing reality. So how do we overcome unfairness as we build a future for our family?<\/p>\n<h2>1. Gain healthy perspective, not everything is fair<\/h2>\n<p>You probably have a heck of a lot more than most people. Keep your struggles in perspective because it may lead to much more contentment and well being. We have become very accustomed to becoming bent out of shape when our Starbucks order is not right! You&#8217;re probably not starving, probably reasonably healthy, you probably have gainful employment and friends and family that love you. Wesley in the movie has to endure years of suffering to finally be reunited with his true love. I understand this is a fairy tale, but there are a lot of life skills to be gleaned here. Wesley aka &#8220;The Dread Pirate Roberts&#8221; illustrates how obtaining anything worth having takes years of work, sacrifice and discipline. And at the end of all that, there is still no guarantees, but at least one would know they gave it their all!<\/p>\n<h2>2. Unfair or Real? Be ok with people with “more”<\/h2>\n<p>Good for them. We probably have no idea the struggles they face. It seems like the wicked Prince has it all in the movie, but he is empty inside and does not have true love or affection, therefore he is actually very poor. You can’t judge someone’s true wealth with outside appearances or Instagram posts. We are such a flashy society that I know this can be hard. <a href=\"http:\/\/198.199.80.40\/2022\/02\/6-techniques-to-1-million-dollars\/\" target=\"_blank\">We just look at people from the outside and make so many assumptions. Be cautious about appearances.<\/a><\/p>\n<h2>3. Focus on the actions and choices you manage to overcome unfairness<\/h2>\n<p>Is it really an unfair world? Next paycheck it’s up to you whether to put an extra $50 into an investment. It’s up to you not to buy that next luxury item you probably don’t need. You get a say and a choice in some things each day. Are you making the best choice for your future? In the movie, again and again Wesley must make strategic decisions with his comrades. They make the best of what seemed impossible. We all have to do the same in our lives with the situations and materials before us. When invading the castle, Wesley asks &#8220;what are our assets?&#8221; The group of rogues pulls off an amazing operation to save the princess with very little in terms of &#8220;assets&#8221;. I know it&#8217;s a movie, but you get the idea, do the best with what you have!<\/p>\n<h2>4. Is Life is unfair? Or just unique to you?<\/h2>\n<p>Its not a contest of who consumes more, has the biggest house, fancy car, etc. It is about knowing thyself and what works for you. Check out the book “Design Your Life”, there a multiple great lives for you to live and enjoy. Each character in The Princess Bride has their unique story and mission. Find your own, own it and expand it the best you can.<\/p>\n<h2>5. The more you give the more you get<\/h2>\n<p>It just seems if we try to bring some kind of gift to others this comes back to us exponentially. If we go into any human interaction with the thought, how can I add value to others? This seems to change our whole outlook on the World. I’m not saying sacrifice all for others, the world is about exchange. Most likely if you add value you may be rewarded.<\/p>\n<p>To me, these things help me overcome unfairness. Only I have the power to change my outlook to enhance my happiness and contentment. Also, be fair to movies with &#8220;Princess&#8221; in the title, you may be surprised by what is within.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>5 Strategies to Overcoming Unfairness Lets talk about overcoming unfairness, going back to one of my favorite movies of all time: “The Princess Bride”. Do yourself a favor and watch it, it is one of my all time favorites. It was a book first, but I was introduced to the movie when I was about 12. &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/01\/overcoming-unfairness\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;5 Strategies for Overcoming Unfairness&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":11875,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[12],"tags":[152,193],"class_list":["post-11959","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-free","tag-personal-finance","tag-the-princess-bride"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/02\/msdprbr-ec001-1553626124-scaled-1.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11959","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=11959"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11959\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/11875"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=11959"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=11959"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=11959"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}