{"id":12002,"date":"2022-02-28T03:57:55","date_gmt":"2022-02-28T03:57:55","guid":{"rendered":"http:\/\/143.198.225.54\/wordpress\/?p=12002"},"modified":"2022-09-24T16:22:36","modified_gmt":"2022-09-24T23:22:36","slug":"6-techniques-to-1-million-dollars","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/02\/6-techniques-to-1-million-dollars\/","title":{"rendered":"7 Techniques to $1 Million Dollars (yes, it can still happen)"},"content":{"rendered":"\r\n\r\n\r\n\r\n\r\n<h3><strong>Current Crisis! Or Opportunity of a Lifetime?<\/strong><\/h3>\r\n<p>At the moment it feels like the sky is falling in the markets and fear is in the air once again. The drumbeat of recession talk is strong and asset prices from equities to real estate are declining.<\/p>\r\n<p>What shall we do? Load up on canned goods and run for the hills?<\/p>\r\n<p>NO!<\/p>\r\n<p>It is time to take advantage of opportunities and move closer to our goals of having a million dollar investment account. See, one simple example is this: If you are automated into a 401k basket of diversified US equities, then your investments are now buying shares on sale and at a discount. This is the perfect time to turbo charge future millionaire status! Read on for some over arching ideas to reach the million dollar club.<\/p>\r\n<h3><strong>Experience<\/strong><\/h3>\r\n<p id=\"d5bc\">After 20 plus years of investing I am more and more convinced of the reasons that some people get wealthy or poor over time. Of course there are those rare tragic situations where something terrible happens that is out of someone&#8217;s control. But for the vast majority of wealth builders, the formula is quite simple: Own assets, reduce liabilities. Do this again and again over many years.<\/p>\r\n\r\n\r\n\r\n<p id=\"8446\">Sounds simple, but so few do it. For the majority of us, we will need to deploy multiple strategies and techniques to discover our treasure that can sustain us over the long run.<\/p>\r\n\r\n\r\n\r\n<p id=\"6757\">Therefore we ask, what can we do to achieve a million dollar nest egg in order to draw income for life? I realize a million is not what it used to be, but if someone can reach a million, then they have most likely developed the systems, skills and habits to go higher.<\/p>\r\n\r\n\r\n\r\n<p id=\"d392\">When I think about building a successful system towards the goal of financial independence, I think of Benjamin Graham, famed author of the investment classic “The Intelligent Investor” and mentor to Warren Buffett.<\/p>\r\n\r\n\r\n\r\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\r\n<p>The best way to measure your investing success is not by whether you’re beating the market, but by whether you’ve put in place a financial plan and a behavioral discipline that are likely to get you to where you want to go.<\/p>\r\n<\/blockquote>\r\n\r\n\r\n\r\n<p id=\"b5d6\">For most of us, a $1 million investment account is a good psychological goal. And for many, it is within our grasp to achieve after many years of saving and investing.<\/p>\r\n\r\n\r\n\r\n<h1 class=\"wp-block-heading\" id=\"7a6f\">WHY A MILLION?<\/h1>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*5VS6xNnBcarmotytVm1Vsg.jpeg\" alt=\"\"><\/figure>\r\n\r\n\r\n\r\n<p id=\"5487\">In my mind, a million creates that critical mass required to spin off significant investment income and interest. The advantage of an interest only retirement is that there is less concern with drawing down the nest egg too quickly and running out of money. How big an account depends on your particular target income. As an example, an annual income of $48,000 would require a nest egg of $1.6 million, assuming a 3% interest rate. Here are 7 ideas to utilize on the journey to a million:<\/p>\r\n\r\n\r\n\r\n<h1 class=\"wp-block-heading\" id=\"dac2\">1. USE MATH — $179<\/h1>\r\n\r\n\r\n\r\n<p id=\"0a30\">The thing about achieving a level of wealth that most people do not understand is that it is simple math and techniques. Most people seem to think in order to be wealthy they need to win the lotto, be a movie star\/sports star or invent the next internet sensation. For a very lucky few these paths work. Most of us will have to deploy a much simpler path.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*e2ApDvLHkzFFB9BNHK06nQ.png\" alt=\"\"><\/figure>\r\n\r\n\r\n\r\n<p id=\"0da3\">Could you come up with $179 next month? Many people can, $179 in one month is really not a lot of money for most people. If a person started at age 20 and simply invested $179\/month at a 10% annual average return, by the time they reached age at 60 they would have $1 million in investments.<\/p>\r\n\r\n\r\n\r\n<p id=\"66ce\">These numbers can be adjusted over time to speed up the process of accumulating wealth. But we get the picture, it is simple math and time on the journey to a million.<\/p>\r\n\r\n\r\n\r\n<p id=\"1d9f\">Many people easily waste $179 month on little luxury items like coffees out, meals out, subscription services, clothes, etc. Heck, $5\/day for a fancy coffee is $150 month! Cut cable or do one less meal out each month and you have already surpassed the $179!<\/p>\r\n\r\n\r\n\r\n<h1 class=\"wp-block-heading\" id=\"aa53\">2. MULTIPLE INCOME STREAMS<\/h1>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/800\/1*MhdxiyA17X02qpM166UbwQ.jpeg\" alt=\"\"><\/figure>\r\n\r\n\r\n\r\n<p id=\"5cd2\">In order to achieve financial independence and grow towards a million dollar nest egg, it can be highly helpful to develop and build multiple income streams. The reason for multiple income streams is born out of the experience of the booms and busts of the American economy over the last 20 years. Dot com bubble, 9\/11 shockwaves, housing bubble, global recession, bailouts and high unemployment, pandemics, etc. These events greatly impacted many people and their financial futures.<\/p>\r\n\r\n\r\n\r\n<p id=\"2b3c\">A strategy that saved many was developing multiple income streams. These are things like side hustles, side jobs, dividend income, rental income, royalties from intellectual property like a book or patent, etc. In other words, not depending only on one job for all income needs.<\/p>\r\n\r\n\r\n\r\n<p id=\"4edd\">I have frankly found these challenging to fully develop over the years. Each side income machine takes time to build, manage and deploy.<\/p>\r\n\r\n\r\n\r\n<h1 class=\"wp-block-heading\" id=\"3cf5\">3. DIVIDENDS<\/h1>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/800\/1*xxTBa02KJjbeWMHxACYC2g.jpeg\" alt=\"\"><\/figure>\r\n\r\n\r\n\r\n<p id=\"7c3c\">One of my favorites are dividends from quality companies. We analyze a lot of dividend investments here and that is a key pillar to my multiple income stream strategy. Another thing I love about focusing on dividends is that I care much less what the stock price is doing each day, month or even year. Of course in the long run I want the stock price to appreciate in value, but as long as that little bit of income is coming in, then who cares?<\/p>\r\n\r\n\r\n\r\n<h1 class=\"wp-block-heading\" id=\"edc2\">4. BECOME OWNER\/INVESTOR, NOT JUST A CONSUMER<\/h1>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*AZdBX895saE_wqm5nYKrhA.png\" alt=\"\"><\/figure>\r\n\r\n\r\n\r\n<p id=\"f0ed\">In America we are born and raised in an environment of hyper consumerism. We embrace capitalism and spend hours a day gazing at commercials and grinding away to make money in order to make the next purchase. It is a never ending cycle and in many ways can get totally out of control. Millions are drowning in debt they will never re pay. In other words, they are behaving like compliant consumers. The constant bombardment of commercials is a great reminder of the next hot thing they need to make them feel complete briefly.<\/p>\r\n\r\n\r\n\r\n<p id=\"f21f\">Ok, all good, the modern world seems to run on the jet fuel of consumerism. But what if you played multiple roles? What if you were also an owner and investor? What if you owned some of the capital, a stake in the game and were part of production?<\/p>\r\n\r\n\r\n\r\n<p id=\"19e4\">That is a main point of the financial independence movement and FIRE: to have a controlling stake in the world we live in, instead of simply living off an old script that we were handed. Nowadays there are so many investment options from stocks, bonds, ETF’s, crypto, real estate etc. Either focus in on a couple, or own a diversified portfolio of many. Buy an asset like a stock. You are instantly a small fraction of an owner in the future profits of that business.<\/p>\r\n\r\n\r\n\r\n<h1 class=\"wp-block-heading\" id=\"6387\">5. CUT BACK ON WASTE<\/h1>\r\n\r\n\r\n\r\n<p id=\"8968\">I am continually surprised by the human habit of focusing too much on the stuff we can’t control and too little on the things within our control and influence. Someone may obsess over being hurt in a terrorist attack, yet stuff their face with highly processed “franken-food” from a low quality fast food joint. Heart disease, diabetes kill more people than terrorism. A person may focus too much on the potential low probability event while guzzling down sugary milkshakes and highly processed foods stuffed with sugar, bad fats and empty calories.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*Po5cvZzZMoxRvPOLPJwUgw.jpeg\" alt=\"\">\r\n<figcaption>Photo by <a href=\"https:\/\/unsplash.com\/@theblowup?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\" rel=\"noreferrer noopener\">the blowup<\/a> on <a href=\"https:\/\/unsplash.com\/s\/photos\/waste?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\" rel=\"noreferrer noopener\">Unsplash<\/a><\/figcaption>\r\n<\/figure>\r\n\r\n\r\n\r\n<p id=\"c2bf\">Think about the stuff you control: subscriptions, coffee out, where you live, size of house, type of car, used or new…<\/p>\r\n\r\n\r\n\r\n<p id=\"07f7\">Focusing on what we can control and manage can have a profound effect on our long term trajectory. There are so many recurring expenses that can most likely be reduced or trimmed over time.<\/p>\r\n\r\n\r\n\r\n<h1 class=\"wp-block-heading\" id=\"8d8e\">6. BE POSITIVE AND MANAGE EMOTIONS!<\/h1>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*LYVHTS5z4eLCIGWUBh_WFg.jpeg\" alt=\"\"><\/figure>\r\n\r\n\r\n\r\n<p id=\"5cbf\">Attitude and habits are the keystones to building substantial wealth. We live during an exciting and tremendous time. We have many opportunities that our ancestors could not even dream of. Let’s seize the moment and harness the opportunities before us. Perhaps we can add value, do some good in the world, spread some love and live a life of True Wealth.<\/p>\r\n<h2>7. MAKE THE MOST OF THIS OPPORTUNITY<\/h2>\r\n<p>If like me, you liked investing in equities and real estate prior to this recent down trend, then we should like it even more now that quality investments can be acquired at a cheaper cost. And for most of us, we can add to our investments brick by brick. For real estate I use REIT&#8217;s and crowdfunding platforms that allow small amounts to be invested incrementally. For stocks, I am favoring quality dividend players and other stocks that have been beaten down but offer long term value.<\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/394\/0*BsdD_DO_ccE2ouJB.png\" alt=\"\"><\/figure>\r\n\r\n\r\n\r\n<p id=\"73ce\">If you enjoyed this article, please consider becoming a <a href=\"https:\/\/premium.moneyvikings.com\/?page_id=9438\" target=\"_blank\" rel=\"noreferrer noopener\">Money Vikings Premium Member<\/a>.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Current Crisis! Or Opportunity of a Lifetime? At the moment it feels like the sky is falling in the markets and fear is in the air once again. The drumbeat of recession talk is strong and asset prices from equities to real estate are declining. What shall we do? Load up on canned goods and &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/02\/6-techniques-to-1-million-dollars\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;7 Techniques to $1 Million Dollars (yes, it can still happen)&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12494,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[2,9,16,17],"tags":[],"class_list":["post-12002","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-401k","category-dividends-2","category-investing","category-net-worth"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/02\/pexels-photo-3807737.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12002","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12002"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12002\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12494"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12002"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12002"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12002"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}