{"id":12426,"date":"2023-01-09T07:52:05","date_gmt":"2023-01-09T15:52:05","guid":{"rendered":"http:\/\/terminator.moneyvikings.com\/?p=12426"},"modified":"2023-01-16T09:20:05","modified_gmt":"2023-01-16T17:20:05","slug":"reit-power-investors","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/01\/reit-power-investors\/","title":{"rendered":"REIT Power Investors!"},"content":{"rendered":"<h1>REIT Power Investors!<\/h1>\n<p>In general, real estate is one of my favorite asset classes. It is tangible, scarce and can be re-imagined for new uses. It is clearly a time tested way to build wealth and secure your future. More millionaires have been made through history from real estate than any other asset class. And in particular in this asset class, I believe Real Estate Investment Trusts (REITs) offer an effective vehicle to grow wealth in real estate. In fact, REITs may be the preferred method to build wealth in real estate since they do not have many of the risks and downsides of real estate to the personal investor.<\/p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"7 Great REIT&#039;s &amp; Why Real Estate Investment Trusts?\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/as184wH4BK0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div>\n<h2>REITs<\/h2>\n<p>REIT Power for everyone! What is a REIT? REITs are typically companies that invest in properties and issue shares of the REIT just like a share of common stock. The REIT company is obligated under tax laws to send 90% of their rent collection profits back to shareholders in the form of dividends. This makes this investment great for income investors.<\/p>\n<p>A REIT is a company that owns and in many cases operates income producing real estate. An investor can buy shares of these companies. In other words, a REIT is a pool of properties and mortgages bundled together. The company offers shares of these combined assets in the form of a security or stock that an individual can buy into. There are all kinds of REITs that specialize in different types of real estate including office\/commercial, apartment buildings\/housing, hospitals, shopping centers, hotels, etc. REITs were invented as a real estate vehicle under a Public Law signed by President Eisenhower. REITs give all investors access to large scale real estate development investing.<\/p>\n<p>Triple net real estate investment trusts are back. Rent collection is back to pre-pandemic levels. yields are strong for several quality REIT&#8217;s. I like them for the growth potential and the income.<\/p>\n<h2>IRS Rule on Income<\/h2>\n<p>One really neat feature of REITs is that IRS rules require the company to pay out 90% of their income back to share unit holders. This is typically in the form of a dividend. Dividend income is one of several strategies Money Vikings are harnessing to reach FI, so this makes REITs an ideal investment vehicle.<\/p>\n<h2>REIT vs. Hands On Real Estate Ownership<\/h2>\n<p>We are going to run some numbers and look at the pros and cons of owning\/investing in REIT&#8217;s vs actual hands on real estate investment ownership. The result may surprise you:<\/p>\n<h2>Inflation &amp; Recession Resistant<\/h2>\n<p>Many of the REITs I am currently adding are inflation and recession resistant. Notice I did not say recession proof, but some are strong enough they can withstand the pressures. I recently added Agree REIT (ADC) and W.P. Carey, which I believe fit this criteria.<\/p>\n<h2>O, REALTY INCOME<\/h2>\n<p>First up, the classic and the one of the best triple net REIT&#8217;s out there: Realty Income (Ticker: O), cleverly marketed as the monthly dividend player in the REIT space. Gives one that feeling of collecting monthly rents.<\/p>\n<p>Realty Income operates an impressive portfolio in all kinds of industries. <span class=\"s2\"><span class=\"bumpedFont20\">I am a long term owner of O stock, Realty Income. This is another strong REIT. <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">Realty Income is a high-quality income vehicle for investors with a moderate risk tolerance.<\/span><\/span> <span class=\"s2\"><span class=\"bumpedFont20\">A U.S. recession may be in the cards, exposing income investors to growing downside risks, but this is still a steady long term play. Here is more information about Realty Income &#8220;O&#8221;.<\/span><\/span><\/p>\n<h2>Hannon Armstrong (HASI)<\/h2>\n<p>HASI is interesting because most do not know it is organized as a REIT. They specialize in investments in climate solutions, providing capital to assets developed by leading companies in energy efficiency, renewable energy, and other sustainable infrastructure markets. With more than $9 billion in managed assets, our core purpose is to make climate positive investments with superior risk-adjusted returns.<\/p>\n<h2>STORE Capital “STOR”<\/h2>\n<p class=\"s3\"><span class=\"s2\"><span class=\"bumpedFont20\">Net lease REITs have<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\"> high and consistent income generation, coupled with moderate growth and low risk.<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\"> What does Triple Net Lease mean, it basically means the tenant pays the taxes, repairs\/maintenance and insurance on the property, in addition to rent. <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">STORE Capital is one of the best performing net leas<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">e REITs around.<\/span><\/span><\/p>\n<p class=\"s3\"><span class=\"s4\"><span class=\"bumpedFont15\">&#8220;Net lease&#8221; or &#8220;triple-net&#8221; are commonly-used terms to describe freestanding retail property investments<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">.<\/span><\/span> <span class=\"s4\"><span class=\"bumpedFont15\">Who owns the Dollar General convenience stores, CVS pharmacies, or even Chevron <\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">gas stations<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">?<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\"> You can own a small slice of the action if you own shares of REIT STOR. Added bonus, STOR is a Buffett Berkshire stock, so you know it has been pretty well vetted by the master himself.<\/span><\/span><\/p>\n<p>Yield: currently a healthy 4.1% yield.<\/p>\n<h2>WP Carey (WPC)<\/h2>\n<ul class=\"zhB\">\n<li data-test-id=\"article-summary-item\">Company generated $1.31 of AFFO, beating expectations of $1.29 and up from $1.27 last year.<\/li>\n<li data-test-id=\"article-summary-item\">3% same-store rent growth is the highest in years, reflecting CPI-based lease escalators.<\/li>\n<li class=\"paywall-full-summary\" data-test-id=\"article-summary-item\">Lease rates and rent collections remain above the 99% level.<\/li>\n<li class=\"paywall-full-summary\" data-test-id=\"article-summary-item\">Raised the bottom end of full year AFFO guidance range. Now expects $5.22-$5.30 from $5.18-$5.30.<\/li>\n<\/ul>\n<h2 class=\"s3\"><span class=\"s2\"><span class=\"bumpedFont20\">National Retail Properties “<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">NNN<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">”<\/span><\/span><\/h2>\n<p class=\"s3\"><span class=\"s2\"><span class=\"bumpedFont20\">Another widely touted and strong REIT is National Retail Properties. The stock may be a bit high, but it is deemed another good long term hold. <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">Properties remain highly liquid and many are selling for very low cap rates. Liquidity, dividend growth, and dividend coverage all re<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">main rock solid and the company continues to improve efficiencies<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">.<\/span><\/span> <span class=\"s4\"><span class=\"bumpedFont15\">NNN <\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">once again showed why its long-term shareholders sleep well at night.<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\"> While occupancy dipped slightly <\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">and signs of gr<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">owth headwinds have appeared<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">, the compa<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">ny continues to operate effectively<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">, <\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">which will fuel dividend growth in the future.<\/span><\/span> <span class=\"s2\"><span class=\"bumpedFont20\">Nation<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">al Retail Properties is a<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\"> buy again.<\/span><\/span> <span class=\"s2\"><span class=\"bumpedFont20\">The commercial property REIT has excellent portfolio and dividend coverage stats.<\/span><\/span><a name=\"_GoBack\"><\/a><\/p>\n<h2>Federal Realty Investment Trust &#8220;FRT&#8221; (Dividend King!)<\/h2>\n<p>FRT has increased its dividend for 51 years in a row, making it the only Dividend King REIT. Federal Realty continues to grow in spite of a challenging environment for brick-and-mortar retail, as it continues to focus on the highest-quality properties and locations. The beauty and simplicity of competition. With total expected returns exceeding 10% and annual dividend increases, FRT is a buy for dividend growth investors.<\/p>\n<h2>VANGUARD REAL ESTATE ETF (VNQ)<\/h2>\n<p>Check out the Vanguard RE ETF. I like to study the top holdings and understand why they are so prominent in this great etf. This is another way I gain exposure to the lucrative real estate sector.<\/p>\n<h2>Why Real Estate?<\/h2>\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont20\"><em>I would sure like to invest in real estate, but can’t even hammer a nail or unclog a toilet!<\/em><\/span><\/span><\/p>\n<p>This is a common refrain heard from many that fear jumping into real estate investing due to the high level of management required. But those nice stable investment returns and appreciation of capital are sure nice, it is like the demand cannot keep up with supply when it comes to real estate. But if you do not want to respond to maintenance calls, have you heard of a REIT (Real Estate Investment Trust)? This article will talk all about REITs and compare them to traditional &#8220;hands on&#8221; real estate investing.<\/p>\n<p>I write a lot about <a href=\"https:\/\/themoneyvikings.net\/2018\/12\/15\/analyzing-a-real-estate-investment\/\" target=\"_blank\" rel=\"noopener\">real estate<\/a> because I have a passion for it as a thing and as an investment vehicle. It may have something to do with my arts background, but I enjoy a well designed and well maintained property. Think about how essential real estate is to our modern lives. It keeps us safe, healthy and provides a platform for some of our greatest family memories. It is the grocery store, mall, coffee shop, warehouse, office complex, fast food joint, pharmacy, etc. Real estate in general is an excellent asset class in many ways. But it is important to consider all the pros and cons of the different ways to invest in real estate.<\/p>\n<h2>Real Estate Investment<\/h2>\n<p>Let’s say you invest in a $500,000 investment property (single family home) in a nice middle class neighborhood. You put $100,000 down and finance the remaining $400,000. In this scenario it is important to remember that your actual investment is $100,000.<\/p>\n<p>On a $400,000 mortgage the total cost of principle, interest (4-5%), escrow for taxes, would be about $2,500\/month<\/p>\n<p>Add another $100\/month for landscaping and another $100\/month for deferred maintenance.<\/p>\n<p>The house would cost about $2,700\/month in expenses.<\/p>\n<p><i>Here&#8217;s the bottom line,  If the property rents for about $3,100\/month,<\/i><span class=\"s2\"><i> the landlord (that&#8217;s you) is looking at a $400\/month cash flow “profit”.<\/i><\/span><\/p>\n<p>Now, keep in mind that this investment takes a lot of hands on care and feeding: There will be maintenance calls to respond to at off hours. Changes of occupancy to manage, advertising, screening tenants, contracts to negotiate and sign. Long term maintenance to manage. Minor and major repairs, etc.<\/p>\n<p>But on the other hand, over many years you will be building equity in the property. So as the $400k note is drawn down and the price appreciates at 3-5% annually, the value of that investment can grow from the original $100k to $200k, $300k, etc.<\/p>\n<h2>REIT Power Investors: Real Estate Investment Trusts (REIT)<\/h2>\n<p>Let’s analyze a $100,000 investment in a REIT. A very popular and strong REIT is the company Realty Income, ticker symbol “O” which we have written about before. With $100,000 you could by 1,538 shares of “O” at $65\/share. The stock offers a 4% dividend yield. One really neat thing that I love about “O” is that they pay the dividend monthly, which makes it feel like a traditional real estate investment. Each share returns .221\/share per month.<\/p>\n<p><strong><span class=\"s2\">BOTTOMLINE: .221 x 1,538 shares = $340\/month cash<\/span><span class=\"s2\"> flow<\/span><\/strong><\/p>\n<p>All this with no calls in the middle of the night due to a leaky roof!<\/p>\n<h2><span class=\"s2\">The Bottom Line<\/span><\/h2>\n<p><span class=\"s2\">As you can see from this simplified example, the investment in a high quality Real Estate Investment Trust can offer some comparable returns and cash flow. <\/span>The REIT investment certainly has far less “headaches” in terms of day to day management. All investing holds some level of risk. The company could tank and the shares lose value. On the other hand, investing in physical real estate you manage has its fair share of risks. A major repair could certainly set you back at almost any time.<\/p>\n<p>I like working with both REIT’s and traditional real estate. But for someone that does not want to deal with Tenants, contracts, repairs and hands on management, REIT is the way to gain exposure to the real estate sector. And looking at some of the initial numbers, may provide many of the returns and pure financial results. Ideally the value of the REIT shares will rise just as the underlying value of any real estate asset will rise.<\/p>\n<h2>Conclusion<\/h2>\n<p>In this article you can see that there are alternative ways to be a part of the real estate investing world that do not involve plunking down huge amounts of capital, taking out a loan, doing property inspections, screening tenants, unclogging toilets, and spending a fortune on a new HVAC system when the old one dies. In fact, the cash flow that can be generated from a sizable investment in high quality REIT&#8217;s can spin off some significant income. REIT&#8217;s are a great alternative that have now stood the test of time and can be an ideal vehicle for those searching for passive income. Yes, the industry will continue to manage and weather disruption, but that has always been the case as consumers priorities and desires shift. A good company anticipates and prepares for these changes and shifts.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>REIT Power Investors! In general, real estate is one of my favorite asset classes. It is tangible, scarce and can be re-imagined for new uses. It is clearly a time tested way to build wealth and secure your future. More millionaires have been made through history from real estate than any other asset class. And &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/01\/reit-power-investors\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;REIT Power Investors!&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12429,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[22],"tags":[160],"class_list":["post-12426","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-real-estate","tag-real-estate-investing"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/08\/pexels-photo-7641856.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12426","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12426"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12426\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12429"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12426"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12426"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12426"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}