{"id":12532,"date":"2022-10-02T09:47:15","date_gmt":"2022-10-02T16:47:15","guid":{"rendered":"http:\/\/terminator.moneyvikings.com\/?p=12532"},"modified":"2022-12-23T08:17:21","modified_gmt":"2022-12-23T16:17:21","slug":"fundrise-returned-8-in-this-market-fundrise-real-estate-overview","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/10\/fundrise-returned-8-in-this-market-fundrise-real-estate-overview\/","title":{"rendered":"Fundrise Returned 17% in this Market! (Fundrise Real Estate Overview)"},"content":{"rendered":"<h2>I continue to be amazed<\/h2>\n<p>Fundrise, the real estate crowd funding platform, continues to amaze me with it&#8217;s solid year over year returns. I am having the dividends reinvested and adding a modest amount each month via automation. Here is a comprehensive overview of the system. And I was amazed to see an 8% return this year in this turbulent market when most have lost ground. My only regret is I should have invested more. But since this was an unproven platform a few years ago I was cautious. I will be more aggressive going forward.<\/p>\n<h2><strong>Fundrise, the Pros, the Cons, and the we will see&#8230;<\/strong><\/h2>\n<ul>\n<li>Note, we make no money off Fundrise outside our own personal investment stakes through them. This is a personal opinion and review of this real estate investing crowdsource platform.<\/li>\n<\/ul>\n<h2><strong>Fundrise Overview (10% + Returns)<\/strong><\/h2>\n<ul>\n<li>Easy way to gain exposure to real estate sector, awesome looking &amp; fun platform, exciting updates, a few clicks to invest<\/li>\n<li>Small minimum investment of $1,000<\/li>\n<li>Management &amp; advisory fees typically add up to 1%, but be aware of other fees, especially for early withdrawal before 1, 3 or even 5 years. I am trying it for 5 years<\/li>\n<li>2017 ROI was over 11.4% net (all investing has some level of risk, past returns are no guarantee of future returns)<\/li>\n<li>Untested platform for during a down cycle, not sure what could happen in a crash and investors make a mass run for their money?<\/li>\n<li>Bottom Line Opinion: Worth considering to add diversity to a portfolio once all other fundamental personal finance boxes are checked: maxed 401k, reasonable debt load, emergency fund, secure employment, don&#8217;t need to access these funds for many years&#8230;<\/li>\n<li>There are many other ways to invest in real estate (that don&#8217;t involve actually purchasing and managing a property) through traditional REIT&#8217;s that are much easier to sell shares of earlier than a 5 year mark<\/li>\n<\/ul>\n<p>SEE RELATED: <a href=\"http:\/\/oracle.davidkanter.com\/2018\/11\/27\/real-estate-investing-a-comprehensive-overview\/\" target=\"_blank\" rel=\"noopener\">REAL ESTATE INVESTING &#8211; AN OVERVIEW<\/a><\/p>\n<h2><strong>Real Estate &amp; The Tech Age<\/strong><\/h2>\n<p>I have been investing and working in real estate for over 18 years both privately and professionally. I enjoy investing in stocks &amp; bonds, etc., but real estate investing holds a special place in my psyche. Surprisingly, beyond Zillow &amp; Redfin access, I have not really witnessed any major technological disruptions to plain old fashioned real estate. There has been no kind of Uber moment for the industry, yet! Enter the world of Real Estate Crowdfunding!<\/p>\n<p>I am sure there are hundreds of startups working diligently to upend the real estate world. They want to fundamentally change the way we transact real estate (which was probably a system established 900 years ago) to the way we invest in real estate and manage it.<\/p>\n<h2><strong>Transactional Real Estate<\/strong><\/h2>\n<p>For example, an escrow is a contractual arrangement in which a third party receives and disburses money or documents for the primary transacting parties, with the disbursement dependent on conditions agreed to by the transacting parties. Notice I said &#8220;third party&#8221;, and you know the tech world loves to disrupt middlemen in all industries. The word is even derived from the old French word <i><i lang=\"fro\" title=\"Old French language text\">escroue<\/i><\/i>, meaning a scrap of paper or a scroll of parchment. This indicated the deed that a third party held until a transaction was completed. Anything derived from the word scroll is another thing ripe for disruption.<sup id=\"cite_ref-2\" class=\"reference\"><\/sup><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-4835 aligncenter\" src=\"http:\/\/oracle.davidkanter.com\/wp-content\/uploads\/2018\/11\/72C405C9-BBCA-427C-9E23-662E3BE83956-616x1024.jpeg\" alt=\"\" width=\"616\" height=\"1024\"><\/p>\n<p>Word of caution up front: Like all investing, real estate investing has a fair share of risk involved and many moving parts. Anyone remember the 2008 housing crash when real estate prices plummeted in half? Yeah, that was not a bad dream, that was real! In spite of the ups and downs, I think over the long run real estate is a solid investment.<\/p>\n<h2><strong>Primary Residence<\/strong><\/h2>\n<p>Your primary home is neutral as an investment and more of a hedge against inflation. I am not into the new &#8220;don&#8217;t buy a house&#8221; trend because at some point I want these housing payments to stop and have a low cost place to live that I like and am invested in. But that is a separate topic and article. I have enjoyed owning, renovating and managing single family homes. I have even enjoyed the tangible hands on activities of property management, renovation, remodel, etc. At the end of the project, I am providing a very important value to the customer\/tenant: a nice place to live, work, raise a family, etc.<\/p>\n<p>RELATED:<\/p>\n<p>http:\/\/oracle.davidkanter.com\/2018\/06\/26\/rental-property-from-the-80s-blood-sweat-and-tears-literally\/<\/p>\n<p>That said, hands on real estate investing is not for everyone. I find that real estate investing depends on where you are in life both financially and personally. At different times you may have more or less capacity for managing construction projects, working with people, tying up large amounts of capital, etc. Hands on real estate investing can be lucrative, but it also involves a huge amount of capital, time and patience. There is working with banks, mortgage brokers, appraisals, negotiations, renovations, contractors, unforeseen costs, closing costs, etc. on the front end. On the back end there is screening tenants, developing contracts, collecting rents, property management and long term capital improvements. Now doesn’t swiping up on Robinhood sound simple. In my view, it is not a get rich quick kind of thing.<\/p>\n<h2>How can one invest in exciting real estate projects but avoid all the stuff just mentioned?<\/h2>\n<p>Enter Fundrise and the power of the internet! With Fundrise I have been earning about 11% ROI (return on investment). With my private hands on real estate projects I have earned about a similar ROI on the annual cashflow, but with a ton of work!<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\" wp-image-4818 aligncenter\" src=\"http:\/\/oracle.davidkanter.com\/wp-content\/uploads\/2018\/11\/5E30A8B0-90FA-4BA3-BEF8-B510E5078E18-652x1024.jpeg\" alt=\"\" width=\"465\" height=\"730\"><\/p>\n<h2><strong>No 9PM Calls To Unclog The Toilet<\/strong><\/h2>\n<p>The good news for investors in general, is that there are many ways to invest in the real estate sector that do not involve you picking up a hammer, taking out a huge mortgage or responding to a backed up toilet at 9pm (sound fun!).<\/p>\n<p>There are of course the traditional Real Estate Investment Trusts (REIT&#8217;s) we talk about quite a bit, most notably companies like Realty Income (Ticker O), that pays the investors a monthly dividend. Realty Income owns and operates a diverse portfolio of commercial properties. The monthly payout is clever and novel because it mimics that sense of a monthly real estate rent check. But another way to passively invest in real estate is through an online crowdsourcing platform like Fundrise. Fundrise is one of many such platforms. There are others like Realty Mogul, Realty Shares, Crowd Street, Rich Uncle, etc. I have only experimented with Fundrise, therefore that is the focus of this article.<\/p>\n<p>I have now invested and experimented with Fundrise, one of several crowd funding real estate platforms out there and I can say I am sticking with it. First and most importantly the investment returns and dividends have been great. So far, I am on target to earn about a 10% yearly return on investment. The investor has the option of collecting the dividend and returns as passive income, or reinvesting for future projects.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Technological Breakthroughs<\/strong><\/h2>\n<p>Anyone who has been alive over the last 10 years understands that technology is rapidly changing almost every way we live our lives. Investing in a system like Fundrise is as much about technological opportunities as it is about investing in traditional good old real estate. The platform allows millions of people to pool relatively small amounts of money to be combined into large projects. These systems are early in their development, so I think the jury is still out as to how they will evolve. I am going to give it a try for several years as part of a sound well diversified strategy. In general, I am not one to want to sell investments quickly, I typically like to hold on for long periods of time to have dividends reinvested and let compounding take effect.<\/p>\n<p>&nbsp;<\/p>\n<h2>Depending on your situation and risk tolerance there may be pros and cons to investing with Fundrise &amp; other similar platforms:<\/h2>\n<p>&nbsp;<\/p>\n<h2>The Cons<\/h2>\n<p>1. The funds are a bit locked up and there are extra fees for removing them early. I am planning on letting my account ride for at least 5 years, but I have read stories of folks that were charged extra fees if they removed funds earlier than this. The process of redeeming your investment takes a while at this point. It is not as easy as swiping up on Robinhood and instantly have your Realty Income shares sold and the money deposited in your account.<\/p>\n<p>2. Real estate crowdfunding is relatively new. This platform has not worked its way yet through a normal down cycle.<\/p>\n<p>3. I am a bit concerned with fee transparency. There are upfront costs that are difficult for me to pin down. If the projects continue to generate a nice healthy ROI of say 11%, but perhaps I will walk away with an actual ROI of 8%. This is still very strong, but something to be aware of. The fees remind me of traditional real estate deals with all the closing costs, escrow fees, appraisal fees, management fees, etc. that add up.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-4837 aligncenter\" src=\"http:\/\/oracle.davidkanter.com\/wp-content\/uploads\/2018\/11\/6AE27845-2646-467A-B1B5-F3A841B9A710.jpeg\" alt=\"\" width=\"750\" height=\"748\"><\/p>\n<h2>The Pros<\/h2>\n<p>1. Great platform and website. Signing up is easy and the platform keeps you updated and informed on a regular basis. You can review information about each one of the real estate investment projects that your funds are being used to construct or develop.<\/p>\n<p>2. Low minimums. If you have ever wanted to invest in private real estate projects but did not have $100k sitting around, this is a neat way to do so with investments as low as $500 or $1,000.<\/p>\n<h2><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-4838 aligncenter\" src=\"http:\/\/oracle.davidkanter.com\/wp-content\/uploads\/2018\/11\/2296F9D5-030B-4350-AA65-5A583D0965E2-688x1024.jpeg\" alt=\"\" width=\"640\" height=\"953\"><\/h2>\n<h2>FINAL THOUGHTS<\/h2>\n<p>So you are considering investing in crowdfunded real estate projects? For me Fundrise is a small fraction of assets and I am using this platform to diversify and experiment with something new. I hold traditional real estate and high quality REIT investments like Realty Income &#8220;O&#8221; that have stood the test of time.<\/p>\n<p>If one has all other financial investments under control, holds a steady job, has debt levels in check, then why not check out something new. At least this is what I am thinking. Real estate like all investing has its ups and downs, but over the long run as the population continues to grow, there always seems to be a need for more housing and commercial developments. Even after one of the biggest drops in real estate asset values around 2008, look what happend over the subsequent decade! It seems like demand will far outstrip supply for decades.<\/p>\n<ul>\n<li>The thoughts presented here are personal opinions and in no one way an endorsement of any one particular investment. All investing is inherently risky and one should consult a fiduciary financial professional with specific questions or guidance.Fundrise<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>I continue to be amazed Fundrise, the real estate crowd funding platform, continues to amaze me with it&#8217;s solid year over year returns. I am having the dividends reinvested and adding a modest amount each month via automation. Here is a comprehensive overview of the system. And I was amazed to see an 8% return &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/10\/fundrise-returned-8-in-this-market-fundrise-real-estate-overview\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Fundrise Returned 17% in this Market! (Fundrise Real Estate Overview)&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12533,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[9,22],"tags":[559,557,558],"class_list":["post-12532","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-dividends-2","category-real-estate","tag-fundrise-crowdfunding","tag-fundrise-great-returns","tag-fundrise-real-estate"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-313691.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12532","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12532"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12532\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12533"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12532"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12532"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12532"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}