{"id":12705,"date":"2022-11-20T08:18:56","date_gmt":"2022-11-20T16:18:56","guid":{"rendered":"http:\/\/terminator.moneyvikings.com\/?p=12705"},"modified":"2022-11-20T17:03:49","modified_gmt":"2022-11-21T01:03:49","slug":"how-to-stop-caring-live-a-fruitful-experience","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/11\/how-to-stop-caring-live-a-fruitful-experience\/","title":{"rendered":"How to Stop Caring &#038; Live a Fruitful Experience"},"content":{"rendered":"<p style=\"text-align: center;\"><em>Never give up they say! Always do the right thing! Sacrifice and only say nice things.<\/em><\/p>\n<p>How about trying a different approach: stop caring and worrying so much for a more fruitful life?<\/p>\n<p>Ok, sounds harsh, and I  am admittedly being a little bit dramatic for arguments sake. But hear me out.<\/p>\n<p><strong>Decades of Learning &amp; Trying<\/strong><\/p>\n<p>I was an idealistic young man. I believed in changing the world through public policy, volunteerism and high ideals. I thought I could be friends with everyone and respected by all those around me. All great stuff and would not have changed a thing about my life experience thus far. But in some ways I was wrong and I cared way too much.<\/p>\n<p><strong>Chaos World &amp; People&#8217;s Myopic Views<\/strong><\/p>\n<p>The world does not work in an organized fashion and almost nothing goes to plan in reality. And again, I would not change a thing because perhaps this is what makes life a very interesting experience. We cannot neatly plan the path, it takes many unexpected and chosen twists and turns.<\/p>\n<p>You also realize that people are people with their own biases and blind spots, including ourselves. We are not all knowing beings that can act the exact right way in every experience and be our best selves. Having this understanding has helped me forgive people and myself over the years for so called transgressions.<\/p>\n<p><strong>I Love People, I Do Not Like Their Behavior<\/strong><\/p>\n<p>People do deserve love, but most people have a hard time really acting in a way that is aligned with our highest ideals as human creatures. This is probably because we have limited information, are driven by mamallian desires, can be very ego driven centric and petty things. This can all make functioning in any society challenging. Frankly, we have probably currently built as best a model as humans can for the times.<\/p>\n<p><strong>Enter Stoicism<\/strong><\/p>\n<p>A few years ago I started reading about stoicism and it resonated. I am no guru so do not look to me to provide some profound deep insight or understanding. I have plucked the nuggets of wisdom I could and try my darnedest to apply on a regular basis, albeit with many missteps along the way.<\/p>\n<blockquote>\n<h3>Essentially Stoicism as I see it is an attempt at not being ruled by our emotions and the changing winds of the environment around us. It is a way to accept what is going on and take whatever action is required to address the situation in a calm and thoughtful manner. At times, it reminds me to just listen and be still. Just experience what is going on without some urge to control or manipulate the situation.<\/h3>\n<\/blockquote>\n<p><strong>Why Stop Caring?<\/strong><\/p>\n<p>When I say &#8220;stop caring&#8221; I am not saying become a heartless monster. That is neither good for your or our society. I am saying live and let live. Let go of the little things we perceive as slights against us. We make so many things about us that probably have nothing to do with our blip of a life. We constantly assume we understand where someone is coming from or how they are feeling, but we probably have no idea.<\/p>\n<p>I mean stop caring so much about what some people think. You know the people that you should pretty much ignore. And invest in the friends and family that seem to genuinely be interested in being part of a healthy life. Here are some ways to &#8220;stop caring&#8221; to make for a stronger healthier life:<\/p>\n<p><strong>A. Be Vulnerable &amp; Let It Go<\/strong><\/p>\n<p>In order to have any kind of meaningful relationship with another person we really need to shed the &#8220;Superman&#8221; or &#8220;WonderWoman&#8221; costume. None of us are perfect and we all need help at different times.<\/p>\n<p><strong>B. Understand the rings of control, influence and no control<\/strong><\/p>\n<p>If you draw three rings inside each other, the inner small ring represents those things you can control in this life. This can be the following kinds of things:<\/p>\n<ul>\n<li>some of your decisions.<\/li>\n<li>The way you respond to something after taking a pause.<\/li>\n<li>Your attitude.<\/li>\n<li>Your work ethic and ability to take small actions to success.<\/li>\n<li>Your ability to manage your immediate environment for optimal success.<\/li>\n<li>Some of your thoughts and how you respond to thoughts.<\/li>\n<\/ul>\n<p><strong>This inner circle is where I believe our power and ability to harness compound benefits derives. Over the years it has become more of my focal point.<\/strong><\/p>\n<p><strong>Circle of Influence.<\/strong> This is the next ring outward that involves things we may be able to influence but not fully control. For example, if we are part of a major project team at work, we may have influence over the project, but not total control. We have influence in our family to set a tone, be helpful and positive, etc. BUT we cannot control everyone.<\/p>\n<p><strong>No Control or Very Little Ring:<\/strong> This large ring around everything is the whole world we see in society, on the news, in the universe. We do not directly dictate the outcomes of world events or existential conditions. This massive amount of information and churn can be hard to manage in our brains. Do we jump from one awful world event to the next and become deeply saddened, anxious and neurotic? I don&#8217;t think that is very helpful to anyone.<\/p>\n<p>Instead, we must do what we can with the knowledge and resources at our disposal and then let it all be.<\/p>\n<p><strong>C. Stop Caring About Romanticism<\/strong><\/p>\n<p>Romantic ideals are very nice for fairy tales, and they give us humans something to strive for. But we must firmly understand these are fantasies. Be vigilant about separating your fantasies from the realities of living life. This does not mean life isn&#8217;t beautiful, it can be. There are many beautiful moments, but they are not Hollywood produced fantasies, and that is just fine.<\/p>\n<p><strong>D. Take Care of Yourself<\/strong><\/p>\n<p>Sometimes in our culture we are taught subliminally that taking care of ourselves is selfish. This is not true. We can only be effective for others if are effective for ourselves. And this takes a certain amount of self care. Like anything, this can become an unhealthy obsession. But we only have one body and mind. We must nurture ourselves in order to be most effective in this world. Take care of the body and mind and many things may fall into place.<\/p>\n<p><strong>E. Build Boundaries<\/strong><\/p>\n<p>We are creatures limited by time, space and resources. It is impossible to be everything to everyone at all times. Develop your priorities and ensure there are times when you are saying &#8220;no thank you&#8221;, I cannot do this or that.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Never give up they say! Always do the right thing! Sacrifice and only say nice things. How about trying a different approach: stop caring and worrying so much for a more fruitful life? Ok, sounds harsh, and I  am admittedly being a little bit dramatic for arguments sake. But hear me out. Decades of Learning &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/11\/how-to-stop-caring-live-a-fruitful-experience\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;How to Stop Caring &#038; Live a Fruitful Experience&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12710,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[13,11,21],"tags":[631,630],"class_list":["post-12705","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-health","category-family","category-psychology","tag-personal-growth","tag-stoicism"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/11\/pexels-photo-4328473.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12705","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12705"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12705\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12710"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12705"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12705"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12705"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}