{"id":12779,"date":"2022-12-04T13:12:13","date_gmt":"2022-12-04T21:12:13","guid":{"rendered":"http:\/\/terminator.moneyvikings.com\/?p=12779"},"modified":"2023-07-25T06:59:46","modified_gmt":"2023-07-25T13:59:46","slug":"what-to-do-when-trying-to-keep-the-credit-card-balance-down-3-steps","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/12\/what-to-do-when-trying-to-keep-the-credit-card-balance-down-3-steps\/","title":{"rendered":"What to Do When Trying to Keep the Credit Card Balance Down! (3 steps)"},"content":{"rendered":"<p>Not sure about you, but this year has been a challenging one financially speaking! We may have survived the physical and emotional trauma of the great pandemic, but what about the financial stress we have been dealing with during the 2022 financial implosion?<\/p>\n<p>It has not been pretty. And I feel things may get a little worse for folks before they get better again. But do not fret, get active, things will improve and we need to ride the storm.<\/p>\n<h3><strong>2022 Financial Stress Bubble Bomb<\/strong><\/h3>\n<p>Let me summarize it this way: In 2022 we saw most asset values decline and inflation hit decades high records. For me and many others, this has had a negative wealth effect feeling. You see, when the market is going up, housing up and prices staying relatively steady, we start to feel wealthier than we actually may be. We may even get a little loose with the spending because we are feeling secure and our net worth is growing.<\/p>\n<p>In 2022, the exact opposite happened and I think we are all feeling it. Those of us with secure employment are getting by, but we are not feeling any wealthier at the end of 2022. Perhaps this is what the Fed wanted. They want us to feel poorer so we will pull back on spending and cool the economy, thus cooling inflation.<\/p>\n<h3><strong>Credit Card Balance Bubble<\/strong><\/h3>\n<p>Credit cards and credit in general is back with a vengeance. Americans are once again putting massive amounts of debt on credit. This is not good in our long run and just feels awful in the short run.<\/p>\n<h3><strong>Inflation Defense Systems<\/strong><\/h3>\n<p>Here at Money Vikings, about 6 months ago we started deploying IDS&#8217;s, Inflation Defense Systems. We realized this problem was not going away fast, therefore we needed to play good defense and good offense. We moved into more secure investments, limited exposure to risky stuff, and found ways to cut back on discretionary spending.<\/p>\n<h3><strong>2023<\/strong><\/h3>\n<p>A new year is upon us and with it brings hope for some brighter days. Perhaps in 2023 we are able to turn the corner on rampant inflation, there appear to be such signs as of this writing. Perhaps assets can get back into growth mode again. But, I would not count on those double digit eye watering returns of 2021.<\/p>\n<h3><strong>3 Steps to Improve<\/strong><\/h3>\n<p>Life and investing are not success only journeys. There can be a lot of 2 steps forward and 1 step back types of moments and 2022 has prove to be a large step back for most. But we are not powerless, we can adapt and find the right moves in the current environment. Here is what I am doing:<\/p>\n<ol>\n<li><strong>Continue automation.<\/strong> Come hell or high water, keep those automated contributions flowing to the self directed IRA or 401k. If you are lucky you will still be taking advantage of well deserved company match. But the big move here is that you are continuing to buy assets on sale. With the overall market down, you are buying more shares into a diversified pool of assets. This could pay off in the outwears when better market conditions arrive.<\/li>\n<li><strong>Resist some splurges<\/strong>. First find the low hanging fruit in the budget and kill it. During the boom times I was regularly adding to my collectibles. I have drastically cut back on such expenditures since this is a hobby first and concept of making money off it is way down the road. Other easy ones are cutting back on the Starbucks orders, lunches out, riding our bikes and finding less expensive ways to enjoy entertainment. Join buy nothing groups, shop at thrift stores, try not to buy very much new stuff. If you enjoy eating out, perhaps share a meal, skip the alcohol\/dessert, etc. Instead of buying new books, re discover the joys of library now that public places are back open. Check those recurring expenses, are they really serving you? Talk with your children about money and budgets and that we need to cut back a bit.<\/li>\n<li><strong>Defensive Investments.<\/strong> I continue to look for defensive investment vehicles and am shying away from speculative plays. I want to find and use investments that have actual property, cash flow, sound business models and track records of success. The latest crypto fiasco at FTX is a reminder to not put all our eggs in one speculative basket. And if it sounds too good to be true based on fairy dust, maybe it is all an illusion.<\/li>\n<\/ol>\n<p>I hope this helps you as we go into 2023. Please share our content on your social media and check out our YouTube channel. We do really appreciate the support as we deliver ideas for you to conquer financial freedom in any environment!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Not sure about you, but this year has been a challenging one financially speaking! We may have survived the physical and emotional trauma of the great pandemic, but what about the financial stress we have been dealing with during the 2022 financial implosion? It has not been pretty. And I feel things may get a &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/12\/what-to-do-when-trying-to-keep-the-credit-card-balance-down-3-steps\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;What to Do When Trying to Keep the Credit Card Balance Down! (3 steps)&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12781,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16,11,21],"tags":[637,639,636,638],"class_list":["post-12779","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing","category-family","category-psychology","tag-best-moves-to-combat-inflation","tag-controlling-credit-card-debt","tag-inflation-defense","tag-investing-in-2023"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/12\/pexels-photo-2766408.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12779","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12779"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12779\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12781"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12779"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12779"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12779"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}