{"id":16298,"date":"2023-06-14T13:28:55","date_gmt":"2023-06-14T20:28:55","guid":{"rendered":"http:\/\/198.199.80.40\/?p=16298"},"modified":"2023-06-14T13:28:57","modified_gmt":"2023-06-14T20:28:57","slug":"rsus-vs-stock-options","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/06\/rsus-vs-stock-options\/","title":{"rendered":"RSUs vs Stock Options"},"content":{"rendered":"\n<div class=\"wp-block-rank-math-toc-block\" id=\"rank-math-toc\"><h2>Table of Contents<\/h2><nav><ul><li><a href=\"#rs-us-vs-stock-options-which-are-better\">RSUs vs Stock Options &#8211; Which are Better?<\/a><\/li><li><a href=\"#what-are-rs-us\">What are RSUs?<\/a><\/li><li><a href=\"#what-are-stock-options-and-how-do-they-work\">What are Stock Options and How do they work?<\/a><\/li><li><a href=\"#whats-the-difference-between-rs-us-and-stock-options\">What&#8217;s the difference between RSUs and Stock Options?<\/a><\/li><li><a href=\"#what-is-a-vesting-schedule\">What is a Vesting Schedule?<\/a><\/li><li><a href=\"#what-are-the-tax-implications-of-receiving-rs-us-from-a-company\">What are the Tax Implications of Receiving RSUs from a company?<\/a><\/li><\/ul><\/nav><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"rs-us-vs-stock-options-which-are-better\">RSUs vs Stock Options &#8211; Which are Better?<\/h2>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"what-are-rs-us\">What are RSUs?<\/h2>\n\n\n\n<p>Restricted Stock Units (RSUs) are a form of equity compensation granted by companies to their employees. RSUs represent a promise by the employer to grant the employee a certain number of shares of company stock, typically subject to vesting requirements. Unlike stock options, RSUs do not confer the right to purchase shares of company stock at a fixed price. Rather, RSUs represent a grant of actual shares of stock, which are typically subject to restrictions on when they can be sold. RSUs vs Stock Options.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"1024\" src=\"http:\/\/198.199.80.40\/wp-content\/uploads\/2023\/06\/IMG_7005.jpeg\" alt=\"\" class=\"wp-image-16300\" srcset=\"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/06\/IMG_7005.jpeg 1024w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/06\/IMG_7005-300x300.jpeg 300w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/06\/IMG_7005-150x150.jpeg 150w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/06\/IMG_7005-768x768.jpeg 768w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"what-are-stock-options-and-how-do-they-work\">What are Stock Options and How do they work?<\/h2>\n\n\n\n<p>Stock options are a popular form of compensation offered by many companies to their employees. They provide employees with the opportunity to purchase company stock at a fixed price, which can be a valuable financial benefit if the stock price increases significantly over time. However, it is important to understand the concept of vesting schedules when receiving stock options as part of your compensation package. RSUs vs Stock Options is another story.<\/p>\n\n\n\n<p>When you receive stock options from your company, here are some key things you should consider doing:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Understand the type of stock options you have been granted and their vesting schedule.<\/li>\n\n\n\n<li>Keep track of important dates, including the vesting schedule and expiration date of the options.<\/li>\n\n\n\n<li>Monitor the performance of the underlying company stock, and consider your personal financial situation before making any decisions to exercise or sell your options.<\/li>\n\n\n\n<li>Consider consulting a financial advisor or tax professional for guidance on managing your stock options.<\/li>\n<\/ol>\n\n\n\n<p>Remember that managing stock <a href=\"http:\/\/198.199.80.40\/2023\/06\/options-trading\/\" data-type=\"post\" data-id=\"16187\" target=\"_blank\">options<\/a> can be complex and can have significant tax implications. It&#8217;s important to educate yourself on the risks and rewards before making any decisions.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"whats-the-difference-between-rs-us-and-stock-options\">What&#8217;s the difference between RSUs and Stock Options?<\/h2>\n\n\n\n<p><a href=\"https:\/\/www.schwab.com\/public\/eac\/resources\/articles\/rsu_facts.html\" target=\"_blank\" rel=\"noopener\">Restricted Stock Units<\/a> (RSUs) and Stock Options are both forms of equity compensation granted by companies to their employees, but they work in different ways. RSUs vs Stock Options:  RSUs represent a promise by the employer to grant the employee a certain number of shares of company stock, typically subject to vesting requirements. Unlike stock options, RSUs do not confer the right to purchase shares of company stock at a fixed price. Rather, RSUs represent a grant of actual shares of stock, which are typically subject to restrictions on when they can be sold. Stock options, on the other hand, give the employee the right to purchase shares of company stock at a fixed price, known as the &#8220;strike price,&#8221; for a set period of time, usually several years. Stock options can be a valuable form of compensation if the stock price increases significantly during the period between being granted the options and exercising them. However, stock options can also lead to significant tax liabilities for employees, while RSUs generally have simpler tax implications.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"what-is-a-vesting-schedule\">What is a Vesting Schedule?<\/h2>\n\n\n\n<p>A vesting schedule is a timeline that determines when an employee can exercise their stock options or are granted their RSUs. Most vesting schedules require employees to work for the company for a certain amount of time before they can exercise their options or receive the shares. For example, a four-year vesting schedule might require an employee to work for the company for four years before they can exercise all of their options.<\/p>\n\n\n\n<p>The purpose of a vesting schedule is to incentivize employees to stay with the company for a longer period of time. By requiring an employee to work for the company for a certain amount of time before they can exercise their options, the company is essentially saying &#8220;We want you to stay with us for the long haul.&#8221; If the employee leaves the company before the vesting period is up, they forfeit their options.<\/p>\n\n\n\n<p>It&#8217;s important to note that vesting schedules can vary widely between companies. Some companies may have shorter vesting schedules, while others may require employees to work for the company for many years before they can exercise all of their options. It&#8217;s important to understand the vesting schedule for your particular stock options so you can plan accordingly.<\/p>\n\n\n\n<p>In summary, stock options can be a valuable form of compensation for employees, but it&#8217;s important to understand the concept of vesting schedules. Make sure you know how long you need to work for the company before you can exercise your options, and keep that timeline in mind when planning your financial future. RSUs vs Stock Options. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"what-are-the-tax-implications-of-receiving-rs-us-from-a-company\">What are the Tax Implications of Receiving RSUs from a company?<\/h2>\n\n\n\n<p>RSUs have simpler tax implications compared to stock options, but the tax rules can still be complicated. When the RSUs vest and the shares are delivered to the employee, the fair market value of the shares is considered regular income and taxed accordingly. The employee will need to report the income on their tax return for the year in which the RSUs vest. Some firms will immediately sell some of the shares to cover a tax liability at the end of the tax year so people aren&#8217;t surprised. Note that if the stock increases in value and one sells additional shares, there will be additional tax liabilities. When the employee sells the shares, they will be subject to either short-term or long-term capital gains taxes, depending on how long they held the shares. The cost basis for the shares is the fair market value of the shares when they vested.<\/p>\n\n\n\n<p>It&#8217;s important to note that tax laws and rules can change, and the details of your specific situation can impact the tax implications of RSUs. It&#8217;s always a good idea to consult with a tax professional to ensure you&#8217;re making informed decisions about your finances. RSUs vs Stock Options can be tricky. Usually you don&#8217;t get to choose which one you get. Should you exercise your options and make a huge profit on the options and shares in year 1, but then continue to hold the shares and they decrease in value, you will still be taxed on the option profit.<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-wp-embed is-provider-money-vikings wp-block-embed-money-vikings\"><div class=\"wp-block-embed__wrapper\">\nhttp:\/\/198.199.80.40\/2023\/02\/tax-brackets-2022\/\n<\/div><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>RSUs vs Stock Options &#8211; Which are Better? What are RSUs? Restricted Stock Units (RSUs) are a form of equity compensation granted by companies to their employees. RSUs represent a promise by the employer to grant the employee a certain number of shares of company stock, typically subject to vesting requirements. Unlike stock options, RSUs &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/06\/rsus-vs-stock-options\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;RSUs vs Stock Options&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":2,"featured_media":16302,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16],"tags":[147],"class_list":["post-16298","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing","tag-options"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/06\/IMG_6962.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/16298","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=16298"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/16298\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/16302"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=16298"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=16298"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=16298"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}