{"id":16437,"date":"2023-07-08T08:10:31","date_gmt":"2023-07-08T15:10:31","guid":{"rendered":"http:\/\/198.199.80.40\/?p=16437"},"modified":"2023-10-14T09:50:54","modified_gmt":"2023-10-14T16:50:54","slug":"5-stoic-rules-for-a-better-life","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/07\/5-stoic-rules-for-a-better-life\/","title":{"rendered":"5 Stoic Rules for a Better Life!"},"content":{"rendered":"\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<h3 class=\"wp-block-heading\">Love the hand that fate deals you and play it as your own<\/h3>\n<\/blockquote>\n\n\n\n<p>Attention Money Vikings, this is may be the most critical topic we talk about this year in the raging 20&#8217;s, stoic rules for a better life. I guarantee this can help anyone strengthen the outcome of their life in many ways. So settle in for a thought provoking conversation that can change your life! It changed mine and made me more calm, at peace and able to navigate the world.<\/p>\n\n\n\n<p>Yes, investing, options, dividends and real estate are tools for financial success. But financial success without overall quality of life and ability to manage life is pointless. This is why we talk about True Wealth. There is no point in a pile of cash without purpose, relationships, health and creativity. And I think Stoic ideas are a way to improve in all these areas of life. Stoic rules for a better life changed my life for the better!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Stoic Rules for a Better Life<\/strong><\/h3>\n\n\n\n<p>Stoic rules for a better life can make a huge difference in wealth, happiness, contentment, relationships and overall quality of life. I truly believe that if people learned these philosophies and tried to practice them, the world would be a better place for all.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Why?<\/strong><\/h3>\n\n\n\n<p>Why do I make such bold predictions? Because if you dive into the stoic philosophies, you realize that what they said and were thinking is just as relevant today as it was to human existence 2000 years ago.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<h3 class=\"wp-block-heading\">When you arise in the morning think of what a privilege it is to be alive, to think , to enjoy, to love&#8230;<\/h3>\n<\/blockquote>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_83694\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/7pxwOXzZpyo?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Who were the Stoics?<\/strong><\/h3>\n\n\n\n<p>Stoics were a lot more than old dudes in Ancient Rome. Marcus Aurelius is perhaps the most famous stoic. He was an enlightened emperor that fortunately for us kept a journal about human existence and his philosophies of stoicism. He thought deeply about how to live a good life and manage the human condition.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"300\" height=\"182\" src=\"http:\/\/198.199.80.40\/wp-content\/uploads\/2023\/07\/MarcusAurelius-Past-300x182.jpg\" alt=\"\" class=\"wp-image-16445\" srcset=\"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/07\/MarcusAurelius-Past-300x182.jpg 300w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/07\/MarcusAurelius-Past-768x467.jpg 768w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/07\/MarcusAurelius-Past.jpg 970w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" \/><\/figure>\n\n\n\n<p>Famous Stoics include <b>Zeno of Citium and Roman Emperor Marcus Aurelius<\/b>. Stoicism was (and is) a practical philosophy that deals with ethics, politics, and social matters. What I have mainly found is a practical guide for dealing with the realities of life, which can make us stronger and healthier people. The first of the Stoics began teaching in Athens in the 3rd Century BCE, spearheaded by Zeno of Citium. This article is not a history lesson, so if you want more about the<a href=\"https:\/\/www.thecollector.com\/what-are-the-origins-of-stoicism-history\/\" target=\"_blank\" rel=\"noopener\"> history of stoicism check it out here.<\/a><\/p>\n\n\n\n<p>Stoicism is a philosophy that originated in ancient Greece and later gained popularity in ancient Rome. It teaches individuals how to live a virtuous and fulfilled life by focusing on reason, accepting the natural order of the world, and practicing self-control. It was called a recipe for happiness in life. Which would have been pretty groundbreaking at this time when most people probably lived rather challenging lives.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>A Practical Guide<\/strong><\/h3>\n\n\n\n<p>At Money Vikings we like to boil subjects down to their essence so we can use them as tools to build True Wealth. Below we lay out 5 practical ways to incorporate Stoic philosophies into your life!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>1. Your Not Stuck<\/strong><\/h3>\n\n\n\n<blockquote>\r\n<h3 class=\"wp-block-heading\">Choose not to be harmed, and you won&#8217;t feel harmed. Don&#8217;t feel harmed, and you haven&#8217;t.<\/h3>\r\n<\/blockquote>\n\n\n\n<p>Marcus makes clear that when we feel stymied in one capacity, there are always other options available to us as move through life. My grandfather used to always say, &#8220;life is a series of challenges, but each challenge has at least one solution.&#8221; I think this was not only a realistic yet optimistic way of looking at reality, it also left open the concept of options. No matter how bad or challenging things get, we can make change and choose alternative paths.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<h3 class=\"wp-block-heading\">At dawn, when you have trouble getting out of bed, tell yourself: “I have to go to work — as a human being. What do I have to complain of, if I’m going to do what I was born for — the things I was brought into the world to do? Or is <em>this<\/em> what I was created for? To huddle under the blankets and stay warm?”<\/h3>\n<\/blockquote>\n\n\n\n<h3 class=\"wp-block-heading\">To the mind’s natural protestation that staying under the blankets simply feels nicer, Aurelius retorts:<\/h3>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<h3 class=\"wp-block-heading\">So you were born to feel “nice”? Instead of doing things and experiencing them? Don’t you see the plants, the birds, the ants and spiders and bees going about their individual tasks, putting the world in order, as best they can? And you’re not willing to do your job as a human being? Why aren’t you running to do what your nature demands?<\/h3>\n<\/blockquote>\n\n\n\n<p><p>This is an amazing quote because even the most powerful man in the world thousands of years ago didn&#8217;t want to get out of bed in the morning. But then he thought, why would I lay here, was this my purpose?<\/p>\n<p>We do not always control what is happening, but we have some control over our response. At least with mental training and practice we can control how we respond.<\/p><\/p>\n\n\n\n<p><strong>Money Vikings Application<\/strong>: In terms of personal finance this is a powerful message. Millions of people feel stuck in jobs they don&#8217;t like, in debt or just overall a poor personal financial situation. You are not stuck. You can take one small action today, and the next day, and the next that will pay off in the future! Explore your options and choose to take action and expand your possibilities.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>2. Take Things Step by Step<\/strong><\/h3>\n\n\n\n<blockquote>\r\n<h3 class=\"wp-block-heading\">Concentrate on what&#8217;s in front of you.<\/h3>\n\n\n\n<h3 class=\"wp-block-heading\">What stands in the way, becomes the way.<\/h3>\n\n\n\n<h3 class=\"wp-block-heading\">You could be good today, instead you choose tomorrow.<\/h3>\r\n<\/blockquote>\n\n\n\n<p>This can be the single biggest hurdle for people to achieve their goals in investing and life. So often, a person wants to skip ahead to some magical fantasy moment when everything becomes perfect. The perfect conditions for relationships, money, family and more. There really is not one moment, there is only efforts and progress each day and each step of the way.<\/p>\n\n\n\n<p>We only have the power of now and this moment to take action. This is a beautiful and simple concept.<\/p>\n\n\n\n<p><strong>Money Vikings Application:&nbsp;<\/strong>This stoic rule for a better life allows us to not be overwhelmed by a huge task, let&#8217;s say building substantial wealth. The stoics would say it all starts with one simple step. For example, did you sign up to make automated investments? Did you research a fund, REIT or stock? What next simple step can you take?<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>3. Focus on what you can control<\/strong><\/h3>\n\n\n\n<blockquote>\r\n<h3 class=\"wp-block-heading\">You have power over your mind, not outside events.<\/h3>\n\n\n\n<h3 class=\"wp-block-heading\">Our life is what our thoughts make it.<\/h3>\r\n<\/blockquote>\n\n\n\n<p>Stoics emphasized the distinction between things that are within our control (internal) and things that are outside our control (external). They believed that we should focus our energy and attention on the things we have control over, such as our thoughts, actions, and attitudes, while accepting with equanimity the things we cannot control, such as the actions of others or the natural world.<\/p>\n\n\n\n<p><strong>Money Vikings application<\/strong>: In order to apply this stoic rule for a better life, I think of all things in 3 separate circles. The things I can control (my thoughts, actions, tone, decisions&#8230;), the things I may influence (family, friends, work&#8230;) and the things I have no control over (geo politics, the economy, the stock market, other people&#8217;s opinions\/behaviors, etc.)<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>4. Never Give Up<\/strong><\/h3>\n\n\n\n<blockquote>\r\n<h3 class=\"wp-block-heading\">Get back up when you fail. Celebrate behaving like a human.<\/h3>\r\n<\/blockquote>\n\n\n\n<p>Next on our list of stoic rules for a better life, never give up! As we have mentioned before, investing and life is not a success only journey. We will fail at times. What is critical is that we get back up and try better.<\/p>\n\n\n\n<p>Check out our psychology section for ways to increase strength, stamina and keep <a href=\"http:\/\/198.199.80.40\/2023\/03\/feeling-behind-in-life\/\" target=\"_blank\">moving forward no matter where you are in life.<\/a><\/p>\n\n\n\n<p><strong>Money Vikings application:<\/strong> The Stoics understood that life can be a challenging journey and experience. But why not accept this reality and move through it? What is the alternative, hide under the covers? I challenge myself to try, potentially fail, learn from this and get up and try again. Stoic rules for a better life for the win!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>5. Stop caring about other&#8217;s opinions so much<\/strong><\/h3>\n\n\n\n<blockquote>\r\n<h3 class=\"wp-block-heading\">The tranquility that comes when you stop caring what they say, or think or do.<\/h3>\r\n<\/blockquote>\n\n\n\n<p>This stoic rule for a better life is critical to building wealth. Self made millionaires are not trying to keep up with Jonese or Kardashians or whomever. In fact, in the groundbreaking research in The Millionaire Next Door books, it was discovered that self made millionaires did not really care what other people thought about the car they drove or the clothes they wore. They were not spending Money to try and impress other people. Financial indolence was far more critical and important to them than showing off and garnering attention.<\/p>\n\n\n\n<p><strong>Money Vikings application:<\/strong> &nbsp;This stoic rule for a better life is about leaving other people&#8217;s opinions to themselves. You can&#8217;t help what they think, so just focus on your own thoughts and behaviors. If in your heart you are acting and behaving out of courage, empathy, kindness and truth, then what could anyone&#8217;s opinion have to do with you?<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Other Valuable Stoic Beliefs<\/strong><\/h3>\n\n\n\n<p>There are many great quotes and writings from Marcus A. and others on stoic rules for a better life. Here are a few other areas of Stoic rules for a better life worth considering.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Virtue is the highest good:<\/strong><\/h3>\n\n\n\n<p>Stoics believed that virtue, or living in accordance with reason and moral excellence, is the ultimate goal in life. They considered it more important than wealth, pleasure, or other external goods. Virtue is within our control, and it leads to eudaimonia, a state of flourishing and inner peace.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Live in accordance with nature:<\/strong><\/h3>\n\n\n\n<p>Stoics encouraged individuals to live in harmony with nature, not just the natural world but also their own nature as rational beings. They believed that reason is our defining characteristic and that we should cultivate wisdom and live in accordance with rationality, ethics, and logic. One of the ultimate ways to live in harmony with nature is to study those who live in &#8220;blue zones.&#8221;:<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_30506\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/cu1Pp3r7JIo?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Practice self-control and moderation:<\/strong><\/h3>\n\n\n\n<p>Stoics advocated for self-control and moderation in all aspects of life. They believed that excessive desires, attachments, and emotions can lead to suffering and disturbance of the soul. By practicing self-discipline and moderation, we can achieve tranquility and avoid being slaves to our passions. Money Vikings focus on strengthening the <a href=\"http:\/\/198.199.80.40\/2023\/05\/delayed-gratification-psychology\/\" target=\"_blank\">Delayed Gratification muscle<\/a> as one way to practice self control and is a fundamental concept for stoic rules for a better life.<\/p>\n\n\n\n<p>These basics of Stoic philosophies provide a foundation for living a virtuous and fulfilling life, promoting personal growth, resilience, and inner peace. For more, check out the presentations by Ryan Holiday who writes about Stoic philosophy widely:<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_17778\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/OiMbKCXAV8k?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<p>To summarize Stoicism, don&#8217;t get caught up in materialism, have cheerful interactions with your colleagues to bring them up, perform work diligently and for the greater good, and recognize what&#8217;s in and out of your control — don&#8217;t let things out of your control affect your joy.<\/p>\n\n\n\n<p>We can show <b>patience, courage, humility, resourcefulness, reason, justice, and creativity<\/b>. The things that test us make us who we are. The Stoic grows stronger and better with every obstacle they face. I hope you found these stoic rules for a better life helpful and inspirational. Check out other Money Vikings content for ways to be both Money Viking and Stoic strong!<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_68600\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/M1cVgSX4-dA?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_83927\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/heh5XLwZVOY?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>Love the hand that fate deals you and play it as your own Attention Money Vikings, this is may be the most critical topic we talk about this year in the raging 20&#8217;s, stoic rules for a better life. I guarantee this can help anyone strengthen the outcome of their life in many ways. So &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/07\/5-stoic-rules-for-a-better-life\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;5 Stoic Rules for a Better Life!&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":16451,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[21,5,13],"tags":[1147,1148,630],"class_list":["post-16437","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-psychology","category-best-of-mv-classics","category-health","tag-stoic-rules-for-a-better-life","tag-stoic-rules-for-investing","tag-stoicism"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/07\/5-Stoic-Rules-for-a-Better-Life.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/16437","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=16437"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/16437\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/16451"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=16437"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=16437"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=16437"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}