{"id":17836,"date":"2024-04-14T08:11:19","date_gmt":"2024-04-14T15:11:19","guid":{"rendered":"https:\/\/truewealth.moneyvikings.com\/?p=17836"},"modified":"2024-07-02T15:15:49","modified_gmt":"2024-07-02T22:15:49","slug":"10-money-rules-from-ramit-sethi-analyzed","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2024\/04\/10-money-rules-from-ramit-sethi-analyzed\/","title":{"rendered":"10 Money Rules from Ramit Sethi Analyzed"},"content":{"rendered":"<p>In this post, I would like to give my thoughts on<a href=\"https:\/\/www.iwillteachyoutoberich.com\/money-rules\/\" target=\"_blank\" rel=\"noopener\"> Ramit Sethi&#8217;s top 10 money ideas<\/a>. First let me say, I am a Ramit super-fan! I even had the pleasure of attending one of his live events where he interviews real couples about their finances. At the heart of it, he helps people understand their own relationship with money and opens up the possibility of improving on that relationship.<\/p>\n<p>Even if I do not agree exactly with everything he preaches, I find him to be an intelligent and well thought finance guru. His show and podcasts are entertaining and informative. He is also funny and fun to watch. He is not one of these obnoxious YouTube bros pushing crypto or the latest get rich scheme. Hands down I believe his advice leads to a rich life. Many of the concepts he talks about I have not only practiced and lived, but have written about here at Money Vikings over the last 6 plus years.<\/p>\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_63531\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/X7yocMUWIis?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<p>That said, here are some of his top 10 money rules and my personal &#8220;Money Viking&#8221; take on each:<\/p>\n<h2><strong>1. Always have one year of emergency cash<\/strong><\/h2>\n<p>Ramit advocates to keep one year of living expenses in an emergency fund in cash. For many people this could be north of $100,000 with current inflationary issues. This is of course ideal, but in a world where the median retirement savings at 55 is only $185,000, how many people actually have six figures in a separate emergency fund? Conservative estimates are that only about 30% of the population has a years worth of living expenses in an emergency fund, and I imagine that number is well under $100k.<\/p>\n<h3>Money Viking Take<\/h3>\n<p>Yes, we need to have an emergency fund, but one year&#8217;s worth has two issues: First, it is really hard for most folks to achieve this. And two, if that money is just sitting in a plain old savings account, then it is being eaten away by inflation each year. I would rather that money be in a high yield savings account, money market or even taxable investment account. I am aim to keep 4-6 months emergency cash on hand.<\/p>\n<h2><strong>2. Save 10% and invest 20% of gross income<\/strong><\/h2>\n<p>Again, Ramit is right, this is ideal, but very hard for most people. Especially folks raising children. Nothing against them, but I believe finances are very different for those without children. If a person is single or a couple with no kids, I am sure this savings\/investing rate is achievable. With kids, I would give yourself a little more slack. You may fluctuate in and out of this routine.<\/p>\n<h3>Money Viking Take<\/h3>\n<p>The critical thing is to save and invest some amount. I believe the first step is to START with automation. Have at least 5% invested automatically, receive any company match and increase and diversify this over time. But the main message is to start. I see so many people wait years and miss out on compound growth that really gets moving in about year 15-20. With the cost of living and inflation as bad as it has been, anyone that can automate saving any amount of their income should be applauded. Perhaps this is sometimes 5% or $50 or other times it can be ramped up to the high levels Ramit mentions.<\/p>\n<h2>3. Pay cash for large expenses (dream trip, wedding, engagement ring), at least 20% down on house<\/h2>\n<p>Yes, ideal advice. It is a real drag to wealth building to be paying interest on an event or thing that is a memory. I would throw cars into this mix. The interest on these large expenses that are luxuries really adds up. Do not finance these things.<\/p>\n<h3>Money Viking Take<\/h3>\n<p>I personally think big extravagant weddings are a huge waste of money, especially on credit cards. Travel is great, but should be covered in cash. If a large expensive wedding cannot be paid for in cash, then the couple should scale down to what they can reasonably afford. Fair tale weddings are not the only thing in life, and people can have great lives even with very simple low cost weddings.<\/p>\n<h2>4. Never question spending money on books, appetizers, health, or donating to a friends charity fundraiser<\/h2>\n<p>Ok, I get the idea here, investing in self improvement and others is important, but not sure I agree with all categories. Let&#8217;s take them one at a time.<\/p>\n<h3>Money Viking Take<\/h3>\n<p>Books are expensive when purchased new at a retail store. I love books, but they end up needing space after purchased and are expensive. Shop used or better yet, use the library. I only buy the few books that I want to revisit for many years.<\/p>\n<p>Appetizers, skip them for the most part. I have saved tons of money not ordering appetizers or fancy drinks. Split meals if possible, this kind of stuff does add up.<\/p>\n<p>Health, yes, we love health investments at MV. We have a whole section of our blog and YouTube channel dedicated to this topic because it is clearly a part of a life of True Wealth. But never question spending? There are lots of health scams out there like questionable supplements or unproven technologies. I would say make strategic investments in health through low cost methods.<\/p>\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_99305\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/BCN9119oHSg?enablejsapi=1&#038;list=PLms5WdQ8kVazs4QKMGrbjvOxHbcFSxbdt&#038;index=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<p>&nbsp;<\/p>\n<h2>5. Business Class on flights over 4 hours<\/h2>\n<p>What? It all depends. This is a nice luxury that many can&#8217;t afford.<\/p>\n<h3><strong>Money Vikings Take<\/strong><\/h3>\n<p>This can add a considerable amount to a ticket price. This all depends on the price difference to me. Yes, I like business class, but the cost should be weighed against the extra leg room.<\/p>\n<h2>6. Buy the best and keep it as long as possible<\/h2>\n<p>Ok, I see the point, quality will last longer and delay the need to replace an item.<\/p>\n<h3>Money Viking Take<\/h3>\n<p>I think this depends on the item and the circumstances. If someone has children or pets, we may not always be buying the best, because stuff gets ruined and worn out more quickly. And sometimes we can obtain the best through thrift stores or second hand, so having quality does not have to mean spending a ton of money.<\/p>\n<h2>7. No limits on spending on health or education<\/h2>\n<p>I see the point, health and education can lead to a better life of all around True Wealth, but this advice is a bit misleading.<\/p>\n<h3>Money Viking Take<\/h3>\n<p>First of all, health and information (education) can be optimized for very little money. Walking, riding a bike, eating vegetables, avoiding bad fats\/sugars is mainly free. Why would I need to spend that much more on health?<\/p>\n<p>Education debt is a huge problem in our society and for our economy. There should be limits on educational spending. And, like health, knowledge and information are becoming more and more free and available over time.<\/p>\n<h2>8. Earn enough to work with people you respect<\/h2>\n<p>Yes, I see the point. We should shun and push away toxic people in our lives. Negativity, unsupportative, back stabbing people should be kept as far away as possible.<\/p>\n<h3>Money Viking Take<\/h3>\n<p>The reality is that a work environment is made up typically of a huge cross section of personalities and dynamics. We may not always get to choose who is on our project team, therefore we must also learn the skills needed to navigate all kinds of personalities. It is quite the luxury to just say one will never work with toxic personalities.<\/p>\n<h2>9. Prioritize time outside the spreadsheet<\/h2>\n<p>Absolutely, life is out there, not on some screen or in some spreadsheet, enough said.<\/p>\n<h2>10. Marry the right person<\/h2>\n<p>Who we marry is critical to overall life success and satisfaction. I take marriage seriously, but I have also been divorced. The reality for millions is that divorces happen and it can be devastating. It would be better to de-stigmatize this and have healthy endings to marriages. But of course, marry wisely.<\/p>\n<p><strong>MORE WAYS TO LEARN TO LIVE A RICH LIFE FROM THE MONEY VIKINGS:<\/strong><\/p>\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_83300\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/EHjWqxPLnFk?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this post, I would like to give my thoughts on Ramit Sethi&#8217;s top 10 money ideas. First let me say, I am a Ramit super-fan! I even had the pleasure of attending one of his live events where he interviews real couples about their finances. At the heart of it, he helps people understand &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2024\/04\/10-money-rules-from-ramit-sethi-analyzed\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;10 Money Rules from Ramit Sethi Analyzed&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":17796,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16],"tags":[],"class_list":["post-17836","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2024\/02\/9-surprising-lessons-that-made-m.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17836","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=17836"}],"version-history":[{"count":8,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17836\/revisions"}],"predecessor-version":[{"id":17890,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17836\/revisions\/17890"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/17796"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=17836"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=17836"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=17836"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}