{"id":17906,"date":"2024-07-06T07:49:23","date_gmt":"2024-07-06T14:49:23","guid":{"rendered":"https:\/\/truewealth.moneyvikings.com\/?p=17906"},"modified":"2024-07-06T22:09:05","modified_gmt":"2024-07-07T05:09:05","slug":"im-a-self-made-millionaire-here-are-4-things-i-would-do-again-if-starting-today","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2024\/07\/im-a-self-made-millionaire-here-are-4-things-i-would-do-again-if-starting-today\/","title":{"rendered":"I&#8217;m a Self Made Millionaire &#8211; Here are 4 things I would do again if starting today"},"content":{"rendered":"<p>I am a regular middle class guy from a middle class background. I applied myself in school and earned a solid public school education. My luckiest break was probably being raised by two loving parents, not something everyone enjoys in this world. They divorced when I was an adult, but the bottomline is that I experienced a wonderful childhood considering this world of ours.<\/p>\n<p>My biggest struggle was being diagnosed with dyslexia in kindergarten in the 80&#8217;s. My mother was told by others that I would probably not amount to anything and would be average my whole life. I could sense this and decided to persevere and prove to myself I could achieve things in life.<\/p>\n<h2><strong>Negative $15k Net Worth<\/strong><\/h2>\n<p>Over 25 years ago I graduated from college with $15k in school debt. I went right to start work with a net worth of negative $15k. This may not sound like much today, but in the late 90&#8217;s $15k was still considered a lot of money. About two decades later I was a multi-millionaire.<\/p>\n<p>Over a couple decades of work, sound financial practices and investing, I became a multi millionaire. And I did not invent a tech company, inherit a fortune or win the lotto. When I look back, here are the 4 things I did that would still work today for someone starting out. I wanted to write this all down to inspire younger people to get engaged with their wealth building journey and have hope for their future.<\/p>\n<h2><strong>1. Automate Investing<\/strong><\/h2>\n<p>You see, most people say, someday I will invest when I have this much, or pay this off, or make a certain salary. Someday when the stars align I will&#8230;But that perfect day never arrives. See, the world is constantly changing and goal posts are always moving. There is a lot of good in this world, but I have rarely found the concept of &#8220;perfect&#8221; conditions for anything. Inflation, job changes, life priority changes, family formation, etc. Life is change.<\/p>\n<p>The only way to get out of our own unreliable way is to automate investing. When I started working I had the foresight to start automating a certain percentage of salary directly into an investment vehicle each month such as a low cost index fund or 401k. People totally underestimate how powerful this becomes over the decades. The first 10 years seem like an uphill climb and the numbers don&#8217;t look too great. But somewhere around year 10, compounding, matches and market forces made these initial investments go to great heights. And it just continues to this day.<\/p>\n<p><strong>Ignore market turbulence<\/strong><\/p>\n<p>It is tempting to worry about the market going up or down, etc. But remember two critical things: First of all, when the market goes down you are dollar cost averaging into assets on sale, which helps your wealth building in the long run. Secondly, there is actually never a magical day when one should be withdrawing their entire nest egg. The idea is to create a passive income machine that you can live on later in life. So what if a million dollar portfolio is down $100k one year or up $75k the next. It will fluctuate.<\/p>\n<h2><strong>2. Perseverance Through Struggle<\/strong><\/h2>\n<p>Life will not be a success only journey. I am Gen X and have now faced my fair share of life and professional challenges. Many of us have lived our investing lives through the dot com bust, 9\/11, Great Recession, Pandemic, etc. and who knows what comes next in the raging 20&#8217;s? And the reality is that there will be more, that is the nature of this existence. BUT, the amazing news comes from my late grandfather. He always said &#8220;Life is one challenge after another, but there is always at least one solution.&#8221; He was right, we will face challenges, but there are ways to deal with them.<\/p>\n<p>If starting again today, make sure to develop the grit and determination to persevere through challenges. I am not saying this is easy, but through studying and living fully present, you will develop a thicker skin and ability to problem solve. To be wealthy requires this skill.<\/p>\n<h2><strong>3. Learn Money Skills<\/strong><\/h2>\n<p>Speaking of skills, managing Money is a skill that most people never develop. One of the reasons we started Money Vikings is because our financial education in the US is awful to none. People are literally never taught how to manage money, invest and grow wealth over time.<\/p>\n<p>It is critical through your life journey to continue to learn money skills. Heck, it is critical to the health of our brains to always learn, but money skills will pay off. I read and watch all I can about money management and investing. I don&#8217;t do it all, but you can take the information in and decide what best aligns with your values.<\/p>\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_88299\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/hgOSKgxOYpk?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<h2><\/h2>\n<h2><strong>4. Keep the Investing Core Fundamental<\/strong><\/h2>\n<p>Every month there will be a new investing gimmick or guru throwing some wacky ideas your way, especially in the social media age with everyone glued and hypnotized. Do not fall for it. Stick to fundamental common sense investing. Learn to manage risk in investing and invest in sound investment vehicles. My best investments over the years have been long term holdings of stock ETF&#8217;s and real estate. I have some exposure to other investment vehicles such as individual stocks, some crypto, some bond funds, CD&#8217;s, etc. BUT the low cost diversified stock ETF&#8217;s and real estate were the real game changers.<\/p>\n<p>This is why I say to have an investing core that is beautiful in its simplicity. Sure, I dabble in other stuff, but 90% of investments are just plain vanilla boring long term investments in the tried and true. For me this incudes S&amp;P 500 based ETF&#8217;s, a bond fund, some real estate and CD&#8217;s.<\/p>\n<h3><strong>Simple yet effective<\/strong><\/h3>\n<p>It is never too late to begin implementing these 4 core principals. Too often I think people believe it is too late for them. Even if you are in your 50&#8217;s, you could live another 50 years. Why not start automating, persevering, learning and keeping it simple.<\/p>\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_18650\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/J8dH33Xu6Hk?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n","protected":false},"excerpt":{"rendered":"<p>I am a regular middle class guy from a middle class background. I applied myself in school and earned a solid public school education. My luckiest break was probably being raised by two loving parents, not something everyone enjoys in this world. They divorced when I was an adult, but the bottomline is that I &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2024\/07\/im-a-self-made-millionaire-here-are-4-things-i-would-do-again-if-starting-today\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;I&#8217;m a Self Made Millionaire &#8211; Here are 4 things I would do again if starting today&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":17889,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16],"tags":[],"class_list":["post-17906","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2024\/07\/how-to-be-a-millionaire-in-2024.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17906","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=17906"}],"version-history":[{"count":10,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17906\/revisions"}],"predecessor-version":[{"id":17921,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17906\/revisions\/17921"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/17889"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=17906"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=17906"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=17906"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}