{"id":17935,"date":"2024-07-22T16:09:29","date_gmt":"2024-07-22T23:09:29","guid":{"rendered":"https:\/\/truewealth.moneyvikings.com\/?p=17935"},"modified":"2024-07-22T16:09:29","modified_gmt":"2024-07-22T23:09:29","slug":"the-road-to-one-million-dollars-simple-financial-math","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2024\/07\/the-road-to-one-million-dollars-simple-financial-math\/","title":{"rendered":"The Road to One Million Dollars (simple financial math)"},"content":{"rendered":"<p style=\"font-weight: 400;\"><strong>Simple Financial Math<\/strong><\/p>\n<p style=\"font-weight: 400;\">At some point during our usually lame financial education path (if one even exists in the U.S.) we start to believe that we are not good at math. I hear this from people all the time (insert sad face). I believe in many cases they did not receive very good math education and experience.<\/p>\n<p style=\"font-weight: 400;\">I think people should challenge this belief about themselves. And develop a working knowledge of basic financial math concepts in order to have the tools to build wealth. We do not need to be a character from the show <em>The Big Bang Theory <\/em>in order to be proficient at financial math. We ought to challenge many limiting beliefs about ourselves and push the boundaries of what we believe we are capable of.<\/p>\n<p style=\"font-weight: 400;\">Many people think math is scary and it is understandable why! People say self defeating things like &#8220;I was never good at math,&#8221;or &#8220;I am not good at math,&#8221; etc. Many of these sayings become self-fulfilling prophecies and, in my opinion, are not true. I think people can think more with a math mind than they give themselves credit for. This is a major failure of our education system and society. We can do better and make math fun and engaging for children and adults. Like anything, math skills can be learned and enhanced over time. Math is one of those things that enabled our species to thrive and build the marvel of the modern economy. We are all part of this legacy.<\/p>\n<p style=\"font-weight: 400;\">Reaching financial independence and managing our resources effectively is truly about math. Many F.I.R.E. concepts are based on very straightforward mathematical rules of thumb. For example, save about 20-25 times your annual salary and withdraw 4% a year to live on it for decades. If you can live comfortably on $48,000 per year, save and invest $1.2 million. It sounds like a big number, but at least it is a known number and can become a goal. The bottom line is that we need to do the math, and again, the math is pretty straightforward.<\/p>\n<p style=\"font-weight: 400;\">The good news is that it is pretty basic math. People in general tend to fear math or when presented with math it scrambles our brains. But I truly believe to be firmly on the path to FI, one has to understand and utilize some basic math concepts. When these concepts are truly understood and applied, a person’s life can be transformed from a financial standpoint.<\/p>\n<p style=\"font-weight: 400;\"><strong>Face the fear of math and nail down the most important concepts. Here are what I believe are some of the most important math concepts to utilize to enhance wealth building capacity:<\/strong><\/p>\n<p style=\"font-weight: 400;\">&#8220;I was never good at math.&#8221;<\/p>\n<p style=\"font-weight: 400;\">I hear people say self-defeating things like this all the time. When presented with math, they feel it scrambles their brains. They think math is scary, and it is understandable why! Most of us did not receive very good math education or have good math experiences. This is a major failure of our education system and society. We can do better and make math fun and engaging for children and adults. Math is one of those things that has enabled our species to thrive and build the marvel of the modern economy. We are all part of this legacy.<\/p>\n<p style=\"font-weight: 400;\">So, we ought to challenge our limiting beliefs about math. We can think with a math mind more than we might give ourselves credit for. Like anything, math skills can be learned and enhanced over time. We should develop a working knowledge of basic financial math concepts in order to have the tools to build wealth. We don’t need to be a character from the show <em>The Big Bang Theory <\/em>to be proficient at financial math.<\/p>\n<p style=\"font-weight: 400;\">Many F.I.R.E. concepts are based on very straightforward mathematical rules of thumb. For example, save about 20-25 times your annual salary and withdraw 4% a year to live on it for decades. If you can live comfortably on $48,000 per year, then save and invest $1.2 million. It sounds like a big number, but at least it is a known number and can become a goal.<\/p>\n<p style=\"font-weight: 400;\">The bottom line is that, to be firmly on the path to FI, we need to do the math. And again, the math is pretty straightforward. When these concepts are truly understood and applied, a person’s life can be transformed from a financial standpoint.<\/p>\n<p style=\"font-weight: 400;\"><strong>Face the fear of math and nail down the most important math concepts to enhance your wealth-building capacity:<\/strong><\/p>\n<p style=\"font-weight: 400;\"><strong> <\/strong><\/p>\n<ol>\n<li style=\"font-weight: 400;\"><strong> Compound interest<\/strong><\/li>\n<\/ol>\n<p style=\"font-weight: 400;\">Einstein called it the 8th wonder of the world and said those that understand it, earn it, those who don’t, pay it. Compound interest is probably the most important wealth building tool one can use. The basic concept is simple, the interest you earn on your money also earns interest and so on forever as long as you do not withdraw it. Warren Buffett has talked a lot about compounding over the years and much of his investment success is due to this mathematical wonder. The good news is that it is not hard for us non-Einstein types to harness. Basically it involves letting your investments continue to grow and snowball on themselves over time. If you have $100 invested and make $5, you now have $105. Instead of removing the $5, if one keeps it invested it also earns interest, which makes the next interest earning greater. This can have a profound effect on your investments over decades.<\/p>\n<p style=\"font-weight: 400;\"><strong>Interest paid on debt<\/strong><\/p>\n<p style=\"font-weight: 400;\">The opposite of compound interest in your favor is interest paid on debt. This is probably the number one wealth killer and destroyer. As a Money Viking, you must fight back against these wealth destroyers and enslavers.<\/p>\n<ol>\n<li style=\"font-weight: 400;\"><strong> A simple budget (Addition and Subtraction)<\/strong><\/li>\n<\/ol>\n<p style=\"font-weight: 400;\">I am not a detailed excel spreadsheet guy when it comes to my budget or investments. I do like spreadsheets, and I like Excel. And I like budgets, but I opt for a simple, straightforward list with no bells and whistles. It takes a few minutes to prepare and manage. It is a list of income on top followed by a listing of all expenses, starting with the largest one (the mortgage) down to the smallest (subscription services). I also include all automatic withdrawals into assets and investment accounts. $50 to Vanguard, $500 to 401k, etc. The final step is that I highlight the items that are going into assets and then keep unhighlighted the expenses that are going into liabilities.<\/p>\n<p style=\"font-weight: 400;\">Budgets, at the end of the day, are simple addition and subtraction. But most people fail to even make a simple budget. It can be an eye opening exercise and will tell you where your money is going. My goal is to maximize outflow into assets, such as investments and real estate, and minimize outflow going into liabilities such as cars, gas, utilities, food, etc.<\/p>\n<h2 style=\"font-weight: 400;\"><strong>Your time vs. the cost of things<\/strong><\/h2>\n<p style=\"font-weight: 400;\">A simple math trick I like to use that helps me resist overspending temptation is asking myself one simple question before the purchase: How long will it take me to earn the money to pay for this _______________? It can be anything: a bottle of wine, a meal, a shirt, a toy, groceries, a trip, etc. If you think this way, you will tie the time you spend at work to your spending, and will probably not make certain purchases. You may calculate that it is simply not worth it.<\/p>\n<h2 style=\"font-weight: 400;\"><strong>Risk vs. return<\/strong><\/h2>\n<p style=\"font-weight: 400;\">In general, folks will want to understand that when an investment is paying a high percentage, it is generally more risky. Are you willing to take the risk? Maybe, maybe not. It depends. Bitcoin, Ethereum, and Ripple are examples of high risk investments. Some people made a bunch of money and others lost a lot. They are high risk, with the potential for high return. Then there is cash, on the other extreme. Low risk and low reward. In fact the reward is so low, that your cash pile will lose value over time because of inflation. Inflation will eat away at the buying power of your cash. Let&#8217;s say someone sold their house for $40k 30 years ago and then placed the $40k in a nice safe savings account. 30 years later perhaps they wanted to buy a house. Well, houses now sell for $400k. The $40k is still there, nice and safe, but it does not buy as much of anything.<\/p>\n<p style=\"font-weight: 400;\">Somewhere in the middle of this spectrum are blue chip dividend paying stocks, low cost Vanguard index funds or bonds. These investments will go up and down, but over time they will probably go up 5-10% a year over many years, on average. That beats inflation currently.<\/p>\n<h2 style=\"font-weight: 400;\"><strong>The cost of things over time<\/strong><\/h2>\n<p style=\"font-weight: 400;\">A little math trick I like to do is to average out the cost of ownership of certain things over long periods of time. For example, I purchased my used Honda Accord for $16k. I have owned the car for 10 years now. Therefore I have spent $1,600 a year for my car. Not bad. I hope to do better, but not bad in the grand scheme of things. If I had spent some crazy amount like $40,000 on a &#8220;luxury&#8221; car and then paid interest on top of that, I would have paid close to $5,000 a year for the car. That is a huge difference from $1,600! This creates an investing opportunity by freeing up $3,400 a year, which, over 10 years and invested could become close to $60,000!<\/p>\n<h2 style=\"font-weight: 400;\"><strong>probabilities<\/strong><\/h2>\n<p style=\"font-weight: 400;\">Probabilities are important to managing our lives. We all know that the basic act of living carries the day to risks. But we know that risks increase the more sugar and hamburgers we eat or if we do drugs or other high risk activities. A basic understanding of probabilities is important to managing our finances.<\/p>\n<p>&nbsp;<\/p>\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_35940\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/xUoo4356clw?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Simple Financial Math At some point during our usually lame financial education path (if one even exists in the U.S.) we start to believe that we are not good at math. I hear this from people all the time (insert sad face). I believe in many cases they did not receive very good math education &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2024\/07\/the-road-to-one-million-dollars-simple-financial-math\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;The Road to One Million Dollars (simple financial math)&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":17936,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16],"tags":[],"class_list":["post-17935","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2024\/07\/pexels-photo-6694575.webp","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17935","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=17935"}],"version-history":[{"count":1,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17935\/revisions"}],"predecessor-version":[{"id":17939,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/17935\/revisions\/17939"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/17936"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=17935"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=17935"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=17935"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}