{"id":8457,"date":"2021-01-15T10:42:03","date_gmt":"2021-01-15T18:42:03","guid":{"rendered":"https:\/\/premium.moneyvikings.com\/get-rich-off-bitcoin-without-buying-a-single-btc\/"},"modified":"2022-03-06T22:46:44","modified_gmt":"2022-03-06T22:46:44","slug":"get-rich-off-bitcoin-without-buying-a-single-btc","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2021\/01\/get-rich-off-bitcoin-without-buying-a-single-btc\/","title":{"rendered":"Get Rich Off Bitcoin Without Buying A Single BTC"},"content":{"rendered":"<ul>\n<li>Bitcoin is a high risk investment, could skyrocket and could crash quickly.<\/li>\n<li>Bitcoin is hard to analyze in terms of intrinsic value and hard to define.<\/li>\n<li>How else can one profit off Bitcoin without actually buying a single coin?<\/li>\n<li>We discuss ARK FinTech, Square, NVDIA, COIN and BLOK ETF.<\/li>\n<\/ul>\n<h2><strong>There are several ways to get rich off of bitcoin<\/strong><\/h2>\n<p>Does Bitcoin seem a bit scary as an investment? or too exotic? too volatile or all the above? You are not alone. The entire crypto universe is full of new technical and non-technical jargon that makes investing confusing at times.<\/p>\n<p>During the most recent Bull run I was steadily adding to my position. But then I started to see it happen again. It shot up to over $41k and then over the course of a weekend started losing $10k in value. Not the way I wanted to spend a weekend! I needed a risk tolerance adjustment. Was I ready to lose $10k-$20k in value over a weekend? This is the kind of volatility any crypto investor needs to be able to stomach.<\/p>\n<p>I do own some modest amounts of crypto that are aligned with the risk profile of my portfolio. I personally keep exposure to about 2% of overall assets. It does appear that crypto assets like Bitcoin, Ethereum, etc. are here to stay in some form or another. In our Money Vikings Premium we analyze Ethereum quite a but due to the growing use cases. Years ago when Jerry first introduced me to crypto, my first question was what human problem does it solve? And how does it add value?<\/p>\n<p>But what if there was a way to get rich off Bitcoin without ever owning one coin, or a fraction of a coin? You can make money off of bitcoin without actually owning it. The smart way to do so would be to buy businesses that directly benefit from the bitcoin craze, no matter how well or poorly bitcoin actually does. In addition, these same businesses would still be around and doing very well if Bitcoin had never been invented. Here are three ways bitcoin can make you rich without the stomach churning volatility.<\/p>\n<h2><strong>Trading fuels the boom!<\/strong><\/h2>\n<p>While a person could buy Bitcoin and watch it go up or down, the no-brainer way to take advantage of increased trading is through digital payment companies like <strong>PayPal<\/strong> or <strong>Square.<\/strong><\/p>\n<p>Square&#8217;s Cash App has seen its monthly active user count is up over 30 million between the end of 2017 and mid-2020. Though Cash App has seen greater adoption for everyday purchases and bank transfers, investing and bitcoin exchange are predominantly sending Square&#8217;s revenue through the roof. In fact, to support Square&#8217;s role as a bitcoin exchange intermediary, the company acquired $50 million worth of bitcoin in October. This works out to about 1% of the company&#8217;s assets.<\/p>\n<h2><strong>SEE RELATED: <a href=\"https:\/\/themoneyvikings.net\/2020\/11\/08\/the-money-vikings-podcast-17-how-to-be-a-middle-class-millionaire-and-a-discussion-on-square-sq\/\" target=\"_blank\" rel=\"noopener\">TMV Podcast, Square Analysis<\/a><\/strong><\/h2>\n<p><a href=\"https:\/\/themoneyvikings.net\/2021\/01\/02\/cashapp-vs-robinhood-which-one-is-better\/\" target=\"_blank\" rel=\"noopener\">CashApp vs. Robinhood<\/a><\/p>\n<h2><strong>ARK FINTECH<\/strong><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-8410 aligncenter\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2019\/03\/ASKinvest-300x180.png\" alt=\"\" width=\"300\" height=\"180\"><\/h2>\n<p>I am a big fan of the Ark Exchange Traded Funds. There are many of them with different focal areas, but one that could benefit from Bitcoin is the Ark FinTech ETF.<\/p>\n<h2><strong><span class=\"s2\">Ark Investing ETF&#8217;s (ARKK)<\/span><\/strong><\/h2>\n<p><strong>PERFORMANCE: 5 year &#8211; 83%<\/strong><\/p>\n<p>If you read our blog or listen to The Money Vikings Podcast we are regularly analyzing Ark investing. I really enjoy listening to Cathie Wood and her approach to investing. She and her team are looking out to the future and investing in innovative spaces in many industries. There are several Ark ETF&#8217;s, each with a particular focal area.<\/p>\n<p><strong>Here is a description of one of our favorites, Ark Innovation:<\/strong><\/p>\n<blockquote><p>ARK defines ‘‘disruptive innovation’’ as the introduction of a technologically enabled new product or service that potentially changes the way the world works.<\/p>\n<p>Companies within ARKK include those that rely on or benefit from the development of new products or services, technological improvements and advancements in scientific research relating to the areas of DNA technologies (‘‘Genomic Revolution”), industrial innovation in energy, automation and manufacturing (‘‘Industrial Innovation’’), the increased use of shared technology, infrastructure and services (‘‘Next Generation Internet’), and technologies that make financial services more efficient (‘‘Fintech Innovation’’).<\/p>\n<p>ARKK is an actively managed ETF that seeks long-term growth of capital by investing under normal circumstances primarily (at least 65% of its assets) in domestic and foreign equity securities of companies that are relevant to the Fund’s investment theme of disruptive innovation.<\/p><\/blockquote>\n<p>When a person invests in this fund, they are gaining exposure to Tesla, Square, CRISPR, Zillow, Spotify to name a few&#8230;<\/p>\n<h2><strong>ARK Fin Tech holdings<\/strong><\/h2>\n<table class=\"table\">\n<thead>\n<tr>\n<th class=\"colTxtMed\">Symbol<\/th>\n<th>Name<\/th>\n<th class=\"text-right\">% Weight<\/th>\n<th class=\"colTxtShort text-right\">Price<\/th>\n<th class=\"colTxtShort text-right\">% Change<\/th>\n<\/tr>\n<\/thead>\n<tbody>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/SQ\" target=\"_blank\" rel=\"noopener\">SQ<\/a><\/td>\n<td>Square Inc<\/td>\n<td class=\"text-right\">10.71%<\/td>\n<td class=\"text-right\">268.01<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">2.24%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/SHOP.TO\" target=\"_blank\" rel=\"noopener\">SHOP.TO<\/a><\/td>\n<td>Shopify Inc<\/td>\n<td class=\"text-right\">6.55%<\/td>\n<td class=\"text-right\">1934.14<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">0.71%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/Z\" target=\"_blank\" rel=\"noopener\">Z<\/a><\/td>\n<td>Zillow Group Inc<\/td>\n<td class=\"text-right\">5.09%<\/td>\n<td class=\"text-right\">99.24<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">1.59%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/SE\" target=\"_blank\" rel=\"noopener\">SE<\/a><\/td>\n<td>Sea Ltd<\/td>\n<td class=\"text-right\">5.00%<\/td>\n<td class=\"text-right\">321.03<\/td>\n<td class=\"text-right\"><strong class=\"text-red\">-0.23%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/COIN\" target=\"_blank\" rel=\"noopener\">COIN<\/a><\/td>\n<td>Coinbase Global Inc<\/td>\n<td class=\"text-right\">4.98%<\/td>\n<td class=\"text-right\">259.12<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">4.26%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/MELI\" target=\"_blank\" rel=\"noopener\">MELI<\/a><\/td>\n<td>MercadoLibre Inc<\/td>\n<td class=\"text-right\">4.63%<\/td>\n<td class=\"text-right\">1865.00<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">1.60%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/PYPL\" target=\"_blank\" rel=\"noopener\">PYPL<\/a><\/td>\n<td>PayPal Holdings Inc<\/td>\n<td class=\"text-right\">4.54%<\/td>\n<td class=\"text-right\">278.33<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">1.72%<\/strong><\/td>\n<\/tr>\n<tr>\n<td>ADYEN<\/td>\n<td>Adyen NV<\/td>\n<td class=\"text-right\">4.22%<\/td>\n<td class=\"text-right\">&#8212;<\/td>\n<td class=\"text-right\"><strong class=\"\">&#8212;<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/TWLO\" target=\"_blank\" rel=\"noopener\">TWLO<\/a><\/td>\n<td>Twilio Inc<\/td>\n<td class=\"text-right\">3.62%<\/td>\n<td class=\"text-right\">361.25<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">2.01%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/PATH\" target=\"_blank\" rel=\"noopener\">PATH<\/a><\/td>\n<td>UiPath Inc<\/td>\n<td class=\"text-right\">2.90%<\/td>\n<td class=\"text-right\">64.97<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">1.75%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/OPEN\" target=\"_blank\" rel=\"noopener\">OPEN<\/a><\/td>\n<td>Opendoor Technologies Inc<\/td>\n<td class=\"text-right\">2.85%<\/td>\n<td class=\"text-right\">17.33<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">3.71%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/FB\" target=\"_blank\" rel=\"noopener\">FB<\/a><\/td>\n<td>Facebook Inc<\/td>\n<td class=\"text-right\">2.70%<\/td>\n<td class=\"text-right\">372.63<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">2.26%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/DOCU\" target=\"_blank\" rel=\"noopener\">DOCU<\/a><\/td>\n<td>DocuSign Inc<\/td>\n<td class=\"text-right\">2.67%<\/td>\n<td class=\"text-right\">300.76<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">1.90%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/PINS\" target=\"_blank\" rel=\"noopener\">PINS<\/a><\/td>\n<td>Pinterest Inc<\/td>\n<td class=\"text-right\">2.66%<\/td>\n<td class=\"text-right\">57.22<\/td>\n<td class=\"text-right\"><strong class=\"text-red\">-0.03%<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/TDOC\" target=\"_blank\" rel=\"noopener\">TDOC<\/a><\/td>\n<td>Teladoc Health Inc<\/td>\n<td class=\"text-right\">2.51%<\/td>\n<td class=\"text-right\">142.83<\/td>\n<td class=\"text-right\"><strong class=\"text-green\">0.90%<\/strong><\/td>\n<\/tr>\n<tr>\n<td>4689<\/td>\n<td>Z Holdings Corp<\/td>\n<td class=\"text-right\">2.41%<\/td>\n<td class=\"text-right\">&#8212;<\/td>\n<td class=\"text-right\"><strong class=\"\">&#8212;<\/strong><\/td>\n<\/tr>\n<tr>\n<td><a href=\"https:\/\/ycharts.com\/companies\/JD\" target=\"_blank\" rel=\"noopener\">JD<\/a><\/td>\n<td>JD.com Inc<\/td>\n<td class=\"text-right\">2.20%<\/td>\n<td class=\"text-right\">76.43<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<table id=\"top10h\" class=\"tbl_top10holdings\">\n<tbody>\n<tr>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<td><\/td>\n<td align=\"right\"><\/td>\n<td align=\"right\"><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h2><strong>Did the Pandemic Change Things?<\/strong><\/h2>\n<p>For me personally the pandemic changed my view on Bitcoin as a premier and efficient store of value, in other words digital gold. Central banks and governments had no good option but to print and send more money. Otherwise we would have seen human pain and suffering that the modern world is not familiar with. But with this comes inflation and the devaluation of the dollar. Bitcoin sure seems like a hedge against this. Only time will tell if it all holds true. You can read every imaginable opinion about Bitcoin on the internet. We are taking a middle of the road approach, investing cautiously.<\/p>\n<h2><strong>Bitcoin Bull Run<\/strong><\/h2>\n<p>Most recently Bitcoin seems to have broken through some kind of psychological resistance to $40,000\/coin. I recall when it was under $1,000 and I would ask, why would anyone pay a thousand for this line of code? Wow, hindsight! Here is our take on Bitcoin and crypto in general from investors\/traders that have owned the coin for years.<\/p>\n<ul>\n<li>Bitcoin seems to defy the common logic of assets and currencies. It is and isn’t an investment, asset, currency, etc. It could be a store of value, a new technology expression and a new way of trading value.<\/li>\n<li>Bitcoin is in the eye of the beholder. It is worth what the whole network of trades believe it is worth.<\/li>\n<li>There may be winners and losers, like a pyramid scheme. So keep an eye out for how the traditional fiat money is transferred via blockchain.<\/li>\n<li>Major institutions are taking positions and anyone can access Bitcoin via the CashApp. (<strong>SEE RELATED:<\/strong> <a href=\"https:\/\/themoneyvikings.net\/2019\/10\/24\/cashapp-vs-robinhood-which-one-is-better\/\" target=\"_blank\" rel=\"noopener\">Robinhood Vs. CashApp<\/a>)<\/li>\n<li>One big draw of Bitcoin is that it is not manipulated by Governments. It is like the currency of the people of the world that believe in it and use it. in other words, there is a finite supply and more cannot be printed. Only 21 million can be “mined” and about 85% is already in circulation.<\/li>\n<li>But can it be manipulated by “whales” or foreign government actors? The lack of transparency makes this hard to predict.<\/li>\n<li>A historical example of perceived value was the great Tulip bulb craze of the 1600’s. At the peak of the mania, one Tulip (Hopefully quite perfect) sold for about the price of a house. This means that Bitcoin may have further to go. Perhaps I can pay off my mortgage with it someday. But a key difference is that in theory Bitcoin could be a store of value, whereas the Tulip was a thing of nature that eventually wilts away. On the other hand, bitcoin is simply lines of code in the blockchain.<\/li>\n<li>Bitcoin challenges our traditional beliefs of money and investing. What are any of our assets besides lines of code to us. The only tangible asset I own is real estate which I can actually touch and feel in the material world. Deep thoughts!<\/li>\n<\/ul>\n<h2><strong>More Companies to Consider<\/strong><\/h2>\n<p>Coinbase is a popular platform for buying and selling crypto. They plan to go IPO soon. They make money no matter what the value of Bitcoin is because they charge for each transaction. NVIDIA sells the processors that fuel Bitcoin mining operations, etc.<\/p>\n<p>Crypt miners are responsible for validating transactions that have been executed over a blockchain network. By &#8220;validating,&#8221; they ensure that a transaction is accurate and true. For bitcoin, cryptocurrency miners use high-powered computers to solve mathematical equations that correlate to a block (a group of transactions). If a business entity is the first to solve and verify a block of transactions, they&#8217;re given a block reward, which, as of today, amounts to 6.25 bitcoin tokens (about $216,000). High-powered GPUs make all this happen.<\/p>\n<p>At the center of GPU processing is graphics card powerhouse <strong>NVIDIA<\/strong>. NVIDIA generates the bulk of its sales from the gaming industry and data centers. However, at least $175 million of NVIDIA&#8217;s $2.27 billion in gaming revenue during the third quarter came from selling GPUs to crypto miners. Keep in mind that bitcoin isn&#8217;t the only cryptocurrency that validates via the proof-of-work model. Ethereum, lumens, etc.<\/p>\n<h2><strong>CEO of MicroStrategy Saylor sums it up:<\/strong><\/h2>\n<blockquote><p>“We find the global acceptance, brand recognition, ecosystem vitality, network dominance, architectural resilience, technical utility, and community ethos of bitcoin to be persuasive evidence of its superiority as an asset class for those seeking a long-term store of value,” Saylor said. “Bitcoin is digital gold — harder, stronger, faster, and smarter than any money that has preceded it.”<\/p><\/blockquote>\n<h2><strong>Dabbling but not going crazy<\/strong><\/h2>\n<p>Our personal approach to crypto is to dabble but not lose our minds. Yes, this means holding some Bitcoin and alt coins as speculation. There is really no other use for them at the moment. With the exception of the CashApp, which to me has made Bitcoin a bit more useable. My personal rule of thumb is to hold some Bitcoin, but limit to 1-2% of total assets.<\/p>\n<h2><strong>Free Lunch?<\/strong><\/h2>\n<p>I have been playing a little game to get free meals using Bitcoin and CashApp. So I buy some Bitcoin on CashApp. Watch it go up and take the profits. It makes me like $30 so I can go buy my family lunch or dinner. Then I use a CashApp boost as well for a little extra savings. Those dinners and lunches taste so much better knowing that they came from Bitcoin profits, Buon appetite!<\/p>\n<p>Ok, I know that is silly, but just trying to give a sense of how I am using crypto at this point. In other words, yes, we are using and investing in it. But we are not going to dump hundreds of thousands in.<\/p>\n<h2><strong>Early Dot Com era?<\/strong><\/h2>\n<p>Here is our take on crypto currencies.  I read somone comparing this time in history to the early dot com era.  There were hundreds of dot com companies in the early days that had no chance of surviving.  But as capitalist natural selection took its course, only the strong survived, creating major value to shareholders and society at large.<\/p>\n<p>I think this a good analogy for the current crypto period.  Some of these currencies may actually solve real world problems and create efficiencies we could only dream of before.  These currencies are ushering new constructs such as smart contracts and changing the way money is moved around an increasingly globalized world and economy.  An economy that also demands more and more efficiency and speed to pull as much value out of each transaction.  I personally think there is great potential value in under developed economies with a lack of banking infrasrtucture but everyone is walking around with a powerful computer (smart phone) in their hands.<\/p>\n<h2><strong>Cathie Wood of Ark, she could see Bitcoin hit $500,000<\/strong><\/h2>\n<p>If you own any shares of Ark Investments ARK Next Generation Internet (ARKW), then you already have exposure to Bitcoin.<\/p>\n<p>Many readers of Money Vikings know that we are big fans of Cathie Wood over at Ark exchange traded funds. She is long term bullish on Bitcoin for several reasons. She was previously famous for saying Tesla would skyrocket in value. The main stream media was skeptical, but she ended up being correct if you factor in the stock split. She sees several use cases for Bitcoin. Here is a synopsis from a Barron’s article on her point of view<\/p>\n<blockquote>\n<h3><em>Some investors, she said, see Bitcoin as a digital alternative to gold or an insurance policy against inflation. With the Federal Reserve’s decision to keep interest rates low for the foreseeable future, that’s one reason Bitcoin’s price could be rising. And if institutional investors like hedge funds were to take a greater interest in Bitcoin, it could send prices even higher, Wood said. What’s more, Wood noted the supply of Bitcoin units tops out at 21 million. There are about 18.5 million currently in existence, she said.<\/em><\/h3>\n<h3><em>Wood said institutions have been bumping up their exposure to the cryptocurrency recently, drawing a comparison to “the early days of institutions moving into real estate and emerging markets,” when allocations started small, then grew.<\/em><\/h3>\n<\/blockquote>\n<h2><strong>Tulip bulbs and bubble mentality<\/strong><\/h2>\n<p>Many financial experts say Bitcoin is worthless and right up there with the notorious Tulip bulbs craze in old holland. For those that do not know, one of the most famous real life examples of a “bubble” was the great tulip bulb craze in holland in the 1630’s. On the open market for tulips, one tulip actually sold for like 6 cows, a house and a bunch of gold, until it all came crashing down and then tulips were worth $2 again.<\/p>\n<blockquote><p>“Many individuals grew suddenly rich. A golden bait hung temptingly out before the people, and, one after the other, they rushed to the tulip marts, like flies around a honey-pot. Every one imagined that the passion for tulips would last for ever, and that the wealthy from every part of the world would send to Holland, and pay whatever prices were asked for them. The riches of Europe would be concentrated on the shores of the Zuyder Zee, and poverty banished from the favoured clime of Holland. Nobles, citizens, farmers, mechanics, seamen, footmen, maidservants, even chimney sweeps and old clotheswomen, dabbled in tulips”<\/p><\/blockquote>\n<p>Sound familiar? Like any bubble craze, everyone is rushing in to get a piece of the action. Then it all came crashing down. It can be hard to resist putting $1,000 into Coinbase, and the following week it says it’s worth $1,600! On the other hand, it will be really depressing to put $50,000 into cryptocurrency and then the following week it is worth $3,000!<\/p>\n<p>A big difference is that Bitcoin does apparently solve a problem, whereas a tulip is simply a beautiful flower that eventually wilts. Bitcoin could push back against inflation as a store of value and could be used in cross border transactions in an increasingly digitized world. Tulips could never do these things.<\/p>\n<h2><strong>COIN<\/strong><\/h2>\n<p>Coinbase is the next addition to this theme. If you do not want o actually own any crypto, but would like to have exposure to the growth of the ecosystem, than look no further than Coinbase. The Coinbase exchange easily allows anyone to own and trade crypto assets. See, we are call them &#8220;assets&#8221; now, so they have clearly entrenched into the mainstream. COIN is also part of the ARK Fintech portfolio and is a top holding.<\/p>\n<h2><strong>(BLOK) Amplify transformational data sharing etf<\/strong><\/h2>\n<p>This is now the largest ETF focused on cryptocurrencies and companies that use or develop blockchain technologies. I am a big fan of ETF&#8217;s for their diversification, sector focus and typically low management fees.<\/p>\n<h2><strong>How will this evolve?<\/strong><\/h2>\n<p>I have no idea how this will all evolve or end.  But, there may be some technologies and concepts that create great value over time.  Just be careful out there! Several times these coins have plummeted in value in a matter of hours and days. That is not a stable store of value.<\/p>\n<p>Perhaps Bitcoin will or has established itself as the digital gold. An “asset” with a finite supply that is difficult to replicate. As opposed to fiat currencies that can be printed and manipulated by Governments and large institutions<\/p>\n<h2><strong>Many Ways<\/strong><\/h2>\n<p>As we say many times, there are many ways to invest and make your money work for you. There are also multiple ways to invest in the crypto currency space without actually owning a single Bitcoin or Ethereum, etc.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Bitcoin is a high risk investment, could skyrocket and could crash quickly. Bitcoin is hard to analyze in terms of intrinsic value and hard to define. How else can one profit off Bitcoin without actually buying a single coin? We discuss ARK FinTech, Square, NVDIA, COIN and BLOK ETF. There are several ways to get &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2021\/01\/get-rich-off-bitcoin-without-buying-a-single-btc\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Get Rich Off Bitcoin Without Buying A Single BTC&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":2,"featured_media":10491,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[12],"tags":[],"class_list":["post-8457","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-free"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/01\/pexels-moose-photos-1037915.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/8457","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=8457"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/8457\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/10491"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=8457"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=8457"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=8457"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}