{"id":10945,"date":"2023-01-08T16:57:00","date_gmt":"2023-01-09T00:57:00","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=10945"},"modified":"2023-02-26T13:33:55","modified_gmt":"2023-02-26T21:33:55","slug":"happy-birthday-warren-buffett","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/01\/happy-birthday-warren-buffett\/","title":{"rendered":"Happy Birthday Warren Buffett! &#8211; How to be a Great Investor &#038; Person"},"content":{"rendered":"\r\n<p><script async src=\"https:\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-8967296254408696\"\r\n     crossorigin=\"anonymous\"><\/script><\/p>\r\n\r\n<ul>\r\n<li style=\"text-align: left;\">BRK-B is stil an attractive long term buy, hold and grow.<\/li>\r\n<li style=\"text-align: left;\">I view this as an &#8220;all weather&#8221; holding that can preserve capital and grow over time.<\/li>\r\n<li style=\"text-align: left;\">Like owning a large slice of the US economy with a value angle. I am adding positions on slight dips.BRK<\/li>\r\n<li style=\"text-align: left;\">BRK is safe way to outperform the S&amp;P over the next 10 years.<\/li>\r\n<li style=\"text-align: left;\">BRK provides amazing diversification and defensive positions, one of the best &#8220;Blue Chips&#8221; around.<\/li>\r\n<\/ul>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">The Oracle of Omaha turns 91 today, Happy Birthday to a great America! I enjoy learning about <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">Warren Buffett and emulating some of his success. He is an American icon. I also like owning a small slice of<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> his vast holding company <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">Berkshire Hathaway and the corresponding stock BRK-B.<\/span><\/span><\/p>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">If I was to hold one stock beyond an S&amp;P 500 Index fund ETF, it would be Berkshire. I do not study Warren Buffett because I could ever be a great stock picker (none of us should get too fancy pants in this area), but because reading about his habits can help me become a better investor, business person and human. Here are some of the main investing tips I have learned from Warren Buffett:<\/span><\/span><\/p>\r\n<ul style=\"text-align: left;\">\r\n<li><strong>Invest early and often in low cost index funds that are balanced to meet my specific goals and risk tolerance.<\/strong><\/li>\r\n<li><strong>When good quality company stocks or the broader market goes on &#8220;sale&#8221; or down in value, think of this as a good thing and buy some. When something I want goes on sale I want to buy it at that point! Harness the power of dollar cost averaging.<\/strong><\/li>\r\n<li><strong>Have a clear, simple strategy for building wealth over time. No short term gimmicks or get rich quick, just good old fashioned building of wealth one brick at a time.<\/strong><\/li>\r\n<li><strong>Understand and harness the power of compounding by investing early, often and letting dividends reinvest and ride.<\/strong><\/li>\r\n<li><strong>Have long term faith in America, yes we always face some kind of challenge, but it is still the best system in the world and we are always working to make it better. Good solid American companies and the American people have a bright future for a long time to come. We still have the secret sauce of strong institutions, free markets, law, property rights and a culture of innovation and can do spirit&#8230;<\/strong><\/li>\r\n<li><strong>Don&#8217;t try to beat the market or wall street.<\/strong><\/li>\r\n<\/ul>\r\n<p style=\"text-align: left;\">Who is the man?<\/p>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Berkshire the company is like an amazing collection of over 60 awesome American companies. <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">I admire the man himself for his morals, intellect and values. <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">I find him to be a role model in terms of living a good <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">and fulfilling <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">life. <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">He values integrity, family, moral <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">judgment<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> and strategic business investments. He loves numbers and math. He also <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">loves<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> a Dairy Queen Blizzard and burger! <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">His investing wisdom seems to me to go beyond investing itself. Here are some of his great quotes full of wisdom we could all learn from:<\/span><\/span><\/p>\r\n<blockquote>\r\n<p style=\"text-align: left;\"><span class=\"s3\"><span class=\"bumpedFont15\">“Someone is sitting in the shade today because someone planted a tree a long time ago.”<\/span><\/span><\/p>\r\n<p class=\"s5\" style=\"text-align: left;\"><span class=\"s4\"><span class=\"bumpedFont15\">“<\/span><\/span><span class=\"s4\"><span class=\"bumpedFont15\">We select such investments on a long-term basis, weighing the same factors as would be involved in the purchase of 100% of an operating business:<\/span><\/span><\/p>\r\n<p class=\"s6\" style=\"text-align: left;\"><span class=\"s3\"><span class=\"bumpedFont15\">(1) favorable long-term economic characteristics;<\/span><\/span><span class=\"s3\"><span class=\"bumpedFont15\"><br \/><\/span><\/span><span class=\"s3\"><span class=\"bumpedFont15\">(2) competent and honest management;<\/span><\/span><span class=\"s3\"><span class=\"bumpedFont15\"><br \/><\/span><\/span><span class=\"s3\"><span class=\"bumpedFont15\">(3) purchase price attractive when measured against the yardstick of value to a private owner; and<\/span><\/span><span class=\"s3\"><span class=\"bumpedFont15\"><br \/><\/span><\/span><span class=\"s3\"><span class=\"bumpedFont15\">(4) an industry with which we are familiar and whose long-term business characteristics we feel competent to judge.”<\/span><\/span><\/p>\r\n<p class=\"s6\" style=\"text-align: left;\"><span class=\"s3\"><span class=\"bumpedFont15\">&#8220;There comes a time when you ought to start doing what you want. Take a job that you love. You will jump out of bed in the morning. I think you are out of your mind if you keep taking jobs that you don’t like because you think it will look good on your resume. Isn’t that a little like saving up sex for your old age?”<\/span><\/span><\/p>\r\n<p style=\"text-align: left;\"><span class=\"s3\"><span class=\"bumpedFont15\">&#8220;Chains of habit are too light to be felt until they are too heavy to be broken.”<\/span><\/span><\/p>\r\n<p style=\"text-align: left;\"><span class=\"s3\"><span class=\"bumpedFont15\">&#8220;Imagine that you had a car and that was the only car you’d have for your entire lifetime. Of course, you’d care for it well, changing the oil more frequently than necessary, driving carefully, etc. Now, consider that you only have one mind and one body. Prepare them for life, care for them. You can enhance your mind over time. A person’s main asset is themselves, so preserve and enhance yourself.”<\/span><\/span><\/p>\r\n<\/blockquote>\r\n<h2 style=\"text-align: left;\">Warren Buffett &#8211; BRK-B<\/h2>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">I admire the company <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">(BRK-<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">B) <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">and the stock for how it adds value to my personal wealth and assets. Sure, it may not return the stellar returns we have seen forever, but it is still a strong collection of assets that will return value over the long run. As we discuss here at The Money Vikings, in order to build wealth, one will need to generally acquire assets and reduce <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">liabilities. In terms of acquiring assets, one of the best asset classes over the years has been investing consistently in high quality stocks as part of a diversified index fund. There are many ways to do this through Vanguard or others. Another way we enjoy is by following the lead of Berkshire and buying either class B shares or shares of some of the companies Berkshire is heavily invested in.<\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">AN INVESTMENT GIANT WE CAN ALL OWN<\/span><\/span><\/h2>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Mr. Buffett <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">has built Berkshire Hathaway into a very powerful giant in ter<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">ms of investment value. There are class B shares, <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">class B are the <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">“<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">middle class<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">”<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> accessible shares, the class A shares sell for about $318,000\/share, as oppose<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">d to class B that sell for about $212\/share.<\/span><\/span> <span class=\"s2\"><span class=\"bumpedFont15\">Owning class B shares <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">is like owning a small slice of some of the most powerful American companies<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> and the strong American economy<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">,<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> adding value and selling products around the world. The company is comprised of a diversified portfolio of over 60 subsidiaries. It includes insurance operations, furniture, energy, BNSF railroad, GEICO (Government Executive Insurance Company), Fruit of the Loom, Dairy Queen, etc. etc. The company holds massive stakes in Coca-Cola, Wells Fargo and Apple just to name a few.<\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">A FOREVER STOCK FOR WARREN BUFFETT?<\/span><\/span><\/h2>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">For me personally, BRK-B (Berkshire Class B) shares are a buy and hold forever stock (or at least a very long time). Even when Warren Buffett passes onto the next life, I believe Berkshire will have a prosperous future. Large shareholders and institutions will insist on BRK staying true to core values that have stood the test of time. It is like owning a well maintained and managed mutual fund that gives investors a slice of some of the greatest companies ever. These are companies that will continue to develop new and innovative products, drive efficiencies and add value to customers and investors. As long as future Berkshire management sticks to Mr. Buffett’s conservative value based approach to investing, the company will do just fine.<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> The 21% annualized returns that Berkshire has enjoyed on average since the 1960’s may not be as high forever, but hey I would be satisfied with a third of that return year in and year out.<\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\">HIGHLIGHTS FROM THE ANNUAL LETTER<\/h2>\r\n<p style=\"text-align: left;\">Warren Buffett is famous for his annual letter to shareholders and really the world of investors. It is a down to earth folksy explanation of all things investing and what is on his mind. I absolutely love it and really makes investing make sense. This is opposite the talking heads screaming at each other on the nightly business and economic roundup shows.<\/p>\r\n<p style=\"text-align: left;\">Here are some early highlights from past letters to shareholders:<\/p>\r\n<ul style=\"text-align: left;\">\r\n<li><strong>High fees! Once again he warns that many Americans are being fleeced by high fees by &#8220;financial professionals.&#8221; In other words, they are taking our profits for adding very little value. In fact he made a bet that a low cost index fund just sitting for 10 years would beat the most fancy pants &#8220;financial helpers.&#8221;<\/strong><\/li>\r\n<\/ul>\r\n<p style=\"text-align: left;\"><em>I did a brief stint in the financial industry right after college, and quite frankly I could sense it. Nothing against the finance profession, but the fees are too high and they are &#8220;taking&#8221; money that should go back to the investors. Remember you are working for your money, not anyone else.<\/em><\/p>\r\n<ul style=\"text-align: left;\">\r\n<li>Warren Buffett says &#8220;performance comes and performance goes, but fees never falter.&#8221;<\/li>\r\n<li>He talks about the risks inherent in bonds. He says if one has a long term investing horizon, high grade bonds can increase risk.<\/li>\r\n<li><strong>Berkshire stockpile of cash is at a huge $116 BILLION. He talks about using the cash for acquisitions, highlighting a necessary component of a &#8220;sensible purchase price.&#8221;<\/strong><\/li>\r\n<li><strong>He mentions that the Berkshire stock has dropped before and could again. Debt free investors can take advantage of these dips.<\/strong><\/li>\r\n<\/ul>\r\n<p style=\"text-align: left;\">A few highlights to remember from 2016:<\/p>\r\n<ul style=\"text-align: left;\">\r\n<li>He clarified his stance on holding investments forever, he basically says we have every right to sell investments if it is time. But he still likes to hold for a VERY long time.<\/li>\r\n<li>He did not mention much about Apple although it was one of the largest Berkshire buys in 2017, owning about 61 million shares or 1.1% of the company.<\/li>\r\n<li>From Warren Buffett on the Vanguard Group founder Jack Bogle, a statue should be erected of him for what he did for the average investor in America.<\/li>\r\n<\/ul>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Here are a few of the companies that Berkshire is heavily invested in and owns significant stakes. This simply serves a sampling of the types of strong companies in various industries, which makes BRK-B an attractive long term investment:<\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">1. AAPL &#8211; Apple<\/span><\/span><\/h2>\r\n<figure id=\"attachment_15019\" aria-describedby=\"caption-attachment-15019\" style=\"width: 300px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-15019 size-medium\" src=\"http:\/\/198.199.80.40\/wp-content\/uploads\/2023\/02\/an_vision-gdpaddy6_we-unsplash-scaled.jpeg\" alt=\"warren buffett\" width=\"300\" height=\"300\" \/><figcaption id=\"caption-attachment-15019\" class=\"wp-caption-text\">Warren Buffett likes Apple<\/figcaption><\/figure>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Apple is America’s first company to reach a <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">TRILLION dollar<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> market cap! Apple products have and continue to fundamentally change the way we interact with the world, create, engage, communicate and on and on…<\/span><\/span><\/p>\r\n<p class=\"s5\" style=\"text-align: left;\"><span class=\"s7\"><span class=\"bumpedFont15\">The introduction of 5G technology will again make these amazing machines we hold in our hands that much faster and responsive, which is hard to imagine. What’s next? They read our minds? Probably!<\/span><\/span><\/p>\r\n<p class=\"s9\" style=\"text-align: left;\"><span class=\"s8\"><span class=\"bumpedFont15\">5G The Internet of Things (<\/span><\/span><span class=\"s8\"><span class=\"bumpedFont15\">IoT<\/span><\/span><span class=\"s8\"><span class=\"bumpedFont15\">)<\/span><\/span><\/p>\r\n<p class=\"s9\" style=\"text-align: left;\"><span class=\"s10\"><span class=\"bumpedFont15\">IoT<\/span><\/span><span class=\"s10\"><span class=\"bumpedFont15\"> refers to the now and future concept that all things will be connected via the <\/span><\/span><span class=\"s10\"><span class=\"bumpedFont15\">internet<\/span><\/span><span class=\"s10\"><span class=\"bumpedFont15\"> and smart technologies. Everything from toasters to cars will be connected and constantly communicating and upgrading via improved software for improved performance and sensing. We now have the introduction of motion sensors, smart speakers and electronic weigh scales, thermostats and thermometers. In the next 10 years, we will see the number of <\/span><\/span><span class=\"s10\"><span class=\"bumpedFont15\">IoT<\/span><\/span><span class=\"s10\"><span class=\"bumpedFont15\"> devices grow, which theoretically will result in greater safety, security and health. The I Phone and other Apple products intend to play a key role in this future.<\/span><\/span><\/p>\r\n<p class=\"s5\" style=\"text-align: left;\"><span class=\"s7\"><span class=\"bumpedFont15\">The larger screen sizes should support future growth and multiple services Apple can deliver via these powerful communications tools.<\/span><\/span><\/p>\r\n<p class=\"s5\" style=\"text-align: left;\"><span class=\"s7\"><span class=\"bumpedFont15\">Apple has tremendous amounts of cash flow and a large cash stash give Apple management so much flexibility to invest in new technologies.<\/span><\/span><\/p>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">$2.92\/share, 1.35% yield, Price to Earnings: 19.23<\/span><\/span><\/p>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Warren Buffett’s most valuable stake at the moment in Berkshire Hathaway is Apple. The shares trade for about $215\/share. They bounced around for years between $70-$120…<\/span><\/span><\/p>\r\n<p style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">Apple is becoming more of a luxury brand than a technology company. Not all are rosy about Apple’s future. This space faces extreme competition and it can be hard for companies like this to continue innovating in the same way. I mean, what more can these smart phones do that they don’t already do? This will probably be viewed as a silly question someday when these things integrate with our biological being and do everything for us. I can see the dystopian futuristic techno thriller being written as we speak.<span class=\"s11\"><span class=\"bumpedFont20\">Warren Buffett likes!<\/span><\/span><\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">2. JNJ &#8211; Johnson &amp; Johnson<\/span><\/span><\/h2>\r\n<ul style=\"text-align: left;\">\r\n<li>JNJ seems like one of those buy and hold for the long term stocks that has paid an increased dividend for decades.<\/li>\r\n<li>JNJ has Covid vaccine results coming in January. This vaccine may be better suited for mass global distribution because it will only require refrigeration and perhaps one dose.<\/li>\r\n<li>JNJ invests billions each year in R&amp;D to continue to deliver new and better health products.<\/li>\r\n<li>No matter the economic cycle, people will get older and require health related products and support.<\/li>\r\n<li>2.94% dividend yield, $3.80\/share dividend payout per year. 100 shares provides $380 in dividend income per year (that buys a lot of baby shampoo!)<\/li>\r\n<li>Now may be an attractive entry point for the stock. <\/li>\r\n<li><span class=\"s11\"><span class=\"bumpedFont20\">Warren Buffett likes!<\/span><\/span><\/li>\r\n<\/ul>\r\n<h2 style=\"text-align: left;\">Everyone uses their products (<a href=\"http:\/\/198.199.80.40\/2023\/02\/investing-for-world-war-iii\/\" target=\"_blank\">recession proof<\/a>)<\/h2>\r\n<p style=\"text-align: left;\">Most of us have used Johnson &amp; Johnson products: Tylenol, Band Aids, Listerine, Aveeno, Neutrogena, Neosporin, Lubriderm…and on and on and on. Or we have taken the medicines or used the medical devices manufactured by Johnson &amp; Johnson. In other words, if you have a human body, at some point you will need something from JNJ. We all have physical bodies that require all kinds of care and attention from cradle to grave. Therefore all along the way Johnson &amp; Johnson (JNJ) is providing the moisturizers, lotions, wipes, machines, medicines, etc. that are needed to be clean, pain free, cure and become healthier. <span class=\"s11\"><span class=\"bumpedFont20\">Warren Buffett likes!<\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">3. JPM<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> &#8211; JP Morgan Chase<\/span><\/span><\/h2>\r\n<p class=\"s5\" style=\"text-align: left;\"><span class=\"s11\"><span class=\"bumpedFont20\">JPMorgan re<\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\">mains a stellar company in light of being part of an<\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\"> often disliked financial sector<\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\">.<\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\"> The stock <\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\">pays out one of the biggest dividends dollar-wise out of any blue chip, and the company just smashe<\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\">d earnings estimates recently. The company <\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\">is in a very favorable position to capitalize going forward, JPMorgan in particular.<\/span><\/span> <span class=\"s11\"><span class=\"bumpedFont20\">JPMorgan remains the top U.S. bank, is extremely cheap, is likely to continue to beat revenue and <\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\">EPS estimates going forward. Warren Buffett likes!<\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">4. V<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> – Visa<\/span><\/span><\/h2>\r\n<p style=\"text-align: left;\"><span class=\"s12\">What can we say, people will continue to pay for things and they will continue to use <\/span><span class=\"s12\">credit.<\/span><span class=\"s12\"> There are about 3.2 Billion Visa cards circulating around the world right now, wow! <\/span><span class=\"s12\">Right alongside <\/span><span class=\"s12\">Mastercard<\/span><span class=\"s12\"> and Discover, Visa is one of the most renown payment processing networks in the <\/span><span class=\"s12\">world.Visa<\/span><span class=\"s12\">, MasterCard, and <\/span><span class=\"s12\">Paypal<\/span><span class=\"s12\"> have prevailed as leaders in the digital payment processing space for decades. As the adoption of electronic and digital payment technologies continue, payment network companies are well positioned for long-term success. <span class=\"s11\"><span class=\"bumpedFont20\">Warren Buffett likes!<\/span><\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">5<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">. PG<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\"> – Proctor &amp; Gamble<\/span><\/span><\/h2>\r\n<p class=\"s14\" style=\"text-align: left;\"><span class=\"s13\"><span class=\"bumpedFont15\">With products such as Tide, Bounty, Charmin, Crest, Dawn, Always, this company is built for good times and bad in the economy. These are all products that consumers cannot easily give up on, even in the event that times will get tough. There can be some product substitution, for instance, Bounty paper towels may be substituted with cheaper alternative paper towel brands. I don&#8217;t believe that the substitution effect for most of its products would ever become so significant that it would cause a severe decline in revenues or profits.<\/span><\/span><\/p>\r\n<p class=\"s14\" style=\"text-align: left;\"><span class=\"s13\"><span class=\"bumpedFont15\">Procter &amp; Gamble stock is within about 2% from its all-time highs. P&amp;G<\/span><\/span><span class=\"s13\"><span class=\"bumpedFont15\"> net earnings are up 12%, even though its revenue has been flat for the latest quarter, compared with the same quarter from last year. In terms of profitability as a percentage of revenue, it is looking rather solid, with $3.2 billion in net earnings. Other important measures such as interest on debt are looking good as well. Interest costs came in at $129 million, which is less than 1% of revenue. <\/span><\/span><span class=\"s13\"><span class=\"bumpedFont15\">Procter &amp; Gamble offers 3.2% dividend yield. P&amp;G is quite simply a defensive stock.<\/span><\/span><\/p>\r\n<p class=\"s9\" style=\"text-align: left;\"><span class=\"s11\"><span class=\"bumpedFont20\">PG was a great value when it was beaten down and yielding around 4% &#8211; maybe not so much now. I prefer the approach of an &#8220;all weather&#8221; portfolio rather than shifting things around in anticipation of some <\/span><\/span><span class=\"s11\"><span class=\"bumpedFont20\">economic change. A lot of money is lost in trying to time economic cycles and stock markets, so P&amp;G should remain a good long term ownership stake. Warren Buffett likes!<\/span><\/span><\/p>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">7<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">. ORCL &#8211; Oracle<\/span><\/span><\/h2>\r\n<div class=\"p p1\" style=\"text-align: left;\">\r\n<div class=\"article-summary article-width\">\r\n<div class=\"a-sum\">\r\n<p>Oracle clearly sees an opportunity to differentiate from competitors, based on its core database IP and a focus on high-performance applications. There are quite a few companies that are interested in migrating traditional Oracle-based, database-focused products onto the cloud. Oracle continues to make its way when it comes to its cloud computing products, Oracle Cloud, which ties together Oracle Cloud Infrastructure, or OCI, with their various cloud, database and application platforms. Right now, Oracle is clearly battling it out for number four with IBM and SAP, well behind Amazon Web Services, Microsoft Azure, and Google Cloud Platform. <span class=\"s11\"><span class=\"bumpedFont20\">Warren Buffett likes!<\/span><\/span><\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<h2 style=\"text-align: left;\"><span class=\"s2\"><span class=\"bumpedFont15\">8<\/span><\/span><span class=\"s2\"><span class=\"bumpedFont15\">. COST &#8211; Costco<\/span><\/span><\/h2>\r\n<div class=\"p p1\" style=\"text-align: left;\">\r\n<div class=\"article-summary article-width\">\r\n<div class=\"a-sum\">\r\n<p>No wonder Warren Buffett loves Costco, they sell $1.50 hot dogs! Most think COST only gets by due to its membership fees. That thinking is true in the near term but it’s missing the big picture. COST is able to keep paying generous special dividends. Shares are a strong buy for the long run. Costco is most well known for their discounts but as a stock, it is known as being mainly about membership fees. With membership fees arguably being the difference between profitability and, well, non-profitability, it would appear as if membership fees form the essence of the growth thesis. Shares are a strong buy and one you’ll want to keep for the long run. Costco is another one of those companies that even during a recession, or even more so, people will want to shop there. <span class=\"s11\"><span class=\"bumpedFont20\">Warren Buffett likes!<\/span><\/span><\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<p style=\"text-align: left;\">There are many great books and resources that teach someone about Warren Buffett. The older he gets the more of a national treasure he seems to become. I read my first book about him when I was 15 called <em><a href=\"https:\/\/a.co\/d\/jff8NbP\" target=\"_blank\">The Warren Buffett Wa<\/a>y<\/em>. I hope you will explore his thoughts on investing and gain as much value as many of us have from him.<\/p>\r\n<ul>\r\n<li style=\"text-align: left;\">AS ALWAYS, THIS IS NOT INDIVIDUAL INVESTMENT ADVICE TO ANYONE, THESE ARE PERSONAL OPINIONS EXPRESSED ON THIS WEB LOG.<\/li>\r\n<\/ul>","protected":false},"excerpt":{"rendered":"<p>Berkshire the company is like an amazing collection of over 60 awesome American companies. I admire the man himself for his morals, intellect and values. I find him to be a role model in terms of living a good and fulfilling life. He values integrity, family, moral judgment and strategic business investments. He loves numbers and math. He also loves a Dairy Queen Blizzard and burger! His investing wisdom seems to me to go beyond investing itself. Here are some of his great quotes full of wisdom we could all learn from:<\/p>\n","protected":false},"author":2,"featured_media":15018,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[2,5,9,12,16,17],"tags":[40,47,51,52,65,68,108,115,117,124,130,148,180],"class_list":["post-10945","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-401k","category-best-of-mv-classics","category-dividends-2","category-free","category-investing","category-net-worth","tag-berkshire-stock","tag-buffett-stock","tag-buy-berkshire-hathaway","tag-buy-buffett-stock","tag-coca-cola","tag-costco","tag-how-does-buffett-invest","tag-investing","tag-investing-like-buffet","tag-johnson-johnson","tag-kraft-heinz","tag-oracle","tag-simple-investment-ideas"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/01\/102641799-20150331-9995-1180.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/10945","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=10945"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/10945\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/15018"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=10945"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=10945"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=10945"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}