{"id":11241,"date":"2023-02-26T21:32:32","date_gmt":"2023-02-27T05:32:32","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=11241"},"modified":"2023-07-13T12:05:59","modified_gmt":"2023-07-13T19:05:59","slug":"prepare-real-estate-investing","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/02\/prepare-real-estate-investing\/","title":{"rendered":"Are You Prepared for Real Estate Investing? 5 Things to Consider"},"content":{"rendered":"\n<p class=\"has-text-align-left\">As many readers of&nbsp;<strong><em>The Money Vikings&nbsp;<\/em><\/strong>know, I primarily work in the realm of real estate investing. For centuries real estate has served as an attractive asset class that can preserve and grow wealth. Think about the wealth of Kings and Queens, it mainly derived from the ownership and productive use of real estate.<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_82594\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/Fh_zuLYVjTI?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<p class=\"has-text-align-left\">As we continue on our journey to financial independence or perhaps “early retirement” (FIRE), we will need to choose several investment vehicles. Real estate can be a classic and time tested choice. In other words, how will we build wealth and create “passive” income machines?<\/p>\n\n\n\n<p class=\"has-text-align-left\">It may be a stretch to call real estate a “passive” investment. In my experience it takes quite a bit of up front work and capital to own and operate physical real estate. One thing I like about real estate investing is that it is a hands on endeavor involving a physical thing, with people, capital, projects and space to manage pretty much on a regular basis. Sure, it does not involve going into an office every day and sitting in a cubicle, but there is plenty to do that is not “passive.” So before considering, do research and know what you are getting into.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>WHY REAL ESTATE INVESTING?<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">Real estate for me is an interest and a kind of passion. I really like it because I enjoy seeing well designed and managed physical spaces for people to live in and use. Our physical environments can effect the way we feel and how productive\/creative we can be. I value order, good design, well maintained properties, providing shelter, the value of spaces, capital investments, cash flow, appraisal processes, etc. We respect the value of good urban planning to enhance the lives of people.<\/p>\n\n\n\n<p class=\"has-text-align-left\">I know that sounds nerdy, but we should pursue things that we find interesting in one way or another in my opinion. People make money off all kinds of pursuits and passions. The bottom line here is that I would only suggest someone invest actively in real estate if they have some kind of interest in the whole thing.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>MANY DIFFERENT WAYS TO TACKLE REAL ESTATE INVESTING<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">Another neat thing about real estate is that there are dozens of ways to invest and work in this asset class. Some ways take huge amounts of money and time and others can be started for as little as $50, for example buying a few shares of a high quality real estate investment trust. Check out our many other premium articles analyzing some of our favorite buy and hold Real Estate Investment Trusts. Another more recent and exciting way to gain real estate exposure is through crowd funding platforms such as Fundrise.<\/p>\n\n\n\n<p class=\"has-text-align-left\"><p class=\"has-text-align-left\">Properties in my opinion are a kind of living thing. They take constant maintenance and attention, care and feeding, etc. One thing I feel though is that property and the utilization of it is not ending ever. Yes, things and conditions change, but real estate is here to stay as far as I can tell. Wait until we plant a flag on Mars and claim title, which appears to be the goal of Tesla CEO Elon Musk.<\/p>\n<p><div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"7 Great REIT&#039;s &amp; Why Real Estate Investment Trusts?\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/as184wH4BK0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div><\/p><\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>TIME TESTED WEALTH BUILDING VEHICLE – REAL ESTATE<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">As mentioned earlier, one will need to choose which wealth building “vehicle” or“Long boat”they will utilize over the years. Saving will never cut it alone. Saving is a vital and important skill and habit, but it will not build wealth. The problem is that we will not make enough in a 30 year career and life will continue to get more expensive. Almost none of us are high paid athletes and movie stars or members of a royal family.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>$1.8 MILLION, THAT IS ALL!<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">The average worker with a good job in their lifetime will make about $1.8 million. Even if someone is a super saver and saved 20% of their salary the whole time they worked, which is 1% of the population, they would have $360,000 to live on for the next 30 years of retirement.<\/p>\n\n\n\n<p class=\"has-text-align-left\">$360k is certainly a lot of money, but in 30 years it will not be if that money sits in a savings account. As inflation rises that money will be “worth” less and less in terms of buying power. From the 360k one could withdraw $12k a year for 30 years. Certainly not living in the lap of luxury by any means. The good news as we know is that there are many options for investment vehicles. There are stocks, index funds, bonds, CD’s, small businesses, dividends, real estate, etc.<\/p>\n\n\n\n<p class=\"has-text-align-left\">Real estate is a time tested wealth building machine. With real estate the investor makes money off cash flow, tax advantages and appreciation in the value of the property. The appreciation is aided as you pay down the mortgage and build equity. Word of caution, historically real estate does not outperform the broader stock market, so it’s important to choose the market and property wisely.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>REAL ESTATE INVESTING IS NOT FOR EVERYONE – ARE YOU READY CHECKLIST<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">Real estate investing is not for everyone, and this is ok because there are plenty of other investment longboats in the world. We each tend to find our specific interests and investment paths over time. This is what I would ask myself before diving into hands on real estate investing:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Does it match your preferred investment vehicles? Is real estate something you are curious or interested in?<\/li>\n\n\n\n<li>Do you have the temperament? In other words, are you organized, somewhat handy and knowledgeable, can you work with people and contractors, can you solve problems? Can you manage money, time and projects effectively? Real Estate Investing takes a lot of project management and people skills.<\/li>\n\n\n\n<li>Are you financially fit? Like all investing, we do not start with the more complex real estate investing in terms of our overall personal finance picture. Is your debt under control? do you have emergency savings? Are you in possession of general knowledge about finance, investing and banking? Do you have good income, steady employment and insurance coverage?<\/li>\n<\/ol>\n\n\n\n<p class=\"has-text-align-left\"><h3 class=\"has-text-align-left\"><strong>How to Get a Mortgage for a Rental Property<\/strong><\/h3><\/p>\n\n\n\n<p class=\"has-text-align-left\">Despite the potential financial upside, working as a landlord has many challenges. Most people will need to use the bank&#8217;s money to finance at least some portion of the cost of the property. Financing a rental property will probably require managing a second mortgage payment on top of your primary mortgage<\/p>\n\n\n\n<p class=\"has-text-align-left\">Lenders know that rental properties are a greater risk vs primary residences. People will do a lot to keep a roof over their own head, but they can wall away from a rental property if it becomes too large of a headache for them. This means you will be required to meet certain standards before being approved for a mortgage. It can be hard enough to get a mortgage for your primary residence, here is a sample of what it will take to get a mortgage for a rental property:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Credit score.<\/strong>&nbsp;In general, lenders require a minimum&nbsp;score&nbsp;of 620 when financing a rental property. However, in order to secure the best interest rates and terms, you should have a credit score of 740 or higher, which is considered to be in the &#8220;very good&#8221; range. Keeping a high credit scare helps with all required loans.<\/li>\n\n\n\n<li><strong>Down payment.<\/strong>&nbsp;With a conventional mortgage for a primary residence, it&#8217;s possible to put down as little as 3%, depending on the specific lender and loan program. If your down payment is less than 20%, however, you will be required to pay&nbsp;private mortgage insurance or be denied completely. This protects the lender from some financial loss if you default on the loan. PMI doesn&#8217;t apply to mortgages on investment or rental properties, though. So you will likely be required to make a larger down payment of at least 15% to 20% in order to finance a rental property. Some properties, such as multiunit investment properties, require at least 25% down.<\/li>\n<\/ol>\n\n\n\n<p><strong>3. DTI.<\/strong>&nbsp;Another major factor that lenders consider is your debt-to-income ratio. This measures the percentage of your monthly gross income that goes toward paying off debt. To qualify for a mortgage for rental property, your DTI should ideally fall between 36% and 45%. In many cases, borrowers can count 75% of their potential monthly rental income (as determined during the appraisal) as additional qualifying income to help reduce their DTI.<\/p>\n\n\n\n<p>4. <strong>Savings and Assets.<\/strong>&nbsp;In addition to showing that you have sufficient income compared with your debt obligations, you&#8217;ll also need to show that you have plenty of money in the bank and other investments to cover financial hiccups. It&#8217;s a good idea to have three to six months of reserves saved in a liquid bank account, including the full mortgage payment with principal, interest, taxes and insurance.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>YOUR HOME<\/strong><\/h3>\r\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-medium wp-image-10593\" src=\"http:\/\/198.199.80.40\/wp-content\/uploads\/2021\/08\/pexels-photo-3221215-225x300.jpeg\" alt=\"real estate investing\" width=\"225\" height=\"300\" srcset=\"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/pexels-photo-3221215-225x300.jpeg 225w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/pexels-photo-3221215-768x1024.jpeg 768w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/08\/pexels-photo-3221215.jpeg 975w\" sizes=\"auto, (max-width: 225px) 100vw, 225px\" \/><\/p>\n\n\n\n<p class=\"has-text-align-left\">For most people there only real estate investment is in their primary residence. I know some are trashing the idea of owning a home as not financially sound. In my opinion, owning the wrong home is a bad decision, but owning the right one can be a huge benefit.<\/p>\n\n\n\n<p class=\"has-text-align-left\">I still believe this is a great decision for most people if they keep it in check. The main reason why is that at least at the end of decades of owning a home you have an asset that can be sold or rented out. Paying rent over all those years will never provide access to an asset. In addition, most of the people that argue against owning a home say that one would be better putting the maintenance, taxes and other savings into investments. I don’t think most people have that kind of discipline, they will pay rent and blow the rest.<\/p>\n\n\n\n<p class=\"has-text-align-left\">Real estate is obviously all location based, so it is important to understand and research conditions in your local city and market. Is the economy diversified and growing? Real estate in a one company town that is now defunct and rusting will not go up in value, there will be no demand and unused failing supply. So unless there is some turnaround plan or you can make money renting property to people, probably not the best location to invest in.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>LILLY PAD HOPPER<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">I think I invented the term “Lilly Pad Hopper Real Estate Investing”, at least I hope I did. I am a big fan of real estate investing over the years by buying, moving in for a while, fixing up, then buying another home to move into and renting out the last one. If you did this every five years, at the end of a 30 year career you could have 5-6 properties under your belt. That would make for some pretty awesome wealth building and cash flow, like a second pension or investment account. But keep in mind this will take years of work and management, and is not a get rich quick concept, it is part of building wealth one brick at a time.<\/p>\n\n\n\n<p class=\"has-text-align-left\"><h3 class=\"has-text-align-left\"><strong>NEW CONSIDERATION &#8211; CLIMATE CHANGE<\/strong><\/h3><\/p>\n\n\n\n<p class=\"has-text-align-left\">In the raging 20&#8217;s it is vital to consider the long term viability and costs associated with your investment properties. Some areas will be harder hit as the planet becomes hotter. Some areas are running out water, some are burning and smoke filled for months each year, some are flooding and others are being slammed by greater hurricanes. It is important before participating in real estate investing, consider the ramifications and your research in terms of future projections. Some parts of the planet will barely be habitable.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>FINANCING &amp; LEVERAGE<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">There are many schools of thought in terms of financing and the proper amount of money to put down etc. I am a big believer in putting money down. We all know what happened in 2008 after years of lenders handing out massive amounts of money on the street, the house of cards eventually crashed. But on a micro level it increases your cashflow when you put more money down.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>ALTERNATIVES TO OWNER INVESTOR LANDLORD<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">There are several ways to participate in real estate investing that have nothing to do with slinging a hammer or doing reference checks on prospective tenants. I have enjoyed the dividends from Real Estate Investment Trusts for many years now. One to consider is Realty Income, ticker “O” which actually pays the rare monthly dividend, which kind of makes it feel more like a real estate arrangement.<\/p>\n\n\n\n<p class=\"has-text-align-left\"><a href=\"http:\/\/198.199.80.40\/2023\/01\/reit-power-investors\/\" target=\"_blank\">REITs<\/a> are tax exempt vehicles that generate consistent cash flow and pay dividends that keep growing over time. Over the long run, <a href=\"http:\/\/198.199.80.40\/2023\/02\/6-reit-real-estate-investments\/\" target=\"_blank\">REITs<\/a> have outperformed the S&amp;P 500 by a factor of 4 times.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>REAL ESTATE INVESTING CLOSE TO HOME<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">There are different schools of thought in terms of where to invest. Some say close to home due to the hands on nature of RE. This may be a good place to start.&nbsp;But, there is a compelling argument for not investing close to home. You may live in an expensive area with low cap rates, therefore investments are less attractive.&nbsp;There seems to be a happy medium out there. Some outfits will provide the ability for investors to invest in more favorable markets at a lower hassle for a fee.&nbsp;I highly believe in making real estate investing close to your local market. This is the area I understand in detail. I understand the culture, the jobs, the growth prospects, the schools, the local contractors, etc. I think this leads to better investment decisions and the ability to check in on a property. Even if you are not actively managing it, it is nice to drive by and put eyes on activity and condition.<\/p>\n\n\n\n<p class=\"has-text-align-left\"><\/p>\n\n\n\n<p class=\"has-text-align-left\"><\/p>\n\n\n\n<p class=\"has-text-align-left\"><\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>NET OPERATING INCOME (NOI) AND FUTURE INCOME STREAM<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">A key factor in determining whether &nbsp;real estate investing is worth it is by analyzing the net operating income or NOI. Don&#8217;t let a fancy term deter you, this is basically the potential rental amount based on market data minus the monthly cost of the mortgage, taxes, maintenance and amortized closing costs. In other words, how much profit will you generate each and every month. If it is negative it may not be worth the investment unless you are thinking long term about appreciation of the underlying land and asset. If it is positive you will want to consider whether the profit is worth is each month to you. A lot of work is involved, if you are making $20\/month after all that, is that enough? Before starting Real Estate Investing, these are things one must be aware of.<\/p>\n\n\n\n<p class=\"has-text-align-left\">There are obviously volumes and volumes of books about real estate investing and it can become as technical as you want it to be. In my mind it comes down to a few simple concepts. First of all, you are providing an important product to people. Secondly you own something that is real and tangible and you have some control over it. You have virtually no control over a stock or a company and what it may or may not do. With a piece of property, I can decide to make improvements, market it for different purposes, raise or lower rent, refinance, put in low maintenance landscaping, change colors or styles, etc. These are all active measures I can take to change and improve the property as needed.<\/p>\n\n\n\n<p class=\"has-text-align-left\">Real estate is a calling my opinion and takes a certain set of skills and temperament. Perhaps start small with a moderately priced single family home. See if you like working as a landlord and property manager. It may become one of several investment vehicles and income machines one can build to grow wealth.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>REAL ESTATE INVESTING &#8211; YOUR PRIMARY HOME<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">A primary home may not be the best &#8220;investment&#8221; in terms of pure numbers. &nbsp;Rental property investment do have certain unique advantages over other asset classes, which we will explain in this article. &nbsp;I like the tangible physical aspect of real estate investing.&nbsp; It is good to own a stock and therefore a small slice of a companies future profits, but this is a number on a computer screen and you have absolutely no control over the future of that company.<\/p>\n\n\n\n<h3 class=\"has-text-align-left wp-block-heading\"><strong>SWEAT EQUITY<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\">Real estate is a ton of work and time, but I have worked on several real estate investments over the last decade and in hindsight, it was a very rewarding experience for many reasons.&nbsp; I am not saying it was stress free, but rewarding after the time, money and effort were invested. &nbsp;In addition, there is a social concept of improving a property to improve the quality of that particular neighborhood.<\/p>\n\n\n\n<p><h3><strong>ROOFSTOCK<\/strong><\/h3><\/p>\n\n\n\n<p>We recently found <a href=\"http:\/\/roofstock.com\" target=\"_blank\" rel=\"noopener\">roofstock.com<\/a> as a website resource to look at properties for sale all over the country. One can compare cap rates and neighborhood quality. Real estate Investing is a time tested way of building wealth, but it certainly takes years of prep, discipline and effort to launch.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As many readers of&nbsp;The Money Vikings&nbsp;know, I primarily work in the realm of real estate investing. For centuries real estate has served as an attractive asset class that can preserve and grow wealth. Think about the wealth of Kings and Queens, it mainly derived from the ownership and productive use of real estate. As we &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/02\/prepare-real-estate-investing\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Are You Prepared for Real Estate Investing? 5 Things to Consider&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":15035,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[22,16],"tags":[115,160,163],"class_list":["post-11241","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-real-estate","category-investing","tag-investing","tag-real-estate-investing","tag-reit"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/02\/real-estate-investing-scaled.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11241","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=11241"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11241\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/15035"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=11241"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=11241"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=11241"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}