{"id":11825,"date":"2022-01-01T12:34:03","date_gmt":"2022-01-01T20:34:03","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=11825"},"modified":"2023-02-06T18:48:57","modified_gmt":"2023-02-07T02:48:57","slug":"2022-another-way-to-approach-new-year-resolutions","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/01\/2022-another-way-to-approach-new-year-resolutions\/","title":{"rendered":"2022, Another Way to Approach New Year Resolutions"},"content":{"rendered":"\n<p>2022 is here and it is that time to make those new year&#8217;s resolutions. 2022 feels like a particularly strong year to do so give what we have all collectively lived through the last couple of years. But the cold reality is that I have failed in the past to keep resolutions going. It seems that by mid February I am working out less, letting old habits creep back in and am generally distracted by all the stuff I need to do. After some thought, perhaps I have uncovered a better way?<\/p>\n\n\n\n<p>Do not get me wrong, I am not against anyone making resolutions. And,&nbsp;I have plenty of areas where&nbsp;I need to improve. But I believe I have developed a more effective practice.<\/p>\n\n\n\n<p><strong>Fizzle by February<\/strong><\/p>\n\n\n\n<p>The&nbsp;problem I typically had with new year&#8217;s resolutions is that they fizzle by&nbsp;the first week of February. Real life demands get in the way of my overly&nbsp;optimistic goal of going to the gym regularly or just eating salads and smoothies.<\/p>\n\n\n\n<p><em>Now I do resolutions differently, I write them down,&nbsp;attempt to engineer life for automated success, seek out a supportive tribe and think small actions first.<\/em><\/p>\n\n\n\n<p><br><strong>A Different Approach to Resolutions<\/strong><\/p>\n\n\n\n<p>I used to&nbsp;religiously do&nbsp;New Year&#8217;s resolutions.&nbsp;I wrote them down, I started in earnest, and then a few months later I was off track. What can work better for us?<\/p>\n\n\n\n<p><strong>Write Them Down<\/strong><\/p>\n\n\n\n<p>I do believe in the power of writing things down. I think writing things down gives intentions a physical manifestation. We can post the words on a&nbsp;bulletin board or on a mirror in&nbsp;order to reinforce the intentions as time and inertia set in. So, no matter how one does it, I think making lists and writing things down holds great power and can be a first step in manifestation.<\/p>\n\n\n\n<p><strong>Engineer Success<\/strong><\/p>\n\n\n\n<p>The next thing&nbsp;I do is try and &#8220;engineer&#8221; the new&nbsp;habit into life so that it becomes very hard to resist. The classic investing example is automated bi weekly contributions to an investment account. Once this is &#8220;engineered&#8221; it becomes very &#8220;sticky&#8221; and hard to un-do. We have to go through effort to undo the automated action that is really good for us in the long run.<\/p>\n\n\n\n<p>There are many ways to engineer better habits and practices. If we only buy healthy foods and snacks, then on those late nights when we want to reach for the ice cream, it is not even there. If we set up a regularly scheduled time to go on a bike ride, walk, or jog with a friend or trainer, it becomes harder to just sit on the couch. Technology can be another way we can engineer reminders for success.<\/p>\n\n\n\n<p>For finances, I try to fence money off immediately so that it is harder for me to access and make impulse purchases. Remove TV&#8217;s and other screens from the bedroom so that we can promote healthy sleep.<\/p>\n\n\n\n<p><strong>A Supportive Tribe<\/strong><\/p>\n\n\n\n<p>We rise and fall with those we surround ourselves with. In the beginning of our lives we have little choice here. But as we grow older we get to choose who we hang out with, what we read, what activities we do, what kind of people we associate with on a regular basis.<\/p>\n\n\n\n<p>Ask yourself, are these folks really supportive of your goals and life? I do not mean in a financial sense, I mean in terms of support and encouragement. I hope that The Money Vikings is a source of support and encouragement to reach your higher goals!<\/p>\n\n\n\n<p><strong>Think Small, Avoid All or Nothing<\/strong><\/p>\n\n\n\n<p>Finally, I am a big believe in the power of small actions building up over time. I witness many folks over do &#8220;go big or go home&#8221; mentality. The reality is that we cannot always go big, real life stuff gets in the way. There&nbsp;will be days when we can only do a quick walk around the block instead of some intense workout. But the reality is that the quick walk is better than nothing and adds up over time.<\/p>\n\n\n\n<p><strong>What Works For You?<\/strong><\/p>\n\n\n\n<p>Perhaps the most important thing is to find what works for you. Just like in investing, there is not one best or perfect way. Perhaps for you resolutions and new habits stick if you have a partner, or an app, or just automate things to make them happen. Whatever it is, read all the ways possible,&nbsp;experiment, find what works for you. Perhaps different techniques work at different times of our lives. Join us as we share more ideas and encourage each other to build wealth and health in 2022!<\/p>\n\n\n\n<p>Best in 2022 investing and life,<br>Greg<\/p>\n","protected":false},"excerpt":{"rendered":"<p>2022 is here and it is that time to make those new year&#8217;s resolutions. 2022 feels like a particularly strong year to do so give what we have all collectively lived through the last couple of years. But the cold reality is that I have failed in the past to keep resolutions going. It seems &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/01\/2022-another-way-to-approach-new-year-resolutions\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;2022, Another Way to Approach New Year Resolutions&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":2,"featured_media":11827,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[11,12,13,21],"tags":[],"class_list":["post-11825","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-family","category-free","category-health","category-psychology"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/12\/pexels-photo-3394310.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11825","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=11825"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11825\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/11827"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=11825"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=11825"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=11825"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}