{"id":11838,"date":"2022-01-12T14:52:11","date_gmt":"2022-01-12T22:52:11","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=11838"},"modified":"2022-01-12T14:52:11","modified_gmt":"2022-01-12T22:52:11","slug":"5-levels-of-financial-strength-where-are-you","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/01\/5-levels-of-financial-strength-where-are-you\/","title":{"rendered":"5 Levels of Financial Strength, Where Are You?"},"content":{"rendered":"\n<ul class=\"wp-block-list\"><li>We cover a way to assess our financial health in various stages<\/li><li>Goal is to achieve a high level of financial health &amp; wealth<\/li><li>The main 5 levels are 1. Negative Net Worth (Sinking Longboat), 2. Treading Water, 3. Viking Health, 4. Viking Prosperity, 5. Viking King\/Queen<\/li><li>Know your stage so you can take action to go to the next level<\/li><\/ul>\n\n\n\n<blockquote class=\"wp-block-quote has-text-align-left is-layout-flow wp-block-quote-is-layout-flow\"><p><em>Chains of habit are too light to be felt until they are too heavy to be broken…” Papa Buffett<\/em><\/p><\/blockquote>\n\n\n\n<h2 class=\"has-text-align-left wp-block-heading\"><strong>What’s Your Story?<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-left\">If you ever played a role playing game like&nbsp;<em>Dungeons &amp; Dragons<\/em>&nbsp;(D&amp;D), read&nbsp;<em>Choose Your Own Adventure<\/em>&nbsp;or even watched a fantasy film like&nbsp;<em>Lord of The Rings<\/em>, each hero’s or heroine’s story is unique to them. Same thing holds true on your path to financial independence or FIRE! There are so many amazing unique paths and stories to offer guidance and inspiration. One thing I like about role playing games is that you get to create your own story.<\/p>\n\n\n\n<p class=\"has-text-align-left\">The same can hold true for our lives and finances in many ways. Sure, there are things outside our control and some things we only influence. But we also have opportunities to make choices along the way, like a&nbsp;<em>Choose Your Own Adventure<\/em>&nbsp;book. In other words, we all have a unique financial and life journey and we are the star of our saga. But how can we map this journey out to increase our chance at success? How do we know what level we are currently on? And finally what are some characteristics of each stage of wealth and financial independence?<\/p>\n\n\n\n<h2 class=\"has-text-align-left wp-block-heading\">ONLY <em>About 3 Out Of 100 People In The US Will Become Millionaires, Will We Be Among This Group?<\/em><\/h2>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"has-text-align-left wp-block-heading\"><strong>1. Sinking Longboat (Negative Net Financial Worth)<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-left\">Most of us start in this zone, the negative net worth zone. Approximately 20 million people in the US have a negative net financial worth. We talk a lot about calculating your financial net worth as a way to assess overall financial health. This is typically our college\/apprentice years followed by a few years that follow. Most of us spend quite a bit on an upfront investment to gain an education and get established within a career field or vocation. Most people are in debt. But what we want to do at this stage is get ourselves into a break even position. This takes a combination of paying down debt and at the same time building positions in assets\/savings. The key would be a regular debt payment plan (most likely for school loans or car loans), etc. It is critical in this stage to reduce expenses as much as possible. This means deferring luxury purchases, sharing homes and apartments to cut down on living expenses, etc. Another key action in this stage is to automatically invest or save in some manner. This is when I started setting up my&nbsp;<a href=\"https:\/\/themoneyvikings.net\/2018\/09\/02\/build-a-robot-wealth-building-army\/\" target=\"_blank\" rel=\"noopener\">Robot Wealth Building Army!<\/a><\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“The first $100k is a b&amp;$*h!” Mungie Pants<\/p><\/blockquote>\n\n\n\n<h2 class=\"has-text-align-left wp-block-heading\"><strong>2. Treading Water (0 To Slightly Positive Net Worth)<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-left\">Sometimes this level is referred to as scarcity. A person has achieved some level of steady income at a healthy level. At this stage one can easily service debt, pay living expenses and enjoy a little extra each month. According to some economic analysis this stage is hit around making $90k\/year, adjusted for local cost of living. It is important at this stage to recognize that the issue here is accumulation of assets and pay down of debt. There is nothing wrong with the $90k\/year income, but in this stage the person does not have a lot of assets compounding and building more wealth.<\/p>\n\n\n\n<h2 class=\"has-text-align-left wp-block-heading\"><strong>3. Viking Health<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-left\">Here is where in my opinion things start to get fun! There is no exact income per year that equates to a “healthy” financial picture, but I believe we can describe what this looks like. To me, this is when a person is pretty well established in their regular career or job, is regularly contributing to a retirement account with a balance of stock and bond funds, has built a small emergency stash. This person is paying things on time and building credit so that said credit can be leveraged in the future. One more key aspect of this stage is to be continuously learning about investing and financial knowledge. This is a key education stage, just as critical as formal education in your earlier years. This is a big reason we started The Money Vikings and are engaged with communities such as Gator-Traders, etc.<\/p>\n\n\n\n<h2 class=\"has-text-align-left wp-block-heading\"><strong>4. Viking Prosperity<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-left\">This is the stage that compounding and wealth building start to build great momentum. Covering bills is easily attainable here. At this stage a person may even be able to lean FIRE, in other words retire early if they are willing to live a frugal lifestyle and continue to collect passive income. Passive income machines are working well at this stage. Perhaps there are thousands a year coming in from dividends, real estate investments, side hustles, other business ventures. Many diversified types of assets are owned and managed skillfully.<\/p>\n\n\n\n<h2 class=\"has-text-align-left wp-block-heading\"><strong>5. Viking King Or Queen (High Wealth)<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-left\">At this level a person or family have abundant income streams and passive income is flowing. Debt is either non-existent or very well managed. In other words, these folks are not paying excessive amounts of interest on borrowed money. They own their primary residence. They have ownership stakes in various investments and businesses.<\/p>\n\n\n\n<h2 class=\"has-text-align-left wp-block-heading\"><strong>Past, Present And Future<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-left\">Much of what is described in terms of stages of wealth can also be boiled down to stages of life. We can also think about these concepts in terms of areas of life that we can influence through our direct actions. My grandmother always used to say that a persons past, present and future are important. We must make peace with our past and understand how it has shaped who we are today. The present is a gift and where life is lived and action can be taken. And it is important to dream about the future and respect our future selves. Sounds like a difficult thing to do all this, but the below map has helped me make sense of these concepts:<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We cover a way to assess our financial health in various stages Goal is to achieve a high level of financial health &amp; wealth The main 5 levels are 1. Negative Net Worth (Sinking Longboat), 2. Treading Water, 3. Viking Health, 4. Viking Prosperity, 5. Viking King\/Queen Know your stage so you can take action &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/01\/5-levels-of-financial-strength-where-are-you\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;5 Levels of Financial Strength, Where Are You?&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":2,"featured_media":11839,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[12],"tags":[],"class_list":["post-11838","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-free"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/01\/pexels-photo-414029.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11838","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=11838"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11838\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/11839"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=11838"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=11838"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=11838"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}