{"id":11958,"date":"2023-01-20T13:53:52","date_gmt":"2023-01-20T21:53:52","guid":{"rendered":"https:\/\/moneyvikings.com\/?p=11867"},"modified":"2023-10-14T09:55:41","modified_gmt":"2023-10-14T16:55:41","slug":"happiness-riding-the-u-shape-wave-of-life-5-ideas-2","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/01\/happiness-riding-the-u-shape-wave-of-life-5-ideas-2\/","title":{"rendered":"Happy Life &#038; Riding the “U” Shape Wave of Life &#8211; 5 Ideas"},"content":{"rendered":"<p>&#8220;Life, liberty and the pursuit of happiness&#8221; the immortal words from Thomas Jefferson just about sum up what we all are striving for in this life. Happy Life? But what if &#8220;happiness&#8221; or contentment was somehow baked into our biology and psychology at various levels at different stages of life? What can we do to increase our happiness and contentment? What can we expect in terms of when and how we can cultivate a sense of happiness?<\/p>\n<h2><strong>THE U SHAPE CURVE OF HAPPINESS<\/strong><\/h2>\n<p style=\"text-align: left;\">Research suggests our happiness and contentment in life can be shaped like a “U”. This means as kids our happiness is pretty high if we are lucky enough to experience a healthy childhood. Therefore starting at the top left of a &#8220;U&#8221; shape, happiness is registered as pretty high. Basic needs met, play time, friends, art, imagination, ice cream, toys, fun! Did I mention ice cream ? ? High contentment and happiness with life, so the beginning of the U shape equates to high happiness and contentment.<\/p>\n<h3><strong>College into Adulthood<\/strong><\/h3>\n<p style=\"text-align: left;\">Then we graduate high school and school and work pressures start to mount. We are trying to build a career, find a partner, make something of ourselves. The years clip by pretty fast and we enter our late 30’s and 40’s. Therefore, responsibilities and mounting work\/career pressures can take a toll, which can decrease our happiness. So the bottom of the &#8220;U&#8221; shape can represent middle age around the mid 40&#8217;s when our happiness and contentment can reach an all time low.<\/p>\n<p style=\"text-align: left;\">Typically during this time we have more work pressure, raising a family, supporting the American dream lifestyle; i.e. the house, cars, raising children, taxes etc. You may be blessed in many ways, but it’s hard during this time to manage stress and take care of yourself and others. In other words, It can be a time of exhaustion and fatigue. Therefore the stress levels go up and “<a href=\"https:\/\/www.psychologytoday.com\/us\/basics\/happiness\" target=\"_blank\" rel=\"noopener\">happiness<\/a>” levels can drop, resulting in the bottom area of the U shaped curve whereby happiness and contentment are dropping personally.<\/p>\n<h3><strong>Midlife Crisis?<\/strong><\/h3>\n<p>This can be the time when many people make knee jerk reactions in response to a kind of mid life feeling of despair. Most experts will suggest seeking counseling in order to sort through your emotions and thoughts at this time. This may be less expensive than the divorce and red sportswear.<\/p>\n<h2 style=\"text-align: left;\"><strong>Happiness peaks in our late 60&#8217;s!<\/strong><\/h2>\n<p style=\"text-align: left;\">Then research suggests that later after you have raised the kids, perhaps wrapping up your formal working life, contentment and happiness with life starts to go back up again, therefore the other side of the &#8220;U&#8221;. The feelings of &#8220;happiness&#8221; seem to surprisingly get higher and higher through the 60’s and 70’s. Perhaps our minds have matured into a state of inner peace?<\/p>\n<p style=\"text-align: left;\">Everyone’s life trajectory is a bit different and there can clearly be anomalies that exist at different stages of life. What are some ways to ride the waves of life and pick ourselves up when we fall off the surfboard?<\/p>\n<p style=\"text-align: left;\">What are some strategies to manage the middle part? This appears to be the part where our mettle is tested. This is most likely the prime building wealth stage, therefore how can a person practice gratitude, contentment and happiness during this time to make it as good as possible? Here are a few ideas:<\/p>\n<h2 style=\"text-align: left;\"><strong>1. Gratitude<\/strong><\/h2>\n<p style=\"text-align: left;\">The practice of gratitude is one of the great wealth building practices around. Why? Simply speaking, because your attention and focus is on what you currently have. You quickly realize how you may be more blessed than originally imagined. Especially if you keep a world perspective on matters and not have your mind trapped in your first world bubble.<\/p>\n<h2 style=\"text-align: left;\"><strong>2. Imagine Building a House and Rewards Along the Way<\/strong><\/h2>\n<p style=\"text-align: left;\">If your working hard to raise a family and build a career, then you are most likely building things greater than yourself. Your building a legacy, life and adding value for you and others. Make sure to set some big rewards along the way. Perhaps at year 10 or 15 of saving consistently you take some time to experience that dream vacation. Then after another 10 or 15 years you set another rewarding goal for your family.<\/p>\n<h2 style=\"text-align: left;\"><strong>3. Manage Things, Don’t Try To Cure<\/strong><\/h2>\n<p style=\"text-align: left;\">Life is something that is managed day to day. There is no “perfect” this or that. Every job, child, relationship, human thing in this world has its “faults” or “frailties”. Develop skills to manage things with a healthy attitude, proactive approach, strong communications, etc.<\/p>\n<h2 style=\"text-align: left;\"><strong>4. Balance In All Things (Work, Family, Health, Friends, etc.)<\/strong><\/h2>\n<p style=\"text-align: left;\">I am a big believer in balance in most things. If you are stressed at work it is time to really focus on taking care of yourself. You may need to do some research on having difficult discussions at work about limits and boundaries. We are people, not machines. You will also never gain back lost time with your children while they are young. Balance in all things, you can’t do it all.<\/p>\n<h2 style=\"text-align: left;\"><strong>5. Live in the Moment, Carpe Diem<\/strong><\/h2>\n<p style=\"text-align: left;\">Life is lived at wherever you are on the curve. My grandmother taught me that your past, present and future are all important and also must be balanced. Live each day to the max, actually enjoy the moment with kids, friends and family. Try and be accepting of you and others, it all might make the bottom of the U much easier to enjoy.<\/p>\n<h4><em>Challenging This Paradigm<\/em><\/h4>\n<p>I like to challenge all rules of thought since our experiences as humans can be so complex and nuanced. We are necessarily destined to be miserable during our 40&#8217;s. But we would be wise to pay special attention to self care and managing life&#8217;s expectations at this time.<\/p>\n<p>In fact, here is a link to an article that challenges all these premises: <a href=\"https:\/\/www.cnbc.com\/2022\/08\/29\/u-shaped-happiness-curve-why-your-40s-will-actually-be-satisfying.html\" target=\"_blank\" rel=\"noopener\">Are the 40&#8217;s really so bad?<\/a><\/p>\n<h2><strong>FINAL THOUGHTS<\/strong><\/h2>\n<p>One final thing I have noticed about people and happiness over my life and course of a 100 year pandemic. It seems if we can be of service to others, connect with others and help others, our happiness tends to grow. This does not mean completely selfless service. Remember we are creatures bound by the limitations of biology and physics, so make sure to take care of your health as you find ways to encourage and serve others. That would be a secret to <a href=\"http:\/\/198.199.80.40\/2023\/01\/overcoming-unfairness\/\" target=\"_blank\">happiness<\/a> from what I have observed.<\/p>\n<p>For more thoughts on living a life of True Wealth, check out the Money Vikings book: <a href=\"https:\/\/www.amazon.com\/Conquer-Financial-Freedom-Living-Wealth-ebook\/dp\/B0BRJW92XV\/ref=sr_1_1?crid=BX71LIFINDSJ&amp;keywords=conquer+financial+freedom&amp;qid=1674097852&amp;sprefix=%2Caps%2C113&amp;sr=8-1\" target=\"_blank\" rel=\"noopener\">Conquer Financial Freedom: Living a Life of True Wealth<\/a><\/p>\n<p style=\"text-align: left;\">\n","protected":false},"excerpt":{"rendered":"<p>Want to Live a Happy Life? One thing I have noticed about people and happiness over my life: If we can be of service to others, connect with others and help others, our happiness tends to grow. <\/p>\n","protected":false},"author":3,"featured_media":11868,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[12,4,5,13,21],"tags":[853,103,852,194,206],"class_list":["post-11958","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-free","category-art","category-best-of-mv-classics","category-health","category-psychology","tag-happiness","tag-happiness-in-life-at-different-ages","tag-happy","tag-the-u-shaped-curve-of-life","tag-when-am-i-most-happy"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/01\/pexels-photo-1104035.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11958","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=11958"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/11958\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/11868"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=11958"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=11958"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=11958"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}