{"id":12297,"date":"2022-03-23T02:48:50","date_gmt":"2022-03-23T02:48:50","guid":{"rendered":"http:\/\/143.198.225.54\/wordpress\/?p=12297"},"modified":"2023-03-19T18:58:01","modified_gmt":"2023-03-20T01:58:01","slug":"bitcoin-just-fail","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/03\/bitcoin-just-fail\/","title":{"rendered":"Did Bitcoin Just Fail its First Big Test?"},"content":{"rendered":"<p>Let’s take stock of the current moment: inflation is running too hot as we exit the Covid 19 pandemic disruptions AND we are on the verge of WW3. Why do I mention this? Because in my opinion Bitcoin should have broken $100k based on this information.<\/p>\n<h3><strong>Use Case Hits the Real World<\/strong><\/h3>\n<p>The main use case is two fold: Governments will have to keep printing money as time marches on. And, dictators in the world may cause disruptions that result in economic warfare and freezing of assets by Governments I have no sympathy for Oligarchs, but wouldn’t it be nice if they could stash their wealth into things that cannot be taken from them? Mega yachts and real estate can be confiscated and bank accounts, even in Switzerland, frozen. Governments can go in and take all of these things when push comes to shove. The Fed is clearly starting its latest round of interest fed rate hikes, meant to slow down consumption and make the cost of borrowing money more expensive. This typically puts a damper on inflation because it slows down consumption and demand. This is clearly a sign that inflation is running hot. Just go fill up the tank of that ICE car you are still driving. Jerry’s electric vehicle is looking better everyday!<\/p>\n<h3><strong>COUNTER ARGUMENT<\/strong><\/h3>\n<p>The flip side is that Bitcoin has held at the $40k mark for some time and perhaps that is a testament to the fact that the Fed did raise rates. In other words, there are active steps being taking to manage and dampen inflation, meaning that BTC did not need to skyrocket.<\/p>\n<h3><strong>REGULATIONS<\/strong><\/h3>\n<p>The recent proposed government regulations of crypto seemed welcome news for most in the community. This is meant to create order, and help so that oligarchs and other nefarious actors cannot launder money through crypto.<\/p>\n<h3><strong>STILL SPECULATIVE<\/strong><\/h3>\n<p>Crypto is still highly speculative in my opinion and at times I think we are subject to insider actions. The big crypto players seem to get in early on inside NFTs or coins, and by the time the rest of us come into the scene these guys are withdrawing their cash. Therefore, I must be honest, it still holds a relatively small place in my overall portfolio. It is fun to learn and hopefully profit, but there is still that feeling that a crypto winter could come out of nowhere and wipe away the valuation. As we know, there is no way to discuss Crypto in terms of intrinsic value. At least when I own JNJ, I know they hold patents, cashflow machines, and generally sell products that literally save and improve peoples lives. An actual financial appraisal can be determined based on cash flow, debt, and assets.<\/p>\n<h3><strong>IS BITCOIN AND OTHER CRYPTO FAILING OR SUCCEEDING?<\/strong><\/h3>\n<p>On one hand many of the serious coins are trading at very high valuations. They are an integral part of a bold new infrastructure and an intangible asset class. As an investor, one must ask what the asset produces, how does it add value to the customer and the investor? We seem to still be trying to answer these questions.<\/p>\n<h3><strong>WHAT DOES IT MEAN TO SAY “I OWN SOME BITCOIN”<\/strong><\/h3>\n<p>When you own a bond, stock, real estate, business etc., in many ways you can describe quite clearly what you own. You own a piece of current or future profits. You own equipment, real estate, a trusted brand, a patented process or product, etc. We should ask ourselves what we own, when we “own” bitcoin. It is obviously still up for debate whether Bitcoin and others have succeeded or failed. But I recall thinking that it was made for moments like this where inflation ran high and governments\/countries were fighting with each other. It was supposed to rise above these squabbles and human failures. Perhaps it did perhaps it did not. It did not crater, but I would have expected it to rise more. Perhaps things are bad enough yet, perhaps the Fed is being an effective tool, perhaps the Russian government will eventually stop creating extreme volatility as sanctions crush them? Time will tell, I will just hold my 2-3% of crypto. And if the apocalypse arrives, hope it can be traded for cans of beans, guns and water.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Let’s take stock of the current moment: inflation is running too hot as we exit the Covid 19 pandemic disruptions AND we are on the verge of WW3. Why do I mention this? Because in my opinion Bitcoin should have broken $100k based on this information. Use Case Hits the Real World The main use &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/03\/bitcoin-just-fail\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Did Bitcoin Just Fail its First Big Test?&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":2,"featured_media":12298,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[8,16],"tags":[42,491,492,115,495,494,493],"class_list":["post-12297","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-cryptocurrency","category-investing","tag-bitcoin","tag-crash","tag-economy","tag-investing","tag-putin","tag-russia","tag-ukraine"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/03\/Blue-and-Violet-Geek-GamingGamer-Website-1.png","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12297","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12297"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12297\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12298"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12297"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12297"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12297"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}