{"id":12502,"date":"2022-12-17T16:20:17","date_gmt":"2022-12-18T00:20:17","guid":{"rendered":"http:\/\/terminator.moneyvikings.com\/?p=12502"},"modified":"2023-10-14T09:56:42","modified_gmt":"2023-10-14T16:56:42","slug":"why-i-am-not-at-all-stressed-about-the-current-market-downturn","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/12\/why-i-am-not-at-all-stressed-about-the-current-market-downturn\/","title":{"rendered":"Inflation Defense System: Why I Am Not At All Stressed About The Current Market Downturn"},"content":{"rendered":"Watch out, the sky is falling. Once again there is fear in the air. We may really have a recession this time, especially since we have all been talking about it for the last year. So, perhaps it is time to sell everything and run into the woods! Is it all over?\n<h3><strong>The Fed Is Serious This Time<\/strong><\/h3>\nThe fed miscalculated inflation a year ago and is now making up for lost time by aggressively ratcheting up interest rates. But the downside is that this is spooking all markets and assets values are falling. They are probably falling back to levels they would have been if we had not had a pandemic. &nbsp;\n\n&nbsp;<img loading=\"lazy\" decoding=\"async\" class=\"alignnone  wp-image-12505\" src=\"http:\/\/terminator.moneyvikings.com\/wp-content\/uploads\/2022\/09\/IMG_4816-225x300.jpg\" alt=\"\" width=\"442\" height=\"589\" srcset=\"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/09\/IMG_4816-225x300.jpg 225w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/09\/IMG_4816-768x1024.jpg 768w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/09\/IMG_4816-1152x1536.jpg 1152w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/09\/IMG_4816.jpg 1512w\" sizes=\"auto, (max-width: 442px) 100vw, 442px\" \/>\n<h3><strong>The Money Vikings<\/strong><\/h3>\nWe have written articles &amp; made podcasts\/YouTubes about investing for over 5 years now! And I am truly grateful for this experience for many reasons. First of all, I have been able to work with close friends on a creative project that we are passionate about. We aim to deliver a treasure trove of ideas and inspiration to conquer financial freedom. But secondly, the experience has prepared us for this moment of crisis in investment markets. Let me explain why and how you can achieve the same level of preparedness. This does not mean we are sitting on our hands. We are engaged and watching what is happening closely. But as we have shared, we have been preparing our portfolios for these types of moments for some time now.\n<h3><strong>Personal Finance Blogging Education<\/strong><\/h3>\nLearning and writing all this content has sharpened the mind in terms of wealth building. And we clearly understand that markets go through gyrations, dips and general craziness at times. Assets do not go up in value in a straight and consistent line. The education we have delivered through the years of blogging covered many of the attitudes, behaviors and automations required to excel even in this tulmutuous environment. We have now invested through many of these turbulent times, 9\/11, Great Recession, pandemic, flash crashes and now the great 2022 Fed induced asset deflation actions. I do not know what is next, but there is always something around the corner. We have said it many times and will continue to say it so that some of you can prepare and thrive!\n<h3><strong>A Resilient Portfolio<\/strong><\/h3>\nWhen you look at all your assets holistically, we must be strategic and thoughtful. A portfolio should have a well rounded and diversified basket of assets. It should include both hard assets (i.e. real estate) and well diversified equities and bonds in different categories.\n<h3><strong>Opportunity<\/strong><\/h3>\nWe must balance this all with being prepared for opportunity. And when I say opportunity, I mean what many people call &#8220;scary times&#8221; filled with fear. When fear takes over that means in a persons mind they believe assets are going to zero and the world is ending as we know it. They sell at exactly the wrong time because they think I may lose it all.\n<h3><strong>Know Thyself<\/strong><\/h3>\nWe must know ourselves and get to know ourselves better throughout life. This is essential to life and part of the journey and evolution. We need to know how much risk we can tolerate. We need to know when we have enough. We need to understand what truly makes us feel energy and joy each day. This does not mean everything will be roses. No, we all know that there will be parts of life that suck for all of us. That is also part of this journey, and the only way out is through it all and managing what we can each day. Here are several concepts we continue to employ to navigate the current market:\n\n<!-- \/wp:heading -->\n\n<!-- wp:image --><!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n<h3 id=\"5487\"><strong>SOME CONCEPTS WE CONTINUE TO USE TO NAVIGATE INVESTMENT SUCCESS<\/strong><\/h3>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"dac2\"><strong>1. USE MATH — $179<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p id=\"0a30\">Even as the market goes down, we continue to dollar cost average into quality assets. And much of this is simple math. The thing about achieving a level of wealth that most people do not understand is that it is simple math and techniques. Most people seem to think in order to be wealthy they need to win the lotto, be a movie star\/sports star or invent the next internet sensation. For a very lucky few these paths work. Most of us will have to deploy a much simpler path.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*e2ApDvLHkzFFB9BNHK06nQ.png\" alt=\"\"><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n<p id=\"0da3\">Could you come up with $179 next month? Many people can, $179 in one month is really not a lot of money for most people. If a person started at age 20 and simply invested $179\/month at a 10% annual average return, by the time they reached age at 60 they would have $1 million in investments.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"66ce\">These numbers can be adjusted over time to speed up the process of accumulating wealth. But we get the picture, it is simple math and time on the journey to a million.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"1d9f\">Many people easily waste $179 month on little luxury items like coffees out, meals out, subscription services, clothes, etc. Heck, $5\/day for a fancy coffee is $150 month! Cut cable or do one less meal out each month and you have already surpassed the $179!<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"aa53\"><strong>2. MULTIPLE INCOME STREAMS<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/800\/1*MhdxiyA17X02qpM166UbwQ.jpeg\" alt=\"\"><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n<p id=\"5cd2\">In order to achieve financial independence and grow towards a million dollar nest egg, it can be highly helpful to develop and build multiple income streams. <strong>Multiple income streams are even more critical as we face a looming recession and potential job losses.<\/strong><\/p>\nThe reason for multiple income streams is born out of the experience of the booms and busts of the American economy over the last 20 years. Dot com bubble, 9\/11 shockwaves, housing bubble, global recession, bailouts and high unemployment, pandemics, etc. These events greatly impacted many people and their financial futures.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"2b3c\">A strategy that saved many was developing multiple income streams. These are things like side hustles, side jobs, dividend income, rental income, royalties from intellectual property like a book or patent, etc. In other words, not depending only on one job for all income needs.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"4edd\">I have frankly found these challenging to fully develop over the years. Each side income machine takes time to build, manage and deploy.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"3cf5\"><strong>3. DIVIDENDS<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/800\/1*xxTBa02KJjbeWMHxACYC2g.jpeg\" alt=\"\"><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n\nI believe quality dividend stocks will be favored in the current environment. First of all, the fact the company can send a dividend is s sign of its health and resiliency. Especially if this is one of my favorite dividend aristocrats who have lived through many challenging business environments. The dividend yield also negates any potential loss in the price of the equity. So the stock price may go down, but typically the company still pays you the dividend.\n<p id=\"7c3c\">One of my favorites are dividends from quality companies. We analyze a lot of dividend investments here and that is a key pillar to my multiple income stream strategy. Another thing I love about focusing on dividends is that I care much less what the stock price is doing each day, month or even year. Of course in the long run I want the stock price to appreciate in value, but as long as that little bit of income is coming in, then who cares?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"edc2\"><strong>4. BECOME OWNER\/INVESTOR, NOT JUST A CONSUMER<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*AZdBX895saE_wqm5nYKrhA.png\" alt=\"\"><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n\nThe current troubles facing our economy remind me of the importance of being both an owner and a consumer, not just one.\n<p id=\"f0ed\">In America we are born and raised in an environment of hyper consumerism. We embrace capitalism and spend hours a day gazing at commercials and grinding away to make money in order to make the next purchase. It is a never ending cycle and in many ways can get totally out of control. Millions are drowning in debt they will never re pay. In other words, they are behaving like compliant consumers. The constant bombardment of commercials is a great reminder of the next hot thing they need to make them feel complete briefly.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"f21f\">Ok, all good, the modern world seems to run on the jet fuel of consumerism. But what if you played multiple roles? What if you were also an owner and investor? What if you owned some of the capital, a stake in the game and were part of production?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"19e4\">That is a main point of the financial independence movement and FIRE: to have a controlling stake in the world we live in, instead of simply living off an old script that we were handed. Nowadays there are so many investment options from stocks, bonds, ETF’s, crypto, real estate etc. Either focus in on a couple, or own a diversified portfolio of many. Buy an asset like a stock. You are instantly a small fraction of an owner in the future profits of that business.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"6387\"><strong>5. CUT BACK ON WASTE<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n\nThis is a great time to analyze where your hard earned money is going and cut out the stuff that is not serving you. This is what we call an inflation defense system.\n<p id=\"8968\">I am continually surprised by the human habit of focusing too much on the stuff we can’t control and too little on the things within our control and influence. Someone may obsess over being hurt in a terrorist attack, yet stuff their face with highly processed “franken-food” from a low quality fast food joint. Heart disease, diabetes kill more people than terrorism. A person may focus too much on the potential low probability event while guzzling down sugary milkshakes and highly processed foods stuffed with sugar, bad fats and empty calories.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:image {\"linkDestination\":\"custom\"} -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*Po5cvZzZMoxRvPOLPJwUgw.jpeg\" alt=\"\"><figcaption>Photo by&nbsp;<a href=\"https:\/\/unsplash.com\/@theblowup?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\" rel=\"noreferrer noopener\">the blowup<\/a>&nbsp;on&nbsp;<a href=\"https:\/\/unsplash.com\/s\/photos\/waste?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\" rel=\"noreferrer noopener\">Unsplash<\/a><\/figcaption><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n<p id=\"c2bf\">Think about the stuff you control: subscriptions, coffee out, where you live, size of house, type of car, used or new…<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"07f7\">Focusing on what we can control and manage can have a profound effect on our long term trajectory. There are so many recurring expenses that can most likely be reduced or trimmed over time.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"8d8e\"><strong>6. BE POSITIVE AND MANAGE EMOTIONS!<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*LYVHTS5z4eLCIGWUBh_WFg.jpeg\" alt=\"\"><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n\nTimes like these require a healthy attitude. We need to understand that just as things can go bad, they can also go good. I try to develop a stoic mindset when it comes to what happens in investing and in life.\n<p id=\"5cbf\">Attitude and habits are the keystones to building substantial wealth. We live during an exciting and tremendous time. We have many opportunities that our ancestors could not even dream of. Let’s seize the moment and harness the opportunities before us. Perhaps we can add value, do some good in the world, spread some love and live a life of True Wealth.<\/p>\nManaging emotions is so critical to wealth building success. Study after study has shown that when we overreact to the market and make substantial knee jerk reactions to our investments, we typically do not succeed. My plan is to have a well diversified basket of assets that can be adjusted gradually over time to match my risk tolerance and desired asset allocations. No knee jerk reactions from me!\n<h3><strong>7. MAKE THE MOST OF THIS OPPORTUNITY<\/strong><\/h3>\nIf like me, you liked investing in equities and real estate prior to this recent down trend, then we should like it even more now that quality investments can be acquired at a cheaper cost. And for most of us, we can add to our investments brick by brick. For real estate I use REIT&#8217;s and crowdfunding platforms that allow small amounts to be invested incrementally. For stocks, I am favoring quality dividend players and other stocks that have been beaten down but offer long term value.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/394\/0*BsdD_DO_ccE2ouJB.png\" alt=\"\"><\/figure>\nBest wishes and I hope this information helps you stay calm and sleep well at night. Please share our content on your social media if this added value for you. Thank you!","protected":false},"excerpt":{"rendered":"<p>Watch out, the sky is falling. Once again there is fear in the air. We may really have a recession this time, especially since we have all been talking about it for the last year. So, perhaps it is time to sell everything and run into the woods! Is it all over? The Fed Is &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/12\/why-i-am-not-at-all-stressed-about-the-current-market-downturn\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Inflation Defense System: Why I Am Not At All Stressed About The Current Market Downturn&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12505,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16,2,5,10],"tags":[663,636,664,550,549],"class_list":["post-12502","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing","category-401k","category-best-of-mv-classics","category-education","tag-ids","tag-inflation-defense","tag-inflation-defense-system","tag-stay-calm-during-down-market","tag-stay-calm-during-recession"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/09\/IMG_4816.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12502","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12502"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12502\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12505"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12502"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12502"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12502"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}