{"id":12602,"date":"2023-04-18T08:44:39","date_gmt":"2023-04-18T15:44:39","guid":{"rendered":"http:\/\/terminator.moneyvikings.com\/?p=12602"},"modified":"2023-10-14T09:52:37","modified_gmt":"2023-10-14T16:52:37","slug":"investing-trifecta-to-create","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/04\/investing-trifecta-to-create\/","title":{"rendered":"The Investing Trifecta &#8211; Create a Massive Wealth Machine : The 3 Pronged Approach"},"content":{"rendered":"\n<div class=\"wp-block-rank-math-toc-block\" id=\"rank-math-toc\"><h2>Table of Contents<\/h2><nav><ul><li><a href=\"#the-investing-trifecta\">The Investing Trifecta<\/a><ul><li><a href=\"#1-dollar-cost-averaging\">1. Dollar Cost Averaging<\/a><\/li><li><a href=\"#2-401-k-match\">2. 401k Match<\/a><\/li><li><a href=\"#3-compound-interest\">3. Compound Interest<\/a><\/li><\/ul><\/li><li><a href=\"#the-calculations\">The Calculations<\/a><\/li><li><a href=\"#the-future\">The Future<\/a><\/li><\/ul><\/nav><\/div>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Several years ago The Money Vikings explained their notion of  the &#8220;Investing Trifecta&#8221; to triple their net worth<\/strong><\/li>\n\n\n\n<li><strong>Right now is the perfect set up for this method!<\/strong><\/li>\n\n\n\n<li><strong>In this article we talk about the power of the “Investing Trifecta” to create wealth. See how we tripled our net worth in just 8 years.<\/strong><\/li>\n<\/ul>\n\n\n\n<p>We have been investing for over 30 plus years now. I realized about 10 years ago that my success had come down to 3 main practices\/concepts. And they had nothing to do with insider knowledge, being a genius, market timing or having a rich dad. It came down to being &#8220;brilliant at the basics&#8221;.<\/p>\n\n\n\n<figure class=\"wp-block-image size-medium is-style-rounded\"><img loading=\"lazy\" decoding=\"async\" width=\"768\" height=\"576\" src=\"http:\/\/198.199.80.40\/wp-content\/uploads\/2023\/02\/kedar-gadge-qnbe1rlo06m-unsplash-768x576.jpeg\" alt=\"investing trifecta\" class=\"wp-image-13938\" srcset=\"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/02\/kedar-gadge-qnbe1rlo06m-unsplash-768x576.jpeg 768w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/02\/kedar-gadge-qnbe1rlo06m-unsplash-300x225.jpeg 300w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/02\/kedar-gadge-qnbe1rlo06m-unsplash-1024x768.jpeg 1024w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/02\/kedar-gadge-qnbe1rlo06m-unsplash-1536x1152.jpeg 1536w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/02\/kedar-gadge-qnbe1rlo06m-unsplash-2048x1536.jpeg 2048w\" sizes=\"auto, (max-width: 768px) 100vw, 768px\" \/><figcaption class=\"wp-element-caption\">Photo by <a href=\"https:\/\/unsplash.com\/@kedar9\" target=\"_blank\" rel=\"noopener\">Kedar Gadge<\/a> on <a href=\"https:\/\/unsplash.com\/?utm_source=true-wealth&amp;utm_medium=referral\" target=\"_blank\" rel=\"noopener\">Unsplash<\/a> <\/figcaption><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"why-now\"><strong>Why now?<\/strong><\/h2>\n\n\n\n<p>Hey Money Vikings, why are you dredging your old concept up again? Because, with the market down and assets prices depressed, now is a golden opportunity to set this system up. If you are in your 20&#8217;s, 30&#8217;s or whatever age, being aggressive now and setting up proper system can pay off huge in the future.<\/p>\n\n\n\n<p>I have had so much personal success with these 3 superpowers, I am doubling down now for another cycle of growth down the line.<\/p>\n\n\n\n<p>The next 8 years are coming and technology is changing lives every day. Wouldn’t be nice to triple net worth in the next 8 years? After 20 years of studying personal finance and investing, I still cannot figure out why WE all make it so hard. As we explain on <em>The Money Vikings, <\/em>there are straightforward ways to build wealth with simple strategies that have stood the test of time. In other words, building wealth can be very simple. <\/p>\n\n\n\n<p><strong>In this article we describe what we call the “Investing Trifecta” that supercharges your wealth building powers! With a steady middle class job, almost anyone can harness 3 super powers of investing to build wealth.<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"epyt-video-wrapper\"><iframe loading=\"lazy\"  id=\"_ytid_80543\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\" src=\"https:\/\/www.youtube.com\/embed\/b1r_jmV0yy0?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=1&#038;cc_lang_pref=en&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=0&#038;fs=1&#038;playsinline=1&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"fullscreen; accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"beware-the-investing-media-entertainment-circus-machine\"><strong>Beware The Investing Media Entertainment Circus Machine!<\/strong><\/h2>\n\n\n\n<p>Remember first that the daily market chatter should be viewed as “entertainment”. The media is after advertising dollars and revenue and is not built for the public good. In other words, everything needs to sound scary and like sudden doom is right around the corner. That is what gets the attention of our primitive <a href=\"http:\/\/198.199.80.40\/2022\/01\/5-levels-of-financial-strength-where-are-you\/\" target=\"_blank\">monkey brains with money<\/a>. Combine this with an education system that completely fails our population in terms of personal finance and investing skills (thank you personal finance bloggers for helping people to learn skills that are actually useful). Sure, I can tell you the various stages of cell division and what amino acids match up to create DNA, but I have used none of this knowledge to actually carve out a life for me and my family. <\/p>\n\n\n\n<p>There are a couple things over the last 10 years that have made a huge impact to my personal net worth. The good news is that many many people can do them quite easily. I will say, you do need steady and somewhat well paying middle class employment. If you’re a college student or struggling in low pay dead end jobs, this will be very hard to execute. But, with unemployment at historical lows, perhaps it is a good time to implement ways to build some wealth. And with the stock market crashing, this could be the beginning of your growth decade by harnessing the power of the investing trifecta!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"the-investing-trifecta\"><strong>The Investing Trifecta<\/strong><\/h2>\n\n\n\n<p>I am going to copyright this phrase today, the “Investing Trifecta!” because I have Googled and searched everywhere and I see no mention of it. It is harnessing 3 great powers to triple my net worth in 10 years. 10 years is really not that long of a time horizon if you think about it. If you are currently at a $300k net worth, that means in 10 years you could technically be close to a millionaire! 10 years comes faster than you can imagine, would it not be cool to be a millionaire in 10 years?<\/p>\n\n\n\n<p>Think of the “Investing Trifecta” as a 3 pronged Poseidon Trident that you can use to conquer financial freedom. We all know the name of the game is reaching a critical mass of assets that spins off so much income and interest that you make money while you sleep and withdraw slowly using the 4% rule. This frees us to pursue projects, work and time with family on our own schedule.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"1-dollar-cost-averaging\"><strong>1. Dollar Cost Averaging<\/strong><\/h3>\n\n\n\n<p>The first spear in the trident is harnessing the power of <a href=\"http:\/\/198.199.80.40\/2022\/11\/7-back-to-basics-investing-concepts-for-the-raging-20s\/\" target=\"_blank\">dollar cost averaging<\/a>. This is a very handy strategy at the moment. With the stock market plummeting, now may be the perfect time to start using this power. The current <a href=\"http:\/\/198.199.80.40\/2022\/01\/dear-crypto-world-get-your-sht-together\/\" target=\"_blank\">market meltdown<\/a>&nbsp;of 2022 is a perfect example of how you can harness this now. When you make those bi-weekly contributions to your 401k right now, notice you are now buying more shares because the shares are lower. If you have 10, 20 or more years to “retirement” or financial independence, in an ideal world the value of shares would plummet even more. You begin to cheer stock market declines and get excited about them. You will enjoy seeing quality stocks and index funds lose value as you load up on more.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"2-401-k-match\"><strong>2. 401k Match<\/strong><\/h3>\n\n\n\n<p>Of the 79% of Americans who get the choice to fund a 401(k), only 41% opt to participate. Therefore, only 32% of the workforce has a 401k. This is a lot of people, but it should be more. Not all these employers offer a match, but if yours does it is very important to contribute enough to get the match in my opinion. This is 100% return on investment, which is absolutely unheard of. My employer matches a certain percentage up to 5%. Therefore, in my mind I have to contribute at least 5% so I can earn that match. <\/p>\n\n\n\n<p>Now, in order to increase net worth and attain critical mass, I am investing well above this percentage in various ways. But the point here is the match. It has made a tremendous difference in investment gains and wealth accumulation over the last 10 years. A person may want to strongly consider working in some kind of private or government organization that offers a match. If you do not have a 401k or match, all is not lost. It just means that you will need to set up an Individual Retirement Account on your own through a company like <a href=\"http:\/\/198.199.80.40\/2022\/03\/you-dont-know-jack-bogle\/\" target=\"_blank\">Vanguard<\/a>. And you will want to up the contribution very high in order to make up for the match. <\/p>\n\n\n\n<p>Another option is to consider a&nbsp;<a href=\"http:\/\/198.199.80.40\/2023\/01\/tax-brackets-for-2022\/\" target=\"_blank\">Roth IRA (tax free distributions) account<\/a>&nbsp;to save even more on taxes in the future. Remember there is a consumption side to this equation and there are usually ways to drastically reduce consumption to acquire more assets. See our article on<a href=\"http:\/\/198.199.80.40\/2022\/01\/be-the-millionaire-next-door\/\" target=\"_blank\">The Next Millionaire Next Door.<\/a> The bottomline is that if you have a match offered, take it if the goal is to increase net worth dramatically.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"3-compound-interest\"><strong>3. Compound Interest<\/strong><\/h3>\n\n\n\n<div class=\"wp-block-media-text alignwide is-stacked-on-mobile is-style-rounded\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" src=\"http:\/\/oracle.davidkanter.com\/wp-content\/uploads\/2018\/11\/Scan-2-292x300.jpeg\" alt=\"\" class=\"wp-image-4677 size-full\"><\/figure><div class=\"wp-block-media-text__content\">\n<p>Investing Trifecta uses Compound Interest as one of the core tenants.<\/p>\n<\/div><\/div>\n\n\n\n<p>The third sharp fork on Poseidon’s investment trifecta is <strong>compound interest<\/strong>. Warren Buffett and I believe Einstein (could be urban legend) has called this one of the big mathematical wonders of the world! Simply put, compound interest is when the interest you earn on your initial investment begins earning investment and so on. In the beginning as you diligently sock away 10% of your income into a low cost index fund, you are mainly just saving. But after 7 plus years the interest that is earned on that initial and ongoing investment really starts to take off! This is one reason we focus so much on dividend investing her at <em>The Money Vikings<\/em>. The dividends can be reinvested into the investment. <\/p>\n\n\n\n<p>The mathematical wonder is that those dividends buy more shares, which then in turn produce even more dividends, and on and on for as long as you would live. There may be a point in life when you want to collect these dividends as income for consumption, but while you are working and increasing net worth, it might be more wise to let them compound and buy more shares.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"the-calculations\"><strong>The Calculations<\/strong><\/h2>\n\n\n\n<p>The other day I was looking back 8 years at an overview of one of my investment accounts and was analyzing what I contributed, what was compounded, and what was matched. Combined with great stock gains in the S&amp;P 500 over the last 10 years, it resulted in a tripling of net worth. Ask yourself how you can harness the powerful investment trifecta, be like Aquaman and rule the high Seas!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"the-future\"><strong>The Future<\/strong><\/h2>\n\n\n\n<p>No one really knows exactly what future returns will be for the stock market. Perhaps the next 10 years will be a bust and only produce modest returns. At the end of the day the human population will most likely grow, people will continue to live, consume, invent and work. In spite of what feel like intractable challenges, things will most likely work themselves out. Yes, the stock market will go up and down like a roller coaster. But the bottomline is that the investing trifecta will still be available to all of us to produce assets and grow our net worth.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The World Famous Investing Technique Created by the Money Vikings, the Investing Trifecta! Coming to a city near you in 2024!<\/p>\n","protected":false},"author":3,"featured_media":13938,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16,2,5],"tags":[575,576,574,484,577],"class_list":["post-12602","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing","category-401k","category-best-of-mv-classics","tag-3-pillars-to-grow-wealth","tag-3-ways-to-grow-wealth","tag-investing-success","tag-investment","tag-investment-trifecta"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/02\/kedar-gadge-qnbe1rlo06m-unsplash-scaled.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12602","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12602"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12602\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/13938"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12602"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12602"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12602"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}