{"id":12637,"date":"2023-10-29T13:42:52","date_gmt":"2023-10-29T20:42:52","guid":{"rendered":"http:\/\/terminator.moneyvikings.com\/?p=12637"},"modified":"2023-10-29T13:42:55","modified_gmt":"2023-10-29T20:42:55","slug":"fear-is-our-friend-investing","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/10\/fear-is-our-friend-investing\/","title":{"rendered":"Fear is Our Friend Investing"},"content":{"rendered":"<div>Fear is our friend when investing! But before I explain why fear is our friend right now as logical and well balanced investors, let me first describe an investing environment:<\/div>\n<div><\/div>\n<div><em><strong>Imagine a time when many people had extra cash laying around and access to online investing tools. Money was being thrown at all the new sexy internet companies and tech ideas. Mania took hold in the market and everyone was going to get rich at 25 years old throwing money at hot companies and tech ideas. This was not confined to a few seasoned investors, 20 years olds to 80 year olds were diving into the hot new thing that would shoot to the moon and make them rich. One day it all crashed and many lost their investment money in companies that were never close to turning a profit or being solvent.<\/strong><\/em><\/div>\n<div><\/div>\n<div>You may think I am describing the &#8220;meme&#8221; stock pandemic money fueled bull run of a couple years ago right? Nope. This was the &#8220;Dotcom&#8221; bust of the late 90&#8217;s early 2000&#8217;s, about 25 years ago.<\/div>\n<div><\/div>\n<h3><strong>History Rhymes<\/strong><\/h3>\n<div>We all know that history doesn&#8217;t necessarily repeat itself, but it sure rhymes.<\/div>\n<div><\/div>\nIf you are new to investing<a href=\"http:\/\/198.199.80.40\/2021\/08\/10-stocks-etfs-for-the-long-run-investment-longboats\/\" target=\"_blank\">investing<\/a>, over the last couple of years you may have started during the &#8220;meme&#8221; stock or pandemic fueled bull run, which is now come back to Earth. Remember, everyone that plopped a couple thousand into Bitcoin or some other alt coin was going to retire at 25 and live off the explosive growth.\n<h3><strong>Don&#8217;t Get Down, Get Disciplined<\/strong><\/h3>\nDo not be discouraged. I am not writing all this to say I told you so or gloat. I could have quit investing during the Dotcom bust. Some companies such as Home Grocer and Webvan went completely out of business! Let&#8217;s just say I was 2 decades ahead of my time in seeing the potential of online grocery delivery.\n<h3><strong>Your Great Opportunity is Now<\/strong><\/h3>\n<div>The irony of the last couple of years for an investor is that our opportunities were not really during the height of the mania, our greatest opportunity is about now. Of course the market could drop more, but there is ample opportunity coming in the next 12 months to load up on quality assets at sale prices.<\/div>\n<div><\/div>\n<h3><strong>3 Big Opportunities<\/strong><\/h3>\n<div>I believe that in the course of our investing and working lives we get a few big opportunities. These are not get rich quick situations. I am talking about times when fear is rampant and assets from houses to equities are going on discount. During these times we need to really lock in some discipline and sound principles that I will describe below.<\/div>\n<div><\/div>\n<div>If you are investing now, you have now been given an opportunity.  All the doom, gloom, interest rate hikes, and crashing equity prices are opportunities. The S&amp;P 500 index is down about 16% year to date. The broader market could drop more.<\/div>\n<div>In my opinion, now is the time to build long term positions in quality stocks and ETF&#8217;s. After the Dotcom bust I was able to automate my way to successful investing and ride multiple waves to long term success. I did it through discipline, automation, proper diversification, and strategic thinking. In this market, fear is your friend. Now is your time.<\/div>\n<div><\/div>\n<div>\n<h3><strong>A Resilient Portfolio<\/strong><\/h3>\nWhen you look at all your assets holistically, we must be strategic and thoughtful. A portfolio should have a well rounded and diversified basket of assets. It should include both hard assets (i.e. real estate) and well diversified equities and bonds in different categories.\n\n<\/div>\n<div>\n<h3><\/h3>\n<h3><strong>Opportunity<\/strong><\/h3>\nWe must balance this all with being prepared for opportunity. And when I say opportunity, I mean what many people call &#8220;scary times&#8221; filled with fear. When fear takes over that means in a persons mind they believe assets are going to zero and the world is ending as we know it. They sell at exactly the wrong time because they think I may lose it all. Remember dear can be our friend investing.\n\n<\/div>\n<div>\n<h3><\/h3>\n<h3><strong>Know Thyself<\/strong><\/h3>\nWe must know ourselves and get to know ourselves better throughout life. This is essential to life and part of the journey and evolution. We need to know how much risk we can tolerate. We need to know when we have enough. We need to understand what truly makes us feel energy and joy each day. This does not mean everything will be roses. No, we all know that there will be parts of life that suck for all of us. That is also part of this journey, and the only way out is through it all and managing what we can each day. Here are several concepts we continue to employ to navigate the current market:\n\n<\/div>\n<div><\/div>\n<div><!-- \/wp:heading -->\n\n<!-- wp:image --><!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n<h3 id=\"5487\"><strong>SOME CONCEPTS WE CONTINUE TO USE TO NAVIGATE INVESTMENT SUCCESS<\/strong><\/h3>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"dac2\"><strong>1. USE MATH — $179<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p id=\"0a30\">Even as the market goes down, we continue to dollar cost average into quality assets. And much of this is simple math. The thing about achieving a level of wealth that most people do not understand is that it is simple math and techniques. Most people seem to think in order to be wealthy they need to win the lotto, be a movie star\/sports star or invent the next internet sensation. For a very lucky few these paths work. Most of us will have to deploy a much simpler path.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*e2ApDvLHkzFFB9BNHK06nQ.png\" alt=\"\"><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n<p id=\"0da3\">Could you come up with $179 next month? Many people can, $179 in one month is really not a lot of money for most people. If a person started at age 20 and simply invested $179\/month at a 10% annual average return, by the time they reached age at 60 they would have $1 million in investments.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"66ce\">These numbers can be adjusted over time to speed up the process of accumulating wealth. But we get the picture, it is simple math and time on the journey to a million.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"1d9f\">Many people easily waste $179 month on little luxury items like coffees out, meals out, subscription services, clothes, etc. Heck, $5\/day for a fancy coffee is $150 month! Cut cable or do one less meal out each month and you have already surpassed the $179!<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"aa53\"><strong>2. MULTIPLE INCOME STREAMS<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/800\/1*MhdxiyA17X02qpM166UbwQ.jpeg\" alt=\"\"><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n<p id=\"5cd2\">In order to achieve financial independence and grow towards a million dollar nest egg, it can be highly helpful to develop and build multiple income streams. <strong>Multiple income streams are even more critical as we face a looming recession and potential job losses.<\/strong><\/p>\nThe reason for multiple income streams is born out of the experience of the booms and busts of the American economy over the last 20 years. Dot com bubble, 9\/11 shockwaves, housing bubble, global recession, bailouts and high unemployment, pandemics, etc. These events greatly impacted many people and their financial futures. <!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"2b3c\">A strategy that saved many was developing multiple income streams. These are things like side hustles, side jobs, dividend income, rental income, royalties from intellectual property like a book or patent, etc. In other words, not depending only on one job for all income needs.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"4edd\">I have frankly found these challenging to fully develop over the years. Each side income machine takes time to build, manage and deploy.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"3cf5\"><strong>3. DIVIDENDS<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone  wp-image-12641\" src=\"http:\/\/terminator.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5600003-200x300.jpeg\" alt=\"\" width=\"311\" height=\"467\" srcset=\"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5600003-200x300.jpeg 200w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5600003-683x1024.jpeg 683w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5600003-768x1152.jpeg 768w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5600003.jpeg 1000w\" sizes=\"auto, (max-width: 311px) 100vw, 311px\" \/><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->I believe quality dividend stocks will be favored in the current environment. First of all, the fact the company can send a dividend is a sign of its health and resiliency. Especially if this is one of my favorite dividend aristocrats who have lived through many challenging business environments. The dividend yield also negates any potential loss in the price of the equity. So the stock price may go down, but typically the company still pays you the dividend.<\/div>\n<div>\n\n&nbsp;\n<p id=\"7c3c\">One of my favorites are dividends from quality companies. We analyze a lot of dividend investments here and that is a key pillar to my multiple income stream strategy. Another thing I love about focusing on dividends is that I care much less what the stock price is doing each day, month or even year. Of course in the long run I want the stock price to appreciate in value, but as long as that little bit of income is coming in, then who cares?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"edc2\"><strong>4. BECOME OWNER\/INVESTOR, NOT JUST A CONSUMER<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*AZdBX895saE_wqm5nYKrhA.png\" alt=\"\"><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->The current troubles facing our economy remind me of the importance of being both an owner and a consumer, not just one.\n<p id=\"f0ed\">In America we are born and raised in an environment of hyper consumerism. We embrace capitalism and spend hours a day gazing at commercials and grinding away to make money in order to make the next purchase. It is a never ending cycle and in many ways can get totally out of control. Millions are drowning in debt they will never re pay. In other words, they are behaving like compliant consumers. The constant bombardment of commercials is a great reminder of the next hot thing they need to make them feel complete briefly.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"f21f\">Ok, all good, the modern world seems to run on the jet fuel of consumerism. But what if you played multiple roles? What if you were also an owner and investor? What if you owned some of the capital, a stake in the game and were part of production?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"19e4\">That is a main point of the financial independence movement and FIRE: to have a controlling stake in the world we live in, instead of simply living off an old script that we were handed. Nowadays there are so many investment options from stocks, bonds, ETF’s, crypto, real estate etc. Either focus in on a couple, or own a diversified portfolio of many. Buy an asset like a stock. You are instantly a small fraction of an owner in the future profits of that business.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"6387\"><strong>5. CUT BACK ON WASTE<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->This is a great time to analyze where your hard earned money is going and cut out the stuff that is not serving you. This is what we call an inflation defense system.<\/div>\n<div>\n\n&nbsp;\n<p id=\"8968\">I am continually surprised by the human habit of focusing too much on the stuff we can’t control and too little on the things within our control and influence. Someone may obsess over being hurt in a terrorist attack, yet stuff their face with highly processed “franken-food” from a low quality fast food joint. Heart disease, diabetes kill more people than terrorism. A person may focus too much on the potential low probability event while guzzling down sugary milkshakes and highly processed foods stuffed with sugar, bad fats and empty calories.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:image {\"linkDestination\":\"custom\"} -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/875\/1*Po5cvZzZMoxRvPOLPJwUgw.jpeg\" alt=\"\"><figcaption>Photo by <a href=\"https:\/\/unsplash.com\/@theblowup?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\" rel=\"noreferrer noopener\">the blowup<\/a> on <a href=\"https:\/\/unsplash.com\/s\/photos\/waste?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\" rel=\"noreferrer noopener\">Unsplash<\/a><\/figcaption><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->\n<p id=\"c2bf\">Think about the stuff you control: subscriptions, coffee out, where you live, size of house, type of car, used or new…<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p id=\"07f7\">Focusing on what we can control and manage can have a profound effect on our long term trajectory. There are so many recurring expenses that can most likely be reduced or trimmed over time.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h3 id=\"8d8e\"><strong>6. BE POSITIVE AND MANAGE EMOTIONS!<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-medium wp-image-12643\" src=\"http:\/\/terminator.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5435440-300x200.jpeg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5435440-300x200.jpeg 300w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5435440-1024x683.jpeg 1024w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5435440-768x512.jpeg 768w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5435440-1536x1024.jpeg 1536w, https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/pexels-photo-5435440-2048x1365.jpeg 2048w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" \/><\/figure>\n<!-- \/wp:image -->\n\n<!-- wp:paragraph -->Times like these require a healthy attitude. We need to understand that just as things can go bad, they can also go good. I try to develop a stoic mindset when it comes to what happens in investing and in life.<\/div>\n<div>\n\n&nbsp;\n<p id=\"5cbf\">Attitude and habits are the keystones to building substantial wealth. We live during an exciting and tremendous time. We have many opportunities that our ancestors could not even dream of. Let’s seize the moment and harness the opportunities before us. Perhaps we can add value, do some good in the world, spread some love and live a life of True Wealth.<\/p>\nManaging emotions is so critical to wealth building success. Study after study has shown that when we overreact to the market and make substantial knee jerk reactions to our investments, we typically do not succeed. My plan is to have a well diversified basket of assets that can be adjusted gradually over time to match my risk tolerance and desired asset allocations. No knee jerk reactions from me!\n\n<\/div>\n<div>\n<h3><\/h3>\n<h3><strong>7. MAKE THE MOST OF THIS OPPORTUNITY<\/strong><\/h3>\nIf like me, you liked investing in equities and real estate prior to this recent down trend, then we should like it even more now that quality investments can be acquired at a cheaper cost. And for most of us, we can add to our investments brick by brick. For real estate I use REIT&#8217;s and crowdfunding platforms that allow small amounts to be invested incrementally. For stocks, I am favoring quality dividend players and other stocks that have been beaten down but offer long term value. <!-- \/wp:paragraph -->\n\n<!-- wp:image -->\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/max\/394\/0*BsdD_DO_ccE2ouJB.png\" alt=\"\"><\/figure>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Fear is our friend when investing! But before I explain why fear is our friend right now as logical and well balanced investors, let me first describe an investing environment: Imagine a time when many people had extra cash laying around and access to online investing tools. Money was being thrown at all the new &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/10\/fear-is-our-friend-investing\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Fear is Our Friend Investing&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12666,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[2,9,10,21,22],"tags":[587,590,581,115,589,588,189],"class_list":["post-12637","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-401k","category-dividends-2","category-education","category-psychology","category-real-estate","tag-dotcom","tag-exhuberance","tag-fear","tag-investing","tag-irrational","tag-meme","tag-stocks"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/10\/fear.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12637","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12637"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12637\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12666"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12637"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12637"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12637"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}