{"id":12801,"date":"2023-01-13T09:28:08","date_gmt":"2023-01-13T17:28:08","guid":{"rendered":"http:\/\/198.199.80.40\/?p=12801"},"modified":"2023-01-16T12:24:18","modified_gmt":"2023-01-16T20:24:18","slug":"what-im-doing-with-finances-investing-in-2023","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/01\/what-im-doing-with-finances-investing-in-2023\/","title":{"rendered":"What I&#8217;m Doing With Finances &#038; Investing In 2023"},"content":{"rendered":"<h1>What I&#8217;m Doing With Finances &amp; Investing In 2023<\/h1>\n<p>I am strategizing and planning my investment actions and philosophy for 2023. In this article I will lay out the following:<\/p>\n<ul>\n<li>Brief assessment of 2022 damage<\/li>\n<li>Predictions &amp; opportunities for 2023<\/li>\n<li>specific actions I will take to grow wealth<\/li>\n<\/ul>\n<h3><strong>2022 Sh%!t Show<\/strong><\/h3>\n<p>First lets take a minute to reflect on 2022. What a mess or expected? Our world and country has been through a lot, and it was not always a walk in the park. More like navigating an episode of The Floor is Lava!<\/p>\n<blockquote><p><em>So first of all, as a human, you should give yourself a pat on the back for making it this far. If you are still relatively healthy and giving it a try each day, then you are already doing pretty well.<\/em><\/p><\/blockquote>\n<p>Next, beyond these <a href=\"http:\/\/198.199.80.40\/2022\/11\/7-back-to-basics-investing-concepts-for-the-raging-20s\/\" target=\"_blank\">basics<\/a>, we had to contend with 2 wars on our financial health. First, almost all asset classes dropped and lost value over 2022, including real estate, stocks and bonds. If your stocks and bond portfolio was nice and plump starting off the year, that too has probably taken a hit.<\/p>\n<p>That is all well and normal at times, seasoned investors know that some years are down years<\/p>\n<p>The second assault came in the form of some nasty post pandemic inflation. This is very hard to deal with because it hits personal finance on so many levels. Grocery store bills, gas, etc. all saw some out of control rise in costs. And this is after years of consumers dealing with inflation in education, childcare and housing. We just can&#8217;t seem to catch a break.<\/p>\n<p>All this stress has resiled in massive losses in personal wealth.<\/p>\n<h3><strong>2023, A New Opportunity<\/strong><\/h3>\n<p>Predictions can be dangerous and hard to make in a chaotic world. But here is me sticking my neck out and assessing what appears to be happening.<\/p>\n<p><strong>Inflation:<\/strong> many signs show  that <a href=\"http:\/\/198.199.80.40\/2022\/11\/recession-proofing-your-finances\/\" target=\"_blank\">inflation<\/a> is coming down. You can see it in the gas prices which seem to be leading indicators at times. Moreover, housing prices have dropped considerably and supply chains seem to be smoothing out. As a result of this, I expect to see some relief on this front in 2023.<\/p>\n<p><strong>Investing:<\/strong> It seems like <a href=\"http:\/\/198.199.80.40\/2022\/03\/how-to-trade-volatility\/\" target=\"_blank\">volatility<\/a> is here with us for a while. Mr. Market will continue to overreact in both directions to all kinds of conflicting news. There will be mixed bag of news on every indicator and there will continue to be global disruptions. Options traders may really enjoy the volatility mix this year. I also think there will continue to be a focus on enterprises that actually make money and a product that people want. No more to the moon BS or strange crypto experiments. After the beating folks took in 2022, there is little appetite for the extreme risk of crypto and fairy tale stocks.<\/p>\n<p><strong>Unknown unknowns:<\/strong> Not many people saw the pandemic coming. Most folks did not believe Russia would invade Ukraine. Furthermore, there are many recent and past examples of &#8220;black swan&#8221; events. <em>The reality for an investor as that we should just count on them happening. Something always seems to happen.<\/em><\/p>\n<h3><strong>Specific Actions I Am Taking<\/strong><\/h3>\n<h4><strong>Debt levels and type:<\/strong> It is high time to reduce and mitigate toxic high interest debt. Debt used for depreciating items such as clothes, trips, cars, etc. should be beat down to a manageable level.<\/h4>\n<p>Fortunately as a Money Viking, I do not have a lot of high interest toxic debt on depreciating things. In fact I have none. It is critical to remember in a volatile investing environment, if you can pay off high interest debt that is costing you 12, 15, or 20+%, that is a right away boost to net worth and wealth building. Being at close to zero debt right away makes your overall net worth so much stronger.<\/p>\n<p><strong>Good debt?<\/strong> I do believe there is such as thing as &#8220;good debt&#8221;. My favorite good debt is responsibly used debt amounts to buy real estate. There are tax advantages and you own a piece of a hard asset. If you own a home and were strategic enough to lock in one of those low low rates, then congratulations. Now is the time that essentially free money will help. You have minimized your monthly outlay and are not being eaten by high interest rates.<\/p>\n<h4><strong>Defensive investments:<\/strong> About a year ago, Money Vikings started repositioning into more defensive investments. What does this mean?<\/h4>\n<p>In my opinion, simply speaking, defensive investments are traditional assets that actually make money and are tied to fundamentals. Examples are well managed real estate investment trusts and dividend aristocrats.<\/p>\n<p>Are you properly diversified into defensive investment vehicles. consumer staples, healthcare, utilities, etc. tend to withstand market turbulence during a recession. Also, perhaps not a bad idea to hold some cash, especially to pounce on market opportunities when. the next bull run starts.<\/p>\n<h4><strong>Reduce spending:<\/strong> Are you finding ways to trim back on some expenditures?<\/h4>\n<p>About 6 months ago we started inflation defense systems (IDS&#8217;s), since inflation was showing no sign of abating. Even with inflation coming down, I would overshoot on these systems and continue the good cost reduction measures well into 2023.<\/p>\n<p>If we have a recession, It is best to enter a recession with the ability to live lean. Many have been living high on the hog as the pandemic money piled up and we joyfully came out to live again. But now may be a good time to ramp back some of the frivolous spending and see what comes next in the economy.<\/p>\n<h4><strong>Stay diversified: <\/strong>2022 taught us that the experts do not always know the best investments. No one knows year to year how Mr. Market is going to react. Moreover, strategic diversification is critical to investing success time and time again.<\/h4>\n<p>I ask myself if I have portfolio exposure to various asset classes and industries. Diversified ETF&#8217;s with low expenses and equities like BRK-B allow easy diversification.<\/p>\n<h4><strong>Emergency funds:<\/strong> It is always always always a good idea to have built an emergency fund, typically 6 months of emergency expenses. This buffers you from job losses or major challenges in life. If a recession hits and somehow your industry is effected, an emergency fund makes a major difference. As a result of this, I am currently focused on building back up a good emergency fund, because in the summer I had an emergency repair! Our <a href=\"https:\/\/hvac.com\" target=\"_blank\" rel=\"noopener\">HVAC<\/a> went dead after 40 years of operating, go figure. But this wiped out the emergency fund, so time to rebuild before the next recession.<\/h4>\n<h4><strong>Don&#8217;t fixate, move forward: <\/strong>In summary,It can be easy to beat ourselves up over investment and life &#8220;mistakes&#8221;. But the reality is that none of use are all knowing perfect beings. We are trying to make it in a world of controlled chaos. Do the best you can each day and master the fundamentals of wealth building over the long run.<\/h4>\n<blockquote>\n<h4>One unfortunate downside of the pandemic investing boom is that a whole younger generation of folks got wrapped up in the meme stock &#8220;to the moon&#8221; era. They believed that was a normal way to make money and build wealth. Unfortunately that was an artificially created situation based on easy money and social media drive madness. It was an era that was an anomaly. Learn from it and move forward into the current reality. No, we are not all going to become millionaires by putting a thousand dollars into a cryptographic code with cute dog marketing.<\/h4>\n<\/blockquote>\n<p>In summary, we need to get back to a reality &#8212; when making 6-8% return next year should be considered a success. It is not very often that 10x on an investment is a normal return.<\/p>\n<h3><strong>Money Vikings<\/strong><\/h3>\n<p>Thank you for joining us and enjoying the ideas we are discussing. We hope that they help you like they have helped us over the years. Keep strong Money Vikings!<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What I&#8217;m Doing With Finances &amp; Investing In 2023 I am strategizing and planning my investment actions and philosophy for 2023. In this article I will lay out the following: Brief assessment of 2022 damage Predictions &amp; opportunities for 2023 specific actions I will take to grow wealth 2022 Sh%!t Show First lets take a &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/01\/what-im-doing-with-finances-investing-in-2023\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;What I&#8217;m Doing With Finances &#038; Investing In 2023&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12843,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[2,9,10,16,17,21],"tags":[659,658,661,660],"class_list":["post-12801","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-401k","category-dividends-2","category-education","category-investing","category-net-worth","category-psychology","tag-2023-inflation-defense","tag-2023-investing","tag-build-wealth-now","tag-finances-in-2023"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/12\/IMG_1352-scaled.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12801","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12801"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12801\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12843"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12801"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12801"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}