{"id":12856,"date":"2022-12-23T11:02:14","date_gmt":"2022-12-23T19:02:14","guid":{"rendered":"http:\/\/198.199.80.40\/?p=12856"},"modified":"2023-02-05T21:17:44","modified_gmt":"2023-02-06T05:17:44","slug":"should-we-believe-real-estate-mythology-is-home-ownership-worth-it","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/12\/should-we-believe-real-estate-mythology-is-home-ownership-worth-it\/","title":{"rendered":"Should We Believe Real Estate Mythology (Is Home Ownership Worth It?)"},"content":{"rendered":"<p>We believe many myths and some can be very helpful on our journey through life. The ancient Greeks told tales of mythology in order to pass on valuable life lessons to increase their chances of success, wealth and survival.<\/p>\n<blockquote>\n<h3>What about the mythology we tell ourselves about owning a home and investing in real estate? Does home ownership really make sense for most people? Is there another path to wealth and security?<\/h3>\n<\/blockquote>\n<p><strong>Shelter<\/strong><\/p>\n<p>Our species was born shelterless. Ancient humans built all kinds of various forms of shelter in order to protect ourselves from the elements and increase our survivability. Vikings invented the famous longhouses that provided warmth, protection and a sense of community. We all know having clean adequate shelter is a wealth and health multiplier. BUT, shelter is generally very expensive in maintenance, time and upkeep. At what point does our concept of &#8220;ownership&#8221; go too far?<\/p>\n<p><strong>Full Disclosure<\/strong><\/p>\n<p>Many Money Vikings readers know I have a bias towards real estate investing. I work in real estate and I highly enjoy the value it can bring to human existence and our economies. Over half of my personal assets are in real estate in it&#8217;s various forms. But I want to focus in on home ownership investing in particular and then lay out alternatives like REITs.<\/p>\n<p><strong>Owning a Home, Is it a healthy American &#8220;dream&#8221;?<\/strong><\/p>\n<p>Many of us are raised with the mythology of the American dream. This is the idea that if we work hard we can afford a solid middle class life with a home, cars, a couple children and a secure retirement. In general I still personally believe in the American dream, but I do understand that it can be challenging and there are many different perspectives.<\/p>\n<p>Most Americans only investment in real estate is their primary residence. Is this a solid financial move? From the evidence I have reviewed, home ownership seems to make sense under certain conditions and here are a few I believe are critical.<\/p>\n<p><strong>Location<\/strong><\/p>\n<p>It is a cliche by now, but after a couple decades working in real estate, it is really all about location, location, location! This does not mean that we need to all live in the fanciest location, but location needs to be thought of as a critical element.<\/p>\n<p>First of all the location needs to be relatively safe from destructive forces of nature. Homes in the middle of a hurricane zone or coastal flood zone are going to have trouble and risks over the long run.<\/p>\n<p>Location also needs to take into account the surrounding community and amenities. Are the schools good? Are the roads well maintained? Are the taxes used appropriately and do zoning restrictions make sense?<\/p>\n<p><strong>Long term investment<\/strong><\/p>\n<p>Home ownership really only seems to make sense as a long term investment. Those I have known that have really made or stocked high equity have stayed in their homes for a long time.<\/p>\n<p><strong>Added costs<\/strong><\/p>\n<p>Owning a home has many short term and long term costs that need to be factored into the budget. There is of course short term and long term maintenance. Houses and structures on their own will pretty much fall apart. It is a reality of rental property investing that a very large portion of lifetime profits will be consumed with maintenance. There are of course profit margins, but people often overestimate the margins when initially jumping in.<\/p>\n<p><strong>Your Unique Situation<\/strong><\/p>\n<p>After years of studying personal finance and wealth building, I have come to realize there is no one size fits all approach. There are of course rules of thumb and basics of saving and spending that apply to all. But when it comes to which asset classes to invest and work in, one must learn a lot about their individual goals and tolerance levels. Below I would like to discuss Real Estate Investment Trusts (know as REITs) as a strong way to gain efficient exposure to the real estate sector.<\/p>\n<p><strong>Many Benefits to Real Estate<\/strong><\/p>\n<p>At Money Vikings I typically discuss all the many benefits of owning and investing in real estate, and there are many. One big reason to invest in a primary home is that we always will need housing, why not find a way to grow equity, control your property and invest in a home as a kind of forced savings. As rents rise all around us, your mortgage can remain constant. It is also an asset that can be acquired via leverage. With a smaller down payment, one can own a more valuable asset.<\/p>\n<p><strong>Inflation &amp; Recession Resistant<\/strong><\/p>\n<p>Many of the REITs I am currently adding are inflation and recession resistant. Notice I did not say recession proof, but some are strong enough they can withstand the pressures. I recently added Agree REIT (ADC) and W.P. Carey, which I believe fit this criteria.<\/p>\n<p><strong>O, REALTY INCOME<\/strong><\/p>\n<p>First up, the classic and the one of the best triple net REIT&#8217;s out there: Realty Income (Ticker: O), cleverly marketed as the monthly dividend player in the REIT space. Gives one that feeling of collecting monthly rents.<\/p>\n<p>Realty Income operates an impressive portfolio in all kinds of industries. <span class=\"s2\"><span class=\"bumpedFont20\">I am a long term owner of O stock, Realty Income. This is another strong REIT. <\/span><\/span><span class=\"s2\"><span class=\"bumpedFont20\">Realty Income is a high-quality income vehicle for investors with a moderate risk tolerance.<\/span><\/span> <span class=\"s2\"><span class=\"bumpedFont20\">A U.S. recession may be in the cards, exposing income investors to growing downside risks, but this is still a steady long term play. Here is more information about Realty Income &#8220;O&#8221;.<\/span><\/span><\/p>\n<p>Yield: Ex-Dividend Date 08\/31\/2021 · <em>Dividend Yield<\/em> 3.91% · Annual Dividend $2.826 · P\/E Ratio 73.41<\/p>\n<p><strong>VANGUARD REAL ESTATE ETF (VNQ)<\/strong><\/p>\n<p>Check out the Vanguard RE ETF. I like to study the top holdings and understand why they are so prominent in this great etf. This is another way I gain exposure to the lucrative real estate sector.<\/p>\n<p><strong>Why Real Estate?<\/strong><\/p>\n<p style=\"text-align: center;\"><span class=\"s2\"><span class=\"bumpedFont20\"><em>I would sure like to invest in real estate, but can’t even hammer a nail or unclog a toilet!<\/em><\/span><\/span><\/p>\n<p>This is a common refrain heard from many that fear jumping into real estate investing due to the high level of management required. But those nice stable investment returns and appreciation of capital are sure nice, it is like the demand cannot keep up with supply when it comes to real estate. But if you do not want to respond to maintenance calls, have you heard of a REIT (Real Estate Investment Trust)? This article will talk all about REITs and compare them to traditional &#8220;hands on&#8221; real estate investing.<\/p>\n<p>I write a lot about <a href=\"https:\/\/themoneyvikings.net\/2018\/12\/15\/analyzing-a-real-estate-investment\/\" target=\"_blank\" rel=\"noopener\">real estate<\/a> because I have a passion for it as a thing and as an investment vehicle. It may have something to do with my arts background, but I enjoy a well designed and well maintained property. Think about how essential real estate is to our modern lives. It keeps us safe, healthy and provides a platform for some of our greatest family memories. It is the grocery store, mall, coffee shop, warehouse, office complex, fast food joint, pharmacy, etc. Real estate in general is an excellent asset class in many ways. But it is important to consider all the pros and cons of the different ways to invest in real estate. <strong>In this article we focus on one that can be very easy to enter and easy to manage, high quality real estate investment trusts, or REITs<\/strong>.<\/p>\n<p><strong>What is a REIT?<\/strong><\/p>\n<p>A REIT is a company that owns and in many cases operates income producing real estate. An investor can buy shares of these companies. In other words, a REIT is a pool of properties and mortgages bundled together. The company offers shares of these combined assets in the form of a security or stock that an individual can buy into. There are all kinds of REITs that specialize in different types of real estate including office\/commercial, apartment buildings\/housing, hospitals, shopping centers, hotels, etc. REITs were invented as a real estate vehicle under a Public Law signed by President Eisenhower. REITs give all investors access to large scale real estate development investing.<\/p>\n<p><strong>IRS Rule on Income<\/strong><\/p>\n<p>One really neat feature of REITs is that IRS rules require the company to pay out 90% of their income back to share unit holders. This is typically in the form of a dividend. Dividend income is one of several strategies Money Vikings are harnessing to reach FI, so this makes REITs an ideal investment vehicle.<\/p>\n<p><strong>REIT vs. Hands On Real Estate Ownership<\/strong><\/p>\n<p>We are going to run some numbers and look at the pros and cons of owning\/investing in REIT&#8217;s vs actual hands on real estate investment ownership. The result may surprise you:<\/p>\n<p><strong>Real Estate Investment<\/strong><\/p>\n<p>Let’s say you invest in a $500,000 investment property (single family home) in a nice middle class neighborhood. You put $100,000 down and finance the remaining $400,000. In this scenario it is important to remember that your actual investment is $100,000.<\/p>\n<p>On a $400,000 mortgage the total cost of principle, interest (4-5%), escrow for taxes, would be about $2,500\/month<\/p>\n<p>Add another $100\/month for landscaping and another $100\/month for deferred maintenance.<\/p>\n<p>The house would cost about $2,700\/month in expenses.<\/p>\n<p><strong>BOTTOMLINE: If you look at the rental market and let’s say the property would rent for about $3,100\/month. <span class=\"s2\">So a person would be looking at a $400\/month cash flow “profit”.<\/span><\/strong><\/p>\n<p>Now, keep in mind that this investment takes a lot of hands on care and feeding: There will be maintenance calls to respond to at off hours. Changes of occupancy to manage, advertising, screening tenants, contracts to negotiate and sign. Long term maintenance to manage. Minor and major repairs, etc.<\/p>\n<p>But on the other hand, over many years you will be building equity in the property. So as the $400k note is drawn down and the price appreciates at 3-5% annually, the value of that investment can grow from the original $100k to $200k, $300k, etc.<\/p>\n<p><strong>Real Estate Investment Trusts (REIT)<\/strong><\/p>\n<p>Let’s analyze a $100,000 investment in a REIT. A very popular and strong REIT is the company Realty Income, ticker symbol “O” which we have written about before. With $100,000 you could by 1,538 shares of “O” at $65\/share. The stock offers a 4% dividend yield. One really neat thing that I love about “O” is that they pay the dividend monthly, which makes it feel like a traditional real estate investment. Each share returns .221\/share per month.<\/p>\n<p><strong><span class=\"s2\">BOTTOMLINE: .221 x 1,538 shares = $340\/month cash<\/span><span class=\"s2\"> flow<\/span><\/strong><\/p>\n<p>All this with no calls in the middle of the night due to a leaky roof!<\/p>\n<p><strong><span class=\"s2\">Bottomline<\/span><\/strong><\/p>\n<p><span class=\"s2\">As you can see from this simplified example, the investment in a high quality Real Estate Investment Trust can offer some comparable returns and cash flow. <\/span>The REIT investment certainly has far less “headaches” in terms of day to day management. All investing holds some level of risk. The company could tank and the shares lose value. On the other hand, investing in physical real estate you manage has its fair share of risks. A major repair could certainly set you back at almost any time.<\/p>\n<p>I like working with both REIT’s and traditional real estate. But for someone that does not want to deal with Tenants, contracts, repairs and hands on management, REIT is the way to gain exposure to the real estate sector. And looking at some of the initial numbers, may provide many of the returns and pure financial results. Ideally the value of the REIT shares will rise just as the underlying value of any real estate asset will rise.<\/p>\n<p><strong>CONCLUSION<\/strong><\/p>\n<p>In this article you can see that there are alternative ways to be a part of the real estate investing world that do not involve plunking down huge amounts of capital, taking out a loan, doing property inspections, screening tenants, unclogging toilets, and spending a fortune on a new HVAC system when the old one dies. In fact, the cash flow that can be generated from a sizable investment in high quality REIT&#8217;s can spin off some significant income. REIT&#8217;s are a great alternative that have now stood the test of time and can be an ideal vehicle for those searching for passive income. Yes, the industry will continue to manage and weather disruption, but that has always been the case as consumers priorities and desires shift. A good company anticipates and prepares for these changes and shifts.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We believe many myths and some can be very helpful on our journey through life. The ancient Greeks told tales of mythology in order to pass on valuable life lessons to increase their chances of success, wealth and survival. What about the mythology we tell ourselves about owning a home and investing in real estate? &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/12\/should-we-believe-real-estate-mythology-is-home-ownership-worth-it\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Should We Believe Real Estate Mythology (Is Home Ownership Worth It?)&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":11242,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16,21,22],"tags":[91,702,701],"class_list":["post-12856","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing","category-psychology","category-real-estate","tag-finance","tag-home","tag-home-ownership"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2021\/09\/pexels-photo-1370704.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12856","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12856"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12856\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/11242"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12856"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12856"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12856"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}