{"id":12878,"date":"2022-12-26T16:02:36","date_gmt":"2022-12-27T00:02:36","guid":{"rendered":"http:\/\/198.199.80.40\/?p=12878"},"modified":"2023-02-19T14:41:59","modified_gmt":"2023-02-19T22:41:59","slug":"my-2023-portfolio-setup-as-the-raging-20s-continue","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2022\/12\/my-2023-portfolio-setup-as-the-raging-20s-continue\/","title":{"rendered":"My 2023 Portfolio Setup as the Raging 20&#8217;s Continue!"},"content":{"rendered":"<h3><strong>2023 Portfolio<\/strong><\/h3>\nAs we enter 2023, I will lay out how my portfolio allocation will generally look based on my research and a sound approach to wealth building. We are now well into what we call the &#8220;Raging 20&#8217;s&#8221;. This is a time of several macro changes in the world that will effect investing and building wealth that I will describe below.\n\n2023 is a transition year that I would characterize best as back to fundamentals and the setup for great technological shifts. Those of us building wealth need to recommit ourselves to the fundamentals of frugality, budgeting and investing based on a there that is there. No more meme madness, government fueled infusions or crypto based on BS. Investments need some meat on the bones and need to represent sound businesses that are actually delivering value.\n\n<strong>My 2 Portfolios<\/strong>\n\nFirst let me describe the basics of my portfolio going into 2023. The concept here is that this will generally constitute my asset allocation and I will try and keep it to this over the course of the year with minor adjustments as needed and a little bit of risk taking to jump on opportunities. I prefer Vanguard funds and ETF&#8217;s, but there are many other great companies with low cost investing access.\n<ul>\n \t<li>5% Vanguard Small Caps Fund or ETF. It appears that after the market carnage of 2022, small caps can have an opportunity to beat the S&amp;P and deliver some higher gains. But of course this comes with increased risk, therefore I am sticking to a 5% allocation.<\/li>\n \t<li>10% Vanguard Value or BRK-B: Value is another place I think there is now great opportunity. These are those tried and true long ball hitters that have stood the test of time. These are companies that deliver products and make profits, but the stocks seem to have temporarily fallen out of favor.<\/li>\n \t<li>10% Vanguard International Fund: International seems to be another area of greater opportunity this year to gain some greater gains. But, I have always found International to be more risky, so again going with 10%. International seems even more risk on as the world grapples with Russian and Chinese government behaviors that are contrary to trade and global stability.<\/li>\n \t<li>30% Vanguard Bond Fund: I am going with corporate and municipal bonds and I prefer B or higher graded. Bonds are another area that may do well finally. It appears that 2022 was an anomaly where both bond and stocks suffered.<\/li>\n \t<li>25% Vanguard Total Stock Fund or VDADX: I still believe in great US companies to deliver over the long run and why not own a basket of them in a VOO or VDADX.<\/li>\n \t<li>20% Money Market\/Cash: This provides opportunity money and also smooths out any major dips through the year. We may be in for another volatile year, therefore some cash seems prudent for risk tolerance and sleeping well at night.<\/li>\n<\/ul>\n<strong>Portfolio 2<\/strong>\n\nI mention a second portfolio, because there are things I do and other investors can do to go to the next level. I think we what was described above will be just fine even for the next 5 years. But I also like the following options:\n<ul>\n \t<li>Rental Property. I like rental property in this world because it cannot vanish on screen like other investments. There are of course many risks, but also many rewards. real assets like this can be a ton of work. But again, they cannot disappear on a screen. But I am sure to look at quality, location, condition and other factors when deciding on physical real estate investments.<\/li>\n \t<li>Real Estate Investment Trusts. REIT&#8217;s are a great way to diversify a real estate portfolio and generate cashflow. They are some of my favorite passive investments because the companies are obligated to send 90% of revenue back to the shareholders via dividends.<\/li>\n \t<li>Fundrise eREIT. Fundrise admittely probably belongs in the REIT category, but I find it to be a kind of hybrid approach. I also mention it because the returns and consistency have been fantastic. I have invested with Fundrise for over 5 years and it has only steadily appreciated, even through 2022.<\/li>\n \t<li>Some crypto (BTC and ETH). I am frustrated with the way crypto has behaved but I am not totally against it. 2022 has been awful for crypto and we are for sure in a deep freeze winter. My personal belief is that with some common sense regulation this asset class grow and thrive.<\/li>\n \t<li>To expand on these ideas here is my description of the Raging 20&#8217;s and other things we can do to manage through it.<\/li>\n<\/ul>\n<h3><strong>Raging 20&#8217;s<\/strong><\/h3>\nI coined the term &#8220;raging 20&#8217;s&#8221; a few years ago as I realized this was going to be a turbulent decade. Part of my prediction came from my studies of international relations and globalization as an undergrad. Here is a quick history lesson for some insight into my thinking: After WW2, the US emerged as the preeminent power based on design, principles and fortuitous geography. Our design was superior with a healthy balance of power, capitalism with rules, and well functioning institutions. Basically we had the secret sauce of this new era that would make us the most prosperous and powerful nation on Earth. We also possessed relatively sound principles of human rights and rule of law. No system is perfect, but ours was a lot better than others, and is in fact still one of the best in the world. Finally, our geography gave us advantage since we were protected by oceans and peaceful neighbors to the north and south. <strong>A Shifting Global Order &amp; Existential Risks<\/strong> BUT, as other powers emerged in the world and globalization went on overdrive, we are now experiencing turbulence. There has been backlash against technology and global trade that left many workers behind. In addition, there are the existential threats like climate change and pandemics to contend with.\n<blockquote>\n<h3>Basically, what I am saying is to buckle up, for there is no sign of the raging 20&#8217;s to stop, well, raging!<\/h3>\n<\/blockquote>\n<h3><strong>What Is An Investor to Do?<\/strong><\/h3>\n<h3>Ok, so what Greg!? Build a bunker and load up on canned goods?<\/h3>\nI am not trying to be alarmist, just have a clear eyed take on what is going on in the world to inform sound investment decisions. I am actually still quite optimistic on the long arc of human history. We always seem to make a way to survive, thrive and improve. But this does make me want to re-visit some sound back to basics investing principles that I believe will serve us well today and over the next decade.\n<h3><strong>Why Back to Basics?<\/strong><\/h3>\nWith the last few years of pandemic craziness and meme stock madness, I believe it is time to re-commit ourselves to sound investing principles. Hey, I have no issue with taking 5% of my assets and throwing it at the next hot crypto or meme stock, but doing this with a large portfolio is highly risky and it could all disappear. How about we truly apply and understand sound investing principles that have stood the test of time, grown wealth and allowed us to sleep at night.\n\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<h3><strong>1. Asset Allocation<\/strong><\/h3>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\nNever forget to look at your portfolio of assets as a whole and determine what percentage is in the various asset classes. Is it an effective allocation? Take a step back. How do you divide your portfolio among different asset categories? This may be the biggest determinant of your investment returns. I find this is where many investors fail because they put little thought or effort into their asset allocation strategy.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\nFor me personally, I want to harness the tailwinds of bull markets and blunt the impacts of bear markets\/recessions. I do this through strategic minor adjustments to asset allocations during different investment periods. Most people have a portfolio that does well in good market times and does poorly when the overall market goes down. Think about overall portfolio construction in terms of what percentage of the following you may hold:\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\n-Stocks (equities), and within this category how much is small caps, mid caps, large caps. How much is growth vs. value stocks. How much is international, tech, etc.?\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\n-Bonds (fixed income), what is the quality of the bond ratings? Is the fund sufficiently diversified? How much to allocate to bonds typically depends on risk tolerance and age. Bonds are a lending asset vs. ownership. You are lending your money to an entity to do something, and the issuer returns a fixed percentage back to you over time.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\n-Cash, how much is being held in cash? This is typically rainy day emergency money or money that sits waiting for big investment opportunities.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\n-Alternative assets: Gold, crypto, etc. can be considered alternatives and generally more risky, but could have a small place in a well balanced approach.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\n-Hard assets: real estate is an example here of an asset that is tangible and manageable. Is there a place for these kinds of assets?\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph --><!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3><strong>2. Dollar Cost Averaging &amp; Automation<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n\nThis is the time for dollar cost averaging to really help to grow wealth. If you are automating a certain percentage of your income each month to index funds, right now you are adding shares on discount compared to last year. These are the times when this engine really gets going! I would not miss this opportunity to add shares on sale.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3><strong>3. Diversify Strategically<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n\nI think strategic diversification is most effective when we are harnessing the power of macro trends. For example, the world is aging and will need more medicines, therefore I may add a but more healthcare or Pharma exposure to a portfolio. This type of diversification is also critical because it can be hard to pick individual winning stocks. Strategic diversification delivers enormous benefits. It can be quite hard for example to pick individual stock winners in competitive industries. But we still may want to capture gains in particular thematic areas. This is a main reason I choose many thematic ETF&#8217;s. I am not saying to randomly diversify, I am saying be thoughtful about overall portfolio construction. If heavy in growth tech, perhaps add some value ETF&#8217;s. Try and add some uncorrelated assets. Perhaps some crypto is a good place to diversify into uncharted territory?\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\nBoth under diversification and over diversification are common mistakes made in portfolio management. Most studies show optimization occurs somewhere between 15 and 30 individual investments. I have found beyond this becomes too much to manage and may provide diminishing returns. I like to have some classic plays like a solid S&amp;P dividend ETF (may favorite is VDADX), a bond fund and a few core holdings that I do not touch. I pad this with exposure to sector ETF&#8217;s and some individual stocks that I believe are good mid term plays. I sprinkle in 2-3% crypto, 10% REIT&#8217;s and Real Estate, 10% international and I have diversified pretty well.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3><strong>4. Invest For the Long Term<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n\nYes, I like to take 5% of assets and do short term trades. But 95% of assets are in investments. Effective investors realize if you buy an investment at a favorable price it may take time for the market to recognize its true value.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\nLong term investing is one of the most important investing principles because short term trading usually leads to poor long term performance. This is common because many investors let fear and greed cause them to make bad decisions. The long term will take care of itself if you make wise investment decisions. PASSIVE INCOME MACHINES: I like to discuss PIM (passive income machines) as much as possible because it helps people keep the long term in mind when looking at their account balances. The ideal situation is that there should never be a day when you cash everything out of an investment account. Instead, we should look at the account like a small business we own that has the potential to spin off income each and every month and hopefully grow over the long run.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3><strong>5. Keep Expenses Low<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n\nMost investors don’t realize how much difference high expenses make to their portfolio. Take a look at the what happens to your returns with a 1% higher expense ratio; On a $100k investment over 30 years, a .4% expense ratio vs. a 1.4% ratio, seems like only 1%. It adds up to $146k lost in fees!!!\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\n<strong>The bottomline , over a 30 year period, an increase in expenses of 1% can cost your portfolio <\/strong>dearly.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3><strong>6. Do Not Forget About Compounding<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n\nCompounding is a powerful financial concept but it needs time to take hold. It is like planting a young fruit tree, it takes time for the fruit to mature and arrive. I specifically like the power of dividend growth compounding. Basically, every dollar made over time that is reinvested makes even more dollars. Make sure you enable DRIP (dividend reinvestment in your brokerage for dividend stocks and ETFs). I have seen this work effectively with my positions in Realty Income (O) &amp; Pfizer (PFE) over the years. The share prices have done ok, but the dividends have kept coming and I had them reinvested. During down times they bought more shares and during the up times those increased number of shares rose the entire accounts value.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3><strong>7. Anticipate Market Volatility and Use Risk Management<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n\nMarkets are typically manic depressive. One day up, one day down and on and on. You can control your portfolio volatility but you cannot control the inevitable volatility of investment markets. Therefore, you should be prepared to take advantage of investment opportunities. At the same time, you need to be cognizant of overvalued assets and be willing to move to cash when conditions are unfavorable. Admittedly, this is not easy, but with a sound approach it can be done in many conditions.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3><strong>Manage Your Own Destiny<\/strong><\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n\nThere are all kinds of investment advisors out there that will lead people astray. We need to educate ourselves and take charge of our own financial situation. And this is not easy in a sometimes confusing environment with a lot of noise. We want to be less noise and more signal.\n\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n\nTechnology and the internet have brought down transaction costs and provide the means to get information and guidance at a very low cost. There has never been a better time period for the self-directed investor who is willing to put a little effort into investing. But, in order for this to be successful we need to manage our emotions and increase our financial intelligence.","protected":false},"excerpt":{"rendered":"<p>2023 Portfolio As we enter 2023, I will lay out how my portfolio allocation will generally look based on my research and a sound approach to wealth building. We are now well into what we call the &#8220;Raging 20&#8217;s&#8221;. This is a time of several macro changes in the world that will effect investing and &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2022\/12\/my-2023-portfolio-setup-as-the-raging-20s-continue\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;My 2023 Portfolio Setup as the Raging 20&#8217;s Continue!&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12886,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16],"tags":[115,699,700],"class_list":["post-12878","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing","tag-investing","tag-portfolio","tag-portfolio-allocation"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/12\/0j7hPoExq5nGR1fgx-scaled.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12878","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12878"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12878\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12886"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12878"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12878"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12878"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}