{"id":12941,"date":"2023-01-07T09:00:18","date_gmt":"2023-01-07T17:00:18","guid":{"rendered":"http:\/\/198.199.80.40\/?p=12941"},"modified":"2023-12-30T14:24:51","modified_gmt":"2023-12-30T22:24:51","slug":"technology-good-bad","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/01\/technology-good-bad\/","title":{"rendered":"Technology Good Bad? Use the Internet to Be Stronger"},"content":{"rendered":"<h1>Technology Good Bad? Let&#8217;s Use Social Media &amp; Internet to Be Stronger!<\/h1>\n<p>Congratulations! We spent the last two decade as part of a vast social experiment using social media and the internet! How does it feel being a guinea pig? Now, how do we develop a healthy relationship with technology in order to build wealth and health?<\/p>\n<p>I am being cute here, but I think you get the idea. If you are over 40 you probably remember a world without 24\/7 connectivity. Or, do you remember a time walking around without a super computer in your pocket all day long? Let&#8217;s face it, things have changed. Children today are totally accustomed to 24 hour access to technology, entertainment, connectivity and sensationalism.<\/p>\n<blockquote>\n<h4>And I am not a luddite, I tend to embrace technology over time after I have experimented with it and tried to think about its implications. Technology is great and has offered our species the opportunity to grow and thrive. But as we know, technology also has a dark side. Take for example the ability to utilize nuclear power. Great advancement in some ways, sudden doom and destruction in another. There are thousands of examples like this all the way up to crypto currencies, great idea to cap the supply of an asset and hold digital value, can be used for nefarious purposes and be ultra volatile. The point is that every technology humans discover is always used for good and for bad; managing the bad is critical to our success.<\/h4>\n<\/blockquote>\n<h3><strong>Modern Parenting &amp; The Technology Good or Bad Challenge <\/strong><\/h3>\n<p>First of all, some modern parents are struggling with how to <a href=\"http:\/\/198.199.80.40\/2022\/01\/happiness-riding-the-u-shape-wave-of-life-5-ideas-2\/\" target=\"_blank\">expose children<\/a> to the benefits of technology. The internet and social media and mitigate what we know are potential negative consequences. The struggle is real and I am a firm believer that technology must be balanced for developing brains.<\/p>\n<h3><strong>Moderate<\/strong><\/h3>\n<p>Second, with a microchip in our head, our mammal brains can become overwhelmed by the amount of information and knowledge now at our finger tips. As a result, This can lead to stupid behavior in many facets of life. Even investing success can be deteriorated by an uncontrollable overwhelming stream of information.<\/p>\n<h3><strong>Set Timers<\/strong><\/h3>\n<p>Third, Real world time and virtual time need to be balanced in my opinion. There are times when we need to take the VR headset off, walk around the known world that we can smell, touch and connect with on a spiritual level. I believe every place on this planet can have some kind of beauty and value, make sure you are appreciating the beauty right outside your door.<\/p>\n<h3><strong>Play some Real Games<\/strong><\/h3>\n<p>One of the many reasons I enjoy games &amp; collectibles like <em>Magic the Gathering, Flesh &amp; Blood and Dungeon&#8217;s &amp; Dragons<\/em> is that it can bring real people together to use their imaginations, connect and communicate. People that live in the healthiest &#8220;blue zone&#8221; regions of the world tend to have strong social connections, many of which are face to face in the world.<\/p>\n<h3><strong>Self Monitor<\/strong><\/h3>\n<p>I use <a href=\"http:\/\/198.199.80.40\/2022\/03\/does-robinhood-lead-to-investing-addiction\/\" target=\"_blank\">social<\/a> media and all the internet tools, but I try to take a balanced approach. And if something starts to not feel right, I course correct. Here is an example: TIK TOK. I know people love it, but frankly after a couple weeks of using it I did not feel good. I was lost in it and wasted time. This was time I could have been exercising, being with family, talking with someone, writing, working on Money Vikings stuff, researching investments, etc.<\/p>\n<p>I am not saying drop it if you personally like it. But I needed to take stock of how I felt after using it and how much time I spent.<\/p>\n<h3><strong>The Good<\/strong><\/h3>\n<p>Do not get me wrong, it is not lost on me the many positive things coming from the internet and social media. We have powerful tools of communication and activism at our disposal. I have personally been able to publish books, learn new things, save time, invest efficiently, stay in touch with people across the world and much more all from our smart devices, etc. I am advocating for balance and taking stock of how these technologies, devices, algorithms, serve us.<\/p>\n<h3><strong>Monetization Opportunities<\/strong><\/h3>\n<p>There are so many ways now to make money using the internet as a tool. From Amazon stores, <a href=\"http:\/\/eBay.com\" target=\"_blank\" rel=\"noopener\">eBay<\/a>, <a href=\"https:\/\/fiver.com\" target=\"_blank\" rel=\"noopener\">fiver<\/a>, task rabbit, the list can go on for hundreds of ideas. As a result, we have so many more opportunities to make a few bucks from the internet.<\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Inspiration<\/strong><\/h3>\n<p>It can be a fine line between inspiration and envy. I would encourage folks to use the internet and social media for inspiration to improve their own lives. This is the whole concept behind Money Vikings. We have aimed for many years to present free ideas to become wealthier and healthier! We could not have done it without the technological tools currently available.<\/p>\n<h3><strong>Report &amp; Vote w\/ Your Clicks<\/strong><\/h3>\n<p>Social media and internet form to make money. If there is collateral damage along the way in the form of mental health or worse, the companies can tend to get away with it. As a result , it is also up to us to regulate, educate and report issues. If you really connect, we need to connect in a holistic way.<\/p>\n<p>Whether we like it or not, we are in this social media and real world together. We must find ways to support each other and make the systems stronger for all our benefits.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Technology Good Bad? Let&#8217;s Use Social Media &amp; Internet to Be Stronger! Congratulations! We spent the last two decade as part of a vast social experiment using social media and the internet! How does it feel being a guinea pig? Now, how do we develop a healthy relationship with technology in order to build wealth &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/01\/technology-good-bad\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Technology Good Bad? Use the Internet to Be Stronger&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":12944,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[3,502,13,21],"tags":[91,92,115,719],"class_list":["post-12941","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-apps","category-collectibles","category-health","category-psychology","tag-finance","tag-financial-freedom","tag-investing","tag-technology"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/01\/pexels-photo-4498457.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12941","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=12941"}],"version-history":[{"count":1,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12941\/revisions"}],"predecessor-version":[{"id":17617,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/12941\/revisions\/17617"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12944"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=12941"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=12941"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=12941"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}