{"id":16124,"date":"2023-05-29T12:36:10","date_gmt":"2023-05-29T19:36:10","guid":{"rendered":"http:\/\/198.199.80.40\/?p=16124"},"modified":"2023-05-29T12:36:10","modified_gmt":"2023-05-29T19:36:10","slug":"a-bear-market-investment","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/05\/a-bear-market-investment\/","title":{"rendered":"A &#8220;Viking&#8221; Bear Market Investment Strategy for the Raging 20&#8217;s"},"content":{"rendered":"<h3><strong>A Simple Approach in a Chaotic World &#8211; Be the Bear Market Investment God<\/strong><\/h3>\r\n<p>The Norse Gods Thor and Odin often took the shape of a bear to visit the human world. The bear stands for <b>strength, healing, inner wisdom and balance between the seen and the unseen world<\/b>.<\/p>\r\n<p>In investing we seem to collectively fear the bear, a period where stock indexes generally fall for some time. I challenge you to not fear the bear, but to be the bear and embrace the bear as part of the natural wealth building process. In this article I will outline several simple approaches that will help us navigate the next bear market.<\/p>\r\n<p>For more on this topic, check out our friend Jason over at the Antagonist. He creates an awesome blog and newsletter that truly helps people become better investors and build wealth! This article prescribes a simple bear market investment strategy that aims to mitigate losses, a key aspect of investment success.<\/p>\r\n<p><a href=\"https:\/\/antagonist.substack.com\/p\/a-simple-low-risk-investing-strategy\" target=\"_blank\" rel=\"noopener\">Antagonist Article on Papa Bear<\/a><\/p>\r\n<h3><strong>Raging 20&#8217;s<\/strong><\/h3>\r\n<p>I coined the term &#8220;raging 20&#8217;s&#8221; a few years ago as I realized this was going to be a turbulent decade. Part of my prediction came from my studies of international relations and globalization as an undergrad. Here is a quick history lesson for some insight into my thinking: After WW2, the US emerged as the preeminent power based on design, principles and fortuitous geography.<\/p>\r\n<blockquote>\r\n<h3>Basically, what I am saying is to buckle up, for there is no sign of the raging 20&#8217;s to stop, well, raging!<\/h3>\r\n<\/blockquote>\r\n<h3><strong>What Is An Investor to Do When a Bear Market Investment Strategy is Required?<\/strong><\/h3>\r\n<h3>Ok, so what Greg!? Build a bunker and load up on canned goods?<\/h3>\r\n<p>I am not trying to be alarmist, just have a clear eyed take on what is going on in the world to inform sound investment decisions. I am actually still quite optimistic on the long arc of human history. We always seem to make a way to survive, thrive and improve. But this does make me want to re-visit some sound back to basics investing principles that I believe will serve us well today and over the next decade.<\/p>\r\n<h3><strong>Why Back to Basics?<\/strong><\/h3>\r\n<p>With the last few years of pandemic craziness and meme stock madness, I believe it is time to re-commit ourselves to sound investing principles. Hey, I have no issue with taking 5% of my assets and throwing it at the next hot crypto or meme stock, but doing this with a large portfolio is highly risky and it could all disappear. How about we truly apply and understand sound investing principles that have stood the test of time, grown wealth and allowed us to sleep at night.  <\/p>\r\n<!-- \/wp:heading -->\r\n\r\n<!-- wp:paragraph -->\r\n<h3><strong>1. Asset Allocation, ETF&#8217;s, Mutual Funds<\/strong><\/h3>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>Never forget to look at your portfolio of assets as a whole and determine what percentage is in the various asset classes. Is it an effective allocation? Take a step back. How do you divide your portfolio among different asset categories? This may be the biggest determinant of your investment returns. I find this is where many investors fail because they put little thought or effort into their asset allocation strategy.<\/p>\r\n<p><strong>Less individual stock<\/strong><\/p>\r\n<p>During market conditions such as these, it becomes increasingly hard to pick the individual market winners. In general I am doing less individual stock picks and focusing more on diversified ETF&#8217;s and funds that either own the market and self cleanse or own particular aspects of the markets.<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>For me personally, I want to harness the tailwinds of bull markets and blunt the impacts of bear markets\/recessions. I do this through strategic minor adjustments to asset allocations during different investment periods. Most people have a portfolio that does well in good market times and does poorly when the overall market goes down. Think about overall portfolio construction in terms of what percentage of the following you may hold:<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p><strong>A.-Stocks (equities)<\/strong>, and within this category how much is small caps, mid caps, large caps. How much is growth vs. value stocks. How much is international, tech, etc.?<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p><strong>B.-Bonds (fixed income)<\/strong>, what is the quality of the bond ratings? Is the fund sufficiently diversified? How much to allocate to bonds typically depends on risk tolerance and age. Bonds are a lending asset vs. ownership. You are lending your money to an entity to do something, and the issuer returns a fixed percentage back to you over time.<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p><strong>C.-Cash,<\/strong> how much is being held in cash? This is typically rainy day emergency money or money that sits waiting for big investment opportunities.<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p><strong>D.-Alternative assets:<\/strong> Gold, crypto, etc. can be considered alternatives and generally more risky, but could have a small place in a well balanced approach.<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p><strong>E.-Hard assets<\/strong>: real estate is an example here of an asset that is tangible and manageable. Is there a place for these kinds of assets?  <\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph --><!-- \/wp:paragraph -->\r\n\r\n<!-- wp:heading {\"level\":3} -->\r\n<h3><strong>2. Dollar Cost Averaging &amp; Automation<\/strong><\/h3>\r\n<!-- \/wp:heading -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>This is the time for dollar cost averaging to really help to grow wealth. If you are automating a certain percentage of your income each month to index funds, right now you are adding shares on discount compared to last year. These are the times when this engine really gets going! I would not miss this opportunity to add shares on sale.<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p><strong>Never Cashing Out<\/strong><\/p>\r\n<p>Remember, your month to month account balance does not really matter. You are building a cash flow passive income machine. This can help us never freak out and dump our portfolio out of fear.<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:heading {\"level\":3} -->\r\n<h3><strong>3. Diversify Strategically<\/strong><\/h3>\r\n<!-- \/wp:heading -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>I think strategic diversification is most effective when we are harnessing the power of macro trends. For example, the world is aging and will need more medicines, therefore I may add a but more healthcare or Pharma exposure to a portfolio. This type of diversification is also critical because it can be hard to pick individual winning stocks. Strategic diversification delivers enormous benefits. It can be quite hard for example to pick individual stock winners in competitive industries. But we still may want to capture gains in particular thematic areas. This is a main reason I choose many thematic ETF&#8217;s. I am not saying to randomly diversify, I am saying be thoughtful about overall portfolio construction. If heavy in growth tech, perhaps add some value ETF&#8217;s. Try and add some uncorrelated assets. Perhaps some crypto is a good place to diversify into uncharted territory?<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>Both under diversification and over diversification are common mistakes made in portfolio management. Most studies show optimization occurs somewhere between 15 and 30 individual investments. I have found beyond this becomes too much to manage and may provide diminishing returns. I like to have some classic plays like a solid S&amp;P dividend ETF (may favorite is VDADX), a bond fund and a few core holdings that I do not touch. I pad this with exposure to sector ETF&#8217;s and some individual stocks that I believe are good mid term plays. I sprinkle in 2-3% crypto, 10% REIT&#8217;s and Real Estate, 10% international and I have diversified pretty well.  <\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:heading {\"level\":3} -->\r\n<h3><strong>4. Invest For the Long Term<\/strong><\/h3>\r\n<!-- \/wp:heading -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>Yes, I like to take 5% of assets and do short term trades. But 95% of assets are in investments. Effective investors realize if you buy an investment at a favorable price it may take time for the market to recognize its true value. Time is the secret of good old Warren Buffett and Charlie Munger:<\/p>\r\n<p><div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Wisdom of Munger (The Truth About How to be Rich!)\" width=\"640\" height=\"480\" src=\"https:\/\/www.youtube.com\/embed\/aLmmqYHN_Ow?start=5&#038;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div><\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>Long term investing is one of the most important investing principles because short term trading usually leads to poor long term performance. This is common because many investors let fear and greed cause them to make bad decisions. The long term will take care of itself if you make wise investment decisions. PASSIVE INCOME MACHINES: I like to discuss PIM (passive income machines) as much as possible because it helps people keep the long term in mind when looking at their account balances. The ideal situation is that there should never be a day when you cash everything out of an investment account. Instead, we should look at the account like a small business we own that has the potential to spin off income each and every month and hopefully grow over the long run.  <\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:heading {\"level\":3} -->\r\n<h3><strong>5. Keep Expenses Low<\/strong><\/h3>\r\n<!-- \/wp:heading -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>Most investors don’t realize how much difference high expenses make to their portfolio. Take a look at the what happens to your returns with a 1% higher expense ratio; On a $100k investment over 30 years, a .4% expense ratio vs. a 1.4% ratio, seems like only 1%. It adds up to $146k lost in fees!!!<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p><strong>The bottomline , over a 30 year period, an increase in expenses of 1% can cost your portfolio <\/strong>dearly.  <\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:heading {\"level\":3} -->\r\n<h3><strong>6. Do Not Forget About Compounding<\/strong><\/h3>\r\n<!-- \/wp:heading -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>Compounding is a powerful financial concept but it needs time to take hold. It is like planting a young fruit tree, it takes time for the fruit to mature and arrive. I specifically like the power of dividend growth compounding. Basically, every dollar made over time that is reinvested makes even more dollars. Make sure you enable DRIP (dividend reinvestment in your brokerage for dividend stocks and ETFs). I have seen this work effectively with my positions in Realty Income (O) &amp; Pfizer (PFE) over the years. The share prices have done ok, but the dividends have kept coming and I had them reinvested. During down times they bought more shares and during the up times those increased number of shares rose the entire accounts value.<\/p>\r\n<p><div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Using the &quot;Investing Trifecta&quot; to Build Wealth\" width=\"640\" height=\"480\" src=\"https:\/\/www.youtube.com\/embed\/2y3HjFc6b3Y?start=117&#038;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div><\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>&nbsp;<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:heading {\"level\":3} -->\r\n<h3><strong>7. Anticipate Market Volatility and Use Risk Management<\/strong><\/h3>\r\n<!-- \/wp:heading -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>Markets are typically manic depressive. One day up, one day down and on and on. You can control your portfolio volatility but you cannot control the inevitable volatility of investment markets. Therefore, you should be prepared to take advantage of investment opportunities. At the same time, you need to be cognizant of overvalued assets and be willing to move to cash when conditions are unfavorable. Admittedly, this is not easy, but with a sound approach it can be done in many conditions.<\/p>\r\n<h3><strong>The Ultimate Guide to Investing<\/strong><\/h3>\r\n<p><iframe loading=\"lazy\" title=\"Conquer Financial Freedom: Living a Life of True Wealth\" type=\"text\/html\" width=\"640\" height=\"550\" frameborder=\"0\" allowfullscreen style=\"max-width:100%\" src=\"https:\/\/read.amazon.com\/kp\/card?preview=inline&#038;linkCode=kpd&#038;ref_=k4w_oembed_YKFppuazmZeyQX&#038;asin=B0BRJW92XV&#038;tag=kpembed-20\"><\/iframe><\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:heading {\"level\":3} -->\r\n<h3><strong>Manage Your Own Destiny<\/strong><\/h3>\r\n<!-- \/wp:heading -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>There are all kinds of investment advisors out there that will lead people astray. We need to educate ourselves and take charge of our own financial situation. And this is not easy in a sometimes confusing environment with a lot of noise. We want to be less noise and more signal. I hope these concepts help you develop your own bear market investment strategy.<\/p>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p>Technology and the internet have brought down transaction costs and provide the means to get information and guidance at a very low cost. There has never been a better time period for the self-directed investor who is willing to put a little effort into investing. But, in order for this to be successful we need to manage our emotions and increase our financial intelligence.<\/p>\r\n<h3><strong>Investing Is Not Gambling<\/strong><\/h3>\r\n<!-- \/wp:paragraph -->\r\n\r\n<!-- wp:paragraph -->\r\n<p><div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"How To Invest In A Bear Market\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/sIxNyvWRl80?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div><\/p>","protected":false},"excerpt":{"rendered":"<p>A Simple Approach in a Chaotic World &#8211; Be the Bear Market Investment God The Norse Gods Thor and Odin often took the shape of a bear to visit the human world. The bear stands for strength, healing, inner wisdom and balance between the seen and the unseen world. In investing we seem to collectively &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/05\/a-bear-market-investment\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;A &#8220;Viking&#8221; Bear Market Investment Strategy for the Raging 20&#8217;s&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":16135,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[16],"tags":[],"class_list":["post-16124","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/05\/bear-market-investment-strategy.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/16124","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=16124"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/16124\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/16135"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=16124"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=16124"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=16124"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}