{"id":16381,"date":"2023-07-02T20:34:18","date_gmt":"2023-07-03T03:34:18","guid":{"rendered":"http:\/\/198.199.80.40\/?p=16381"},"modified":"2023-07-06T17:35:33","modified_gmt":"2023-07-07T00:35:33","slug":"how-much-house-can-you-afford","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2023\/07\/how-much-house-can-you-afford\/","title":{"rendered":"How Much House Can You Afford? (salary required to conquer the housing game)"},"content":{"rendered":"\n<p>This is a tricky time in home buying history. How much house can you afford is a critical question? This is just the beginning of the decisions and analysis required for success in home ownership. In fact, all high school students in this country should be required to take a class about home ownership in my view.<\/p>\n\n\n\n<div class=\"wp-block-rank-math-toc-block\" id=\"rank-math-toc\"><h2>Table of Contents<\/h2><nav><ul><li><a href=\"#current-challenges\">Current Challenges<\/a><\/li><li><a href=\"#american-dream\">American Dream?<\/a><\/li><li><a href=\"#home-ownership-can-offer-some-of-the-following-intangible-and-tangible-benefits\">Home ownership can offer some of the following intangible and tangible benefits:<\/a><\/li><li><a href=\"#rents-rise\">Rents Rise<\/a><\/li><li><a href=\"#values-rise\">Values Rise<\/a><\/li><li><a href=\"#location\">Location<\/a><\/li><li><a href=\"#long-term-investment\">Long Term Investment<\/a><\/li><li><a href=\"#options\">Options<\/a><\/li><\/ul><\/nav><\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"current-challenges\"><strong>Current Challenges<\/strong><\/h3>\n\n\n\n<p>Higher interest rates, intense competition, low supply, uncertain personal finances can make for a complicated labyrinth to home ownership. But keep a historical perspective in mind. When starting out, it can almost always be a tricky thing to really determine how much house you can afford and is it the right decision for your particular True Wealth journey?<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"american-dream\"><strong>American Dream?<\/strong><\/h3>\n\n\n\n<p>Although I still personally believe in the concepts and principles of home ownership, I can clearly see it is not right for everyone. And that is ok. A person can live a completely happy life without owning a home. Home ownership has been a cornerstone of the so called American Dream for decades. This leads to the question, how much house can you afford?<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"home-ownership-can-offer-some-of-the-following-intangible-and-tangible-benefits\"><strong>Home ownership can offer some of the following intangible and tangible benefits:<\/strong><\/h3>\n\n\n\n\n\n<h3 class=\"wp-block-heading\" id=\"rents-rise\"><strong>Rents Rise<\/strong><\/h3>\n\n\n\n<p>When you own your own home or condo, generally speaking the monthly payment is set. Yes, maintenance and taxes may fluctuate a bit, but the monthly principal and interest payment if financed is set for life. This is not the case with rent. Rent tends to go up every year, typically around 3-5%. Sometimes even more depending on the situation.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"values-rise\"><strong>Values Rise<\/strong><\/h3>\n\n\n\n<p>Over the long run, the value of real estate rises. Typically this is tied to the value of the land. This is why location is so critical which I explain next.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"location\"><strong>Location<\/strong><\/h3>\n\n\n\n<p>It is a cliche by now, but after a couple decades working in <a href=\"http:\/\/198.199.80.40\/2021\/09\/are-your-prepared-for-real-estate-investing-a-comprehensive-list\/\" target=\"_blank\">real estate<\/a>, it is really all about location, location, location! This does not mean that we need to all live in the fanciest location, but location needs to be thought of as a critical element.<\/p>\n\n\n\n<p>First of all the location needs to be relatively safe from destructive forces of nature. Homes in the middle of a hurricane zone or coastal flood zone are going to have trouble and risks over the long run.<\/p>\n\n\n\n<p>Location also needs to take into account the surrounding community and amenities. Are the schools good? Are the roads well maintained? Are the taxes used appropriately and do zoning restrictions make sense?<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"long-term-investment\"><strong>Long Term Investment<\/strong><\/h3>\n\n\n\n<p>Home ownership really only seems to make sense as a long term investment. Those I have known that have really made or stocked high equity have stayed in their homes for a long time.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"options\"><strong>Options<\/strong><\/h3>\n\n\n\n<p><p>Home ownership gives the owner more control and options as time passes. It is typically better to have more options as time goes on vs less. The house can be sold to take the profits or reconfigured to a desired style or taste.<\/p>\n<h3><strong>Pride of Ownership and Community Building<\/strong><\/h3>\n<p>If we are invested in something and have a sense of ownership, we typically care more about it. If we own a home in a specific area, we have a vested interest in seeing that area thrive in terms of development, crime management, cleanliness and more.<\/p><\/p>\n\n\n\n\n<h3><strong>Why Not to Invest in Real Estate<\/strong><\/h3>\n<p>There are certainly downsides to owning a home or real estate in general. For one, when something goes wrong you must manage all repairs. You must identify trusted contractors to assist in keeping the property well maintained over the decades. Houses are tangible things exposed to the elements all the time. Stuff breaks. Check out all our reasons why h<a href=\"http:\/\/198.199.80.40\/2023\/03\/real-estate-home-tom-hanks\/\" target=\"_blank\">omeownership can suck<\/a> so you have all the information you need to make an informed decision.<\/p>\n<p><div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"4 Reasons Not To Invest In Real Estate (the truth)\" width=\"640\" height=\"480\" src=\"https:\/\/www.youtube.com\/embed\/BQNXmkkddEg?start=2&#038;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div><\/p>\n<h3><strong>Tips for Homebuying Success<\/strong><\/h3>\n<p>When buying a home, it&#8217;s important to follow certain rules to ensure a successful and satisfactory purchase. Here are five rules to consider:<\/p>\n<p>Set a Realistic Budget: Determine how much you can afford to spend on a home by carefully evaluating your financial situation. Consider your income, expenses, and long-term financial goals. Set a budget that includes not only the purchase price but also additional costs like closing costs, maintenance, and property taxes. Stick to your budget to avoid financial strain in the future. Get<\/p>\n<p>Pre-Approved for a Mortgage: Before you start house hunting, it&#8217;s beneficial to get pre-approved for a mortgage. This process involves a lender evaluating your financial information to determine how much they are willing to lend you. Having a pre-approval letter shows sellers that you are a serious buyer and can give you an advantage in competitive markets.<\/p>\n<p>Hire a Qualified Real Estate Agent: A skilled real estate agent can provide valuable guidance throughout the home-buying process. Look for an agent who has experience in the local market, understands your needs and preferences, and has a track record of successful transactions. They can help you find suitable properties, negotiate offers, and navigate complex paperwork.<\/p>\n<p>Conduct Thorough Inspections: Once you find a home you&#8217;re interested in, it&#8217;s essential to conduct thorough inspections. Hire a professional home inspector to assess the property&#8217;s condition, identify any potential issues or repairs, and estimate maintenance costs. This information helps you make an informed decision and negotiate repairs or price adjustments, if necessary.<\/p>\n<p>Perform Due Diligence: Before closing the deal, conduct due diligence on the property and its surroundings. Research the neighborhood, nearby amenities, schools, transportation, and any other factors important to you. Consider future developments or potential issues that may affect the property&#8217;s value or your quality of life. This information ensures you are fully informed about your investment.<\/p>\n<h3><strong>How Much House Can You Afford?<\/strong><\/h3>\n<p>It is not alway a good thing to own the biggest and most expensive house possible. In fact, family fortunes like the Vanderbilts were wasted on big fancy houses.<\/p>\n<p>We should seek to buy a house that is right for us:<\/p>\n<h3><strong>-right location<\/strong><\/h3>\n<h3><strong>-right size for your family<\/strong><\/h3>\n<h3><strong>-right lifestyle (city, country, suburb)<\/strong><\/h3>\n<h3><strong>-right price<\/strong><\/h3>\n<p>So with that, how much can you afford?<\/p>\n<h3><strong>28-30% rule for mortgages<\/strong><\/h3>\n<p>Most people need a mortgage to buy a house, especially in high cost of living regions. The first thing to consider is that a mortgage payment is comprised of principal, interest, taxes and insurance. These costs combined should not exceed 28-30% of your gross monthly take home pay. Total debt should not be over 36% of gross monthly pay. Therefore, here are estimated mortgage caps for various salaries:<\/p>\n<h3><strong>$100,000\/year<\/strong><\/h3>\n<p>I am starting at this salary because the sad reality is that below this income it is very hard to own a home in the US. The average home price in the US is about $350,000 in 2023. Housing is obviously very specific to certain locations, cities and states and can vary widely.<\/p>\n<p>This is the salary when people nowadays really start to feel like they are getting ahead. Many dual income families are able to pull in about $100k. One can certainly do fine on lower salaries, but this seems to be when some wealth building can really kick in.<\/p>\n<p>For this estimate we are assuming other monthly debts of $250\/month and a down payment of $20,000. Monthly debts and down payment levels can swing this calculation, therefore use current calculators and discuss with a loan advisor your particular situation. At current average interest rates, this person can afford about a <strong>$370,000 home.<\/strong><\/p>\n<h3><strong>$150,000\/year<\/strong><\/h3>\n<p>Assuming again, $250\/month in other debts and a $40k down payment. This person can afford about a <strong>$580,00 house.<\/strong><\/p>\n<p>For a more specific analysis use the <a href=\"https:\/\/www.nerdwallet.com\/mortgages\/how-much-house-can-i-afford\/calculate-affordability?trk=nw_gn_5.0\" target=\"_blank\" rel=\"noopener\">Nerd Wallet Mortgage Calculator here.<\/a><\/p>\n<p>Zillow also has a well designed <a href=\"https:\/\/www.zillow.com\/mortgage-calculator\/house-affordability\/\" target=\"_blank\" rel=\"noopener\">affordability calculator.<\/a><\/p>\n<h3><strong>Other Houses Always Come<\/strong><\/h3>\n<p>People tend to get fixated on what they determine to be their &#8220;dream home.&#8221; I have always found that with time other suitable houses arrive on the market for offers. But buying real estate is unlike other products. It is very specific to an individuals requirements, needs, desires and more. Following these rules can help you navigate the home-buying process successfully. Remember to take your time, ask questions, and consult professionals when needed. Buying a home is a significant decision, and thorough preparation is key to making an informed and satisfying purchase. &nbsp;<\/p>\n<h3><strong>How Did I Do It?<\/strong><\/h3>\n<p>The old fashioned way, lived below my means in order to sock money away for a down payment, improved my credit, secured stable employment and then bought a house I could afford. It wasn&#8217;t fancy, but got me started.<\/p>\n<p><div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"How Much Housing Can You ACTUALLY Afford? (By Salary)\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/4MKw7Ad7ZtU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div><\/p>","protected":false},"excerpt":{"rendered":"<p>This is a tricky time in home buying history. How much house can you afford is a critical question? This is just the beginning of the decisions and analysis required for success in home ownership. In fact, all high school students in this country should be required to take a class about home ownership in &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2023\/07\/how-much-house-can-you-afford\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;How Much House Can You Afford? (salary required to conquer the housing game)&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":16411,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[14,16,22],"tags":[],"class_list":["post-16381","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-home","category-investing","category-real-estate"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2023\/07\/how-much-house-can-you-afford.jpg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/16381","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=16381"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/16381\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/16411"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=16381"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=16381"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=16381"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}