{"id":761,"date":"2021-07-26T00:43:21","date_gmt":"2021-07-26T00:43:21","guid":{"rendered":"https:\/\/premium.moneyvikings.com\/?p=761"},"modified":"2022-03-06T22:48:59","modified_gmt":"2022-03-06T22:48:59","slug":"everything-seems-overvalued-for-now","status":"publish","type":"post","link":"https:\/\/truewealth.moneyvikings.com\/2021\/07\/everything-seems-overvalued-for-now\/","title":{"rendered":"Everything Seems Overvalued for Now"},"content":{"rendered":"<p><\/p>\r\n<ul class=\"wp-block-list\">\r\n<li>Assets across the board seem fully valued and recovered strongly from the pandemic.<\/li>\r\n<li>Hard to find deals or deep value out there.<\/li>\r\n<li>We discuss the potential for a stock market slowdown, (Is another one around the corner?)<\/li>\r\n<li>How to prepare and what to do with this information?<\/li>\r\n<li>Is there an ideal portfolio composition that can weather a crash? Are there specific ETF&#8217;s or uncorrelated assets I can use to mitigate risk?<\/li>\r\n<li>Know the difference between &#8220;the market&#8221; and your individual portfolio.<\/li>\r\n<\/ul>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>The stock market seems to &#8220;crash&#8221; every so often. No one knows if a crash is around the corner, but the market sure seems fully valued at the moment! Many are predicting a correction. But this is no reasons to panic, just prepare. Remember that history tells us the market always comes back.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Over the last 100 years the market occasionally crashes. At the moment, things feel a bit strange because the broader market and most assets are at all time highs coming out of a major pandemic. It is usually caused by some combination of market problems, societal\/economic issues and fueled by mass psychology\/herd mentality. Some notable examples were the 1929 Great Depression, Black Monday in 1987, the 2001 Dotcom bubble bursting, the 2008 financial and housing crisis, and the 2020 Covid 19 pandemic.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>Economic Cycles<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>The economy seems to go through large scale cycles through the years. There will be many years of growth and then a period of slow down. We seem to be at the end of a massive growth period. This does not mean a crash is right around the corner, but returns could be lower for a while.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Many folks have now lived through several of these crashes. I am now convinced that these were great investing opportunities, and time has shown the market always comes back.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<figure><img decoding=\"async\" src=\"https:\/\/themoneyvikings.net\/wp-content\/uploads\/2021\/06\/image-1024x449.png\" alt=\"\"><\/figure>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Given this information one may be scared of investing or &#8220;crashes&#8221; for that matter. BUT, one must take the above chart very seriously to keep everything in perspective. No matter how many times the stock market crashes, <strong>the next one feels just as unexpected and just as painful. <\/strong><strong>How should you protect yourself from the next market crash?<\/strong> First, you must understand why crashes happen.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>What is the Problem Now?<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>The only thing we really know for sure is that another crash will happen eventually. No one can tell us when. But we may be able to guess at what might cause it:<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<ul class=\"wp-block-list\">\r\n<li><strong>meme stock mania<\/strong><\/li>\r\n<li><strong>New coronavirus variants?<\/strong><\/li>\r\n<li><strong>easy money printing<\/strong><\/li>\r\n<li><strong>over heating post pandemic &amp; related inflation<\/strong><\/li>\r\n<li><strong>Another pandemic<\/strong><\/li>\r\n<li><strong>crypto mania<\/strong><\/li>\r\n<li><strong>climate change devastation<\/strong><\/li>\r\n<li><strong>WWIII&#8230;<\/strong><\/li>\r\n<li><strong>Black Swan event not many see coming?<\/strong><\/li>\r\n<\/ul>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>There seem to be several risk factors brewing at the moment. First we are living in a strange &#8220;meme stock&#8221; era where valuations of companies are becoming completely divorced of fundamentals. GameStop and AMC can lose money hand over fist and see their stock prices skyrocket. There are many other examples of this. Where is it all headed, we don&#8217;t fully know, but in the long run I am not sure how a company can maintain a high stock price and make small amounts of money. Some companies can do this as they build out a new technology (i.e Amazon), but not many can.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Any one of the things listed above could spark a stock market crash, or it could be something no one ever saw coming. And there are other risks that some see coming, but no one listens or invests in preparedness. So what is an individual investor to do?<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>Don&#8217;t Panic, Prepare!<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>As someone who has now lived (and invested) through many of these crashes, the first thing is to not panic. Panic is making decisions based on fear. I should add a discussion about fear in our list of <a href=\"https:\/\/themoneyvikings.net\/2019\/12\/15\/psychological-money-tricks-ch-4-of-conquer-financial-freedom\/\" target=\"_blank\" rel=\"noopener\">psychological money tricks.<\/a><\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>But the point here is for us to prepare, not panic. For me personally, preparing means having a well structured and fortified overall portfolio. Sure, I will most likely be hit by a market swoon given exposure to major indexes. But what is the overall asset and portfolio structure? Is it too heavily invested in one market or company? Below we list a few ways we are preparing for any major market fluctuations.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>What Casuses a Stock Market Crash?<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>A stock market crash is a social phenomenon. It is a human-created series of events triggered by economic factors and crowd behavior psychology.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Stock market crashes happen when these 4 factors occur together:<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<ul class=\"wp-block-list\">\r\n<li>Stock market prices have been increasing for a long time.<\/li>\r\n<li>Everyone is overly optimistic about the future.<\/li>\r\n<li>The P\/E ratio of the market today is higher than the historical averages.<\/li>\r\n<li>People borrow money to buy things at a high debt-to-equity ratio.<\/li>\r\n<\/ul>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>ReadyFor401k&#8217;s Analysis, SEE RELATED:<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><a href=\"https:\/\/themoneyvikings.net\/2021\/03\/06\/stock-market-spy-crash-prediction-and-explanation-by-readyfor401k\/\" target=\"_blank\" rel=\"noopener\">Market Headed For Crash?<\/a><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>Crashes, the chance of a lifetime<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>In an ideal world a crash would occur right before you invested a ton of capital into the market. In other words, you would be buying tons of assets on a bargain sale. This is what Warren Buffett means when he says &#8220;be fearful when everyone is greedy and greedy when everyone is fearful&#8221;. When the masses believe the sky is falling and start selling in panic mode, quality assets can go on sale. Every crash or correction is an opportunity for patient investors to make money. Every huge drop in the stock market (major indexes) is erased by a bull-market rally. When the next crash does occur, the following five high-conviction stocks can be confidently bought hand over fist.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>When Things Crash, Remember The Time Tested Rules<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Markets go up and down, up and down. But value is mainly made over long periods of time through diversified accounts of quality companies, such as through <a href=\"https:\/\/themoneyvikings.net\/2018\/11\/20\/bogleheads-vanguard-investing-101\/\" target=\"_blank\" rel=\"noopener\">Vanguard “Boglehead” Investing<\/a>. Remember the old Graham quote:<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<blockquote class=\"is-layout-flow wp-block-quote-is-layout-flow\">\r\n<p>“In the short run the stock market is a voting machine, in the long run it is a weighing machine”<\/p>\r\n<\/blockquote>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Public and popular opinion is fickle and subject to herd mentality. It doesn’t matter in the moment what the herd is thinking, it matters if a company provides value and turns a profit. It is just a natural way of the Universe of building and destroying and building and destroying… Not even the ancient pyramids are forever, they too are disolving into dust in spite of the Kings mustering the forced labor of millions of people. Over long periods of time, high quality assets go up in value because they provide value to others. If the asset provides value then it will rise in value again someday.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h3 class=\"wp-block-heading\">Steady Recovery from 2008<\/h3>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>By 2012, the United States stock market is on the upswing. Between 2010 to 2017, the stock market price increased by 215%, which is an average of 12% growth rate every year for over eight years. Toward the end of 2017, the United States government passed a sweeping tax cut that among many changes, cut the corporate profit tax from 35% to 21%. The new law sent the stock to an all-time high, again. Many smart people thought the 2008 recovery maxed out by 2016. Little did they know that 2016 is only the start of another bull run!<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\">Should I Sell?<\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Based on several metrics, it seems the stock market is overvalued or &#8220;fully priced&#8221; as of today. Should you sell?<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Here is the nuance. If you think the market is over valued and a crash is coming, then perhaps the right move is to ensure your portfolio is designed to withstand shocks. Or, you could rest assured that historically every single crash has resulted in growth of the market over the medium and long run.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Why and When Do I Sell Anything?<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>I sell when I require the capital for other uses or to re balance the portfolio, not because I think some crash is imminent.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Below, I’ll give you <strong>four reasons why you should never try to act smart by “buying low and selling high” no matter how confident you are:<\/strong><\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<ol class=\"wp-block-list\">\r\n<li>Stock prices overall can be statistically RANDOM.<\/li>\r\n<li>It’s IMPOSSIBLE to time the market (might as well call it gambling).<\/li>\r\n<li>Being optimistic OR pessimistic about the market hurt us equally. Solution? Don’t feel. Inaction is the best action.<\/li>\r\n<li>Over the next decades, stocks will always go up more than they go down.<\/li>\r\n<\/ol>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>Why Does It Always Recover?<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>There are several major reasons the market in general always recovers. Life basically always goes on. Unless we are wiped out by a meteorite, alien species or climate change; the economy will just continue to churn. People want to eat, live, build, have fun, make new things, add value, raise families. All that stuff takes thousands of products and services.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h1 class=\"wp-block-heading\">Quality Dividend Payers<\/h1>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>For the reasons above, I am currently tilting the portfolio towards quality dividend payers. The main reason is because we as investors are stuck between a rock and a hard place. Savers are punished by low interest rates, which encourages people to spend or invest.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Investing in high quality dividend players gives you the advantage of beating inflation, preserving wealth, and with compounding perhaps growing your wealth.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p><strong>SEE RELATED<\/strong>: <a href=\"https:\/\/themoneyvikings.net\/2021\/07\/10\/3353-passive-dividend-income\/\" target=\"_blank\" rel=\"noopener\">My Dividend Portfolio<\/a><\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\">Dividend Income Stream<\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>As one of several future streams, we focus a lot on creating strong dividend portfolios that produce cash flow. Dividends are cool because some companies spin off a small portion of the profits to the shareholders, these are the dividends. There are several things I like about dividend income investing. First of all, a dividend portfolio can be built over time, one brick at a time. This is different from say real estate investing or investing in a small business that you operate. A real estate purchase or small business can take a huge amount of capital and time to get started. With dividend stock investing, a person can purchase a couple of shares each paycheck, and slowly and steadily build up a portfolio that produces income. I can make adjustments along the way if I see more attractive dividend options. See my current dividend income portfolio that produces about $1,000\/year in profit:<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<figure>https:\/\/themoneyvikings.net\/2018\/10\/07\/dividend-income-update-over-1000-year\/<\/figure>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Another thing we like about dividends is that we think less about the per share price. Markets can fluctuate up and down wildly. In fact, when I am focused on dividends, in some ways I want the per share price to go down so I can load up on more stock. This is similar to the &#8220;value&#8221; approach that Warren Buffett has employed all these years. When good companies are out of favor, he swoops in and buys as many shares as possible.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>And finally, I really like harnessing the power of compounding specifically with dividends and DRIPS (Dividend Reinvestment Plans). This is where you have the dividends reinvested automatically to buy more stock. This becomes a compounding feedback loop that has lead to many of Warren Buffett’s great returns.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Jerry and I enjoy allocating about 10% of our portfolios to invest in individual dividend producing stocks. We do this to make a return on our personal capital and to learn. I enjoy the process of learning about great American businesses and building a dividend focused portfolio. At some point, these dividend portfolios will make up one of several passive income machines. If a person is not into picking individual stocks, another way to play the dividend game simply is to invest in a straightforward low cost dividend S&amp;P 500 exchange traded fund. One good example is the SPDR S&amp;P 500 Dividend ETF.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\">DIVIDEND “VIKING” KINGS<\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>There are certain companies called “Dividend Kings” because they are categorized as the safest dividend producing stocks one can invest in. They have increased their dividend for 50 or more years. This means the company has demonstrated growth, reliability and stability.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>There are also “Dividend Aristocrats” who have demonstrated a 25 year streak of dividend increases. In my view, as part of a balanced and managed portfolio, it is hard to go wrong with these stellar companies. There is of course risk associated with all investing, but these tend to be the tried and true companies that have a long productive life.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>In order for a company to be a Dividend King or Aristocrat, they typically need to exhibit the following attributes:<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<ul class=\"wp-block-list\">\r\n<li>A sustainable business model. (Do they make a product people want or like?)<\/li>\r\n<li>Financial fortitude. (Do they have reserves?)<\/li>\r\n<li>Efficiency in allocation of capital (Are they putting their money into the right internal investments, machinery, marketing, etc.)<\/li>\r\n<li>Committed to the shareholder (Do they feel an obligation to take care of the shareholders and hold their interests in high regard?)<\/li>\r\n<li>Good management teams (Are the right people with the right skills sets in the right place?)<\/li>\r\n<\/ul>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>These tend to be the attributes that enable a company to thrive and survive over the long term. By the way, these are similar attributes that Warren Buffett looks for when he is investing in companies for the long run.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h1 class=\"wp-block-heading\">RELATED: YOU’LL GET 3 BIG FINANCIAL OPPORTUNITIES IN LIFE<\/h1>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>After years of investing and talking with many self-made wealthy people, <strong>I am convinced that we have about 3-4 big financial opportunities to make quantum leaps in building our net worth.<\/strong> In order to reach F.I.R.E. we need to leverage each one of these opportunities. And it seems that many times these opportunities occur when it seems like everything is crashing down around us. Are you preparing now to be able to jump on the next opportunity?<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h1 class=\"wp-block-heading\"><strong>Prepare For Financial Opportunities<\/strong><\/h1>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>These opportunities can come in many forms. It can be out of the ashes of economic disaster or through diligent and disciplined investment over time. But the key factors are planning, timing and time. I can prove that this is a real thing. The world’s greatest investor, Mr. Warren Buffet of Berkshire Hathaway, is currently sitting on over $130 Billion in cash. Let that sink in for a minute. He isn’t buying more stock with it right now.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Why would he be sitting on that much cash? It is simple, he is waiting patiently and preparing for the next big opportunity. And I believe as individuals we should also be preparing and waiting patiently, because it will come.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h3 class=\"wp-block-heading\">HOW TO PREPARE FOR FINANCIAL OPPORTUNITIES (Or Crashes)<\/h3>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>My wife calls me a planner and I really appreciate the compliment. Because something will happen again that we do not expect. Real estate could hit a snag, an economic crisis could begin, there could be terrorism or international conflict. Something could happen to beloved stocks that Wall Street loves. Look at what has happened with Facebook lately and will continue to go on. How can we be prepared for the next opportunity (aka crash):<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h3 class=\"wp-block-heading\"><strong>a. Reduce The Debt<\/strong><\/h3>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Needless to say, people that are in extreme amounts of toxic debt are the opposite of prepared. In fact, they are most at risk when the next shock comes. I know the recession was hard on everyone, but the people in huge debt had major life disruptions.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h3 class=\"wp-block-heading\"><strong>b. Have Cash &amp; Assets<\/strong><\/h3>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Why not be like Mr. Buffett? Start a cash stash for when the next opportunity comes. In the short run it could go on deep discount. You will only be ready if you have the cash to pounce on the opportunity.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h3 class=\"wp-block-heading\"><strong>c. Diversify Income Streams And Asset Classes<\/strong><\/h3>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Now is the time to develop side hustles and skills. Perhaps we can develop different income streams. Now that times are good is the time to think: what if I lose my job? Our primitive brains live in the moment and have a hard time understanding that things could be different in the future. Different is not necessarily bad, it is just something we have to be able to absorb and adapt too. In addition, we should be thinking now about our exposure to various asset classes. Are we prepared if stocks take a dip?<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>The other part of diversification is to study and try to understand uncorrelated assets. There are times when stocks fall and bonds go up. Or perhaps real estate and commodities stay resilient while large companies faulter.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>d. Risk Management &amp; Portfolio Allocations<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>For me, it&#8217;s about risk management and portfolio allocation. In a way, all portfolio construction is about risk management. If we had a crystal ball and knew exactly what investment was going to provide superior returns, all we would do is invest in that one thing. But alas, we do not. Therefore I use the <a href=\"https:\/\/themoneyvikings.net\/2021\/06\/14\/my-ride-my-bike-portfolio-no-worries-portfolio\/\" target=\"_blank\" rel=\"noopener\">RIDE MY BIKE PORTFOLIO<\/a> to manage risk and be resilient against market and world uncertainty.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>e. Quality<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Another strategy I like to deploy at times like these is to focus part of a portfolio on quality. I particularly like the IShares USA Quality Factor ETF (QUAL).<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>f. Take Some Profits<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>Another aspect of risk management is taking some profits at times. If a particular investment has seen spectacular returns and is fully priced, perhaps its time to take some money off the table. Build a reserve of cash to deploy when another good opportunity presents itself.<\/p>\r\n<p><\/p>\r\n<p><\/p>\r\n<h2 class=\"wp-block-heading\"><strong>Who Knows<\/strong><\/h2>\r\n<p><\/p>\r\n<p><\/p>\r\n<p>No one really knows when another market dip will occur, but chances are a broad market dip will occur at some point in the future. The bottomline is that if properly invested it is no time to panic sell. In fact, if properly prepared with some cash on hand, it could be an ideal time to pick up discounted assets on sale. This seems to be one major way people are able to build wealth over time.<\/p>\r\n<p><\/p>","protected":false},"excerpt":{"rendered":"<p>Assets across the board seem fully valued and recovered strongly from the pandemic. Hard to find deals or deep value out there. We discuss the potential for a stock market slowdown, (Is another one around the corner?) How to prepare and what to do with this information? Is there an ideal portfolio composition that can &#8230; <a href=\"https:\/\/truewealth.moneyvikings.com\/2021\/07\/everything-seems-overvalued-for-now\/\" class=\"more-link\">Read More<span class=\"screen-reader-text\"> &#8220;Everything Seems Overvalued for Now&#8221;<\/span> &raquo;<\/a><\/p>\n","protected":false},"author":2,"featured_media":12184,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false},"version":2}},"categories":[12],"tags":[],"class_list":["post-761","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-free"],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/truewealth.moneyvikings.com\/wp-content\/uploads\/2022\/03\/sharon-mccutcheon-dw6dfbohuu4-unsplash-scaled.jpeg","jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/761","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/comments?post=761"}],"version-history":[{"count":0,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/posts\/761\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media\/12184"}],"wp:attachment":[{"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/media?parent=761"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/categories?post=761"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/truewealth.moneyvikings.com\/wp-json\/wp\/v2\/tags?post=761"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}